$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.16',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '6.3.0',
          'Headers' => {
                         'abstract.h' => 1,
                         'crypto.h' => 1,
                         'dtls.h' => 1,
                         'gnutls.h' => 1,
                         'ocsp.h' => 1,
                         'openpgp.h' => 1,
                         'pkcs11.h' => 1,
                         'pkcs12.h' => 1,
                         'pkcs7.h' => 1,
                         'self-test.h' => 1,
                         'socket.h' => 1,
                         'system-keys.h' => 1,
                         'tpm.h' => 1,
                         'urls.h' => 1,
                         'x509-ext.h' => 1,
                         'x509.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libgnutls.so.30.23.0',
          'LibraryVersion' => '3.6.0',
          'NameSpaces' => {},
          'Needed' => {
                        'ld-linux-x86-64.so.2' => 1,
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libgmp.so.10' => 1,
                        'libhogweed.so.4' => 1,
                        'libidn2.so.0' => 1,
                        'libnettle.so.6' => 1,
                        'libp11-kit.so.0' => 1,
                        'libtasn1.so.6' => 1,

                                                     'gnutls_x509_spki_init@@GNUTLS_3_6_0' => 1,
                                                     'gnutls_x509_spki_set_rsa_pss_params@@GNUTLS_3_6_0' => 1,
                                                     'gnutls_x509_tlsfeatures_add@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_check_crt@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_deinit@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_get@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_init@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_cas@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_crls@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_named_crt@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_system_trust@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_trust_dir@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_trust_file@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_trust_mem@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_deinit@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_get_issuer@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_get_issuer_by_dn@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_get_issuer_by_subject_key_id@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_init@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_iter_deinit@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_iter_get_ca@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_remove_cas@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_remove_trust_file@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_remove_trust_mem@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_verify_crt2@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_verify_crt@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_verify_named_crt@@GNUTLS_3_4' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10034' => {
                                       'BaseType' => '152',
                                       'Name' => 'unsigned int const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10040' => {
                                       'BaseType' => '9918',
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '488',
                                       'Name' => 'gnutls_group_entry_st',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '10052' => {
                                       'BaseType' => '10040',
                                       'Name' => 'gnutls_group_entry_st const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '10057' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '492',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'oid',
                                                            'offset' => '8',
                                                            'type' => '110'
                                                          },
                                                   '2' => {
                                                            'name' => 'mac_oid',
                                                            'offset' => '16',
                                                            'type' => '110'
                                                          },
                                                   '3' => {
                                                            'name' => 'id',
                                                            'offset' => '24',
                                                            'type' => '2429'
                                                          },
                                                   '4' => {
                                                            'name' => 'output_size',
                                                            'offset' => '28',
                                                            'type' => '145'
                                                          },
                                                   '5' => {
                                                            'name' => 'key_size',
                                                            'offset' => '32',
                                                            'type' => '145'
                                                          },
                                                   '6' => {
                                                            'name' => 'nonce_size',
                                                            'offset' => '36',
                                                            'type' => '145'
                                                          },
                                                   '7' => {
                                                            'name' => 'placeholder',
                                                            'offset' => '40',
                                                            'type' => '145'
                                                          },
                                                   '8' => {
                                                            'name' => 'block_size',
                                                            'offset' => '44',
                                                            'type' => '145'
                                                          },
                                                   '9' => {
                                                            'name' => 'preimage_insecure',
                                                            'offset' => '48',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct mac_entry_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '1006' => {
                                      'BaseType' => '241',
                                      'Header' => 'unistd.h',
                                      'Line' => '277',
                                      'Name' => 'socklen_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '10200' => {
                                       'BaseType' => '10057',
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '503',
                                       'Name' => 'mac_entry_st',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '10212' => {
                                       'BaseType' => '10200',
                                       'Name' => 'mac_entry_st const',
                                       'Size' => '56',
                                       'Type' => 'Const'
                                     },
                          '103' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1030' => {
                                      'BaseType' => '235',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '10395' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '522',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'id',
                                                            'offset' => '8',
                                                            'type' => '2766'
                                                          },
                                                   '10' => {
                                                             'name' => 'selectable_prf',
                                                             'offset' => '28',
                                                             'type' => '9734'
                                                           },
                                                   '11' => {
                                                             'name' => 'obsolete',
                                                             'offset' => '29',
                                                             'type' => '9734'
                                                           },
                                                   '12' => {
                                                             'name' => 'false_start',
                                                             'offset' => '30',
                                                             'type' => '9734'
                                                           },
                                                   '2' => {
                                                            'name' => 'age',
                                                            'offset' => '12',
                                                            'type' => '145'
                                                          },
                                                   '3' => {
                                                            'name' => 'major',
                                                            'offset' => '16',
                                                            'type' => '957'
                                                          },
                                                   '4' => {
                                                            'name' => 'minor',
                                                            'offset' => '17',
                                                            'type' => '957'
                                                          },
                                                   '5' => {
                                                            'name' => 'transport',
                                                            'offset' => '20',
                                                            'type' => '5992'
                                                          },
                                                   '6' => {
                                                            'name' => 'supported',
                                                            'offset' => '24',
                                                            'type' => '9734'
                                                          },
                                                   '7' => {
                                                            'name' => 'explicit_iv',
                                                            'offset' => '25',
                                                            'type' => '9734'
                                                          },
                                                   '8' => {
                                                            'name' => 'extensions',
                                                            'offset' => '26',
                                                            'type' => '9734'
                                                          },
                                                   '9' => {
                                                            'name' => 'selectable_sighash',
                                                            'offset' => '27',
                                                            'type' => '9734'
                                                          }
                                                 },
                                       'Name' => 'struct version_entry_st',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '10407' => {
                                       'BaseType' => '10395',
                                       'Name' => 'version_entry_st const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '1042640' => {
                                         'BaseType' => '1042652',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2473',
                                         'Name' => 'gnutls_tdb_store_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1042652' => {
                                         'Name' => 'int(*)(char const*, char const*, char const*, time_t, gnutls_datum_t const*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '110'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '110'
                                                             },
                                                      '3' => {
                                                               'type' => '263'
                                                             },
                                                      '4' => {
                                                               'type' => '4549'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1042693' => {
                                         'BaseType' => '1042705',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2479',
                                         'Name' => 'gnutls_tdb_store_commitment_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1042705' => {
                                         'Name' => 'int(*)(char const*, char const*, char const*, time_t, gnutls_digest_algorithm_t, gnutls_datum_t const*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '110'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '110'
                                                             },
                                                      '3' => {
                                                               'type' => '263'
                                                             },
                                                      '4' => {
                                                               'type' => '2545'
                                                             },
                                                      '5' => {
                                                               'type' => '4549'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1042751' => {
                                         'BaseType' => '1042763',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2490',
                                         'Name' => 'gnutls_tdb_verify_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1042763' => {
                                         'Name' => 'int(*)(char const*, char const*, char const*, gnutls_datum_t const*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '110'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '110'
                                                             },
                                                      '3' => {
                                                               'type' => '4549'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1042799' => {
                                         'BaseType' => '1042811',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2497',
                                         'Name' => 'gnutls_tdb_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1042811' => {
                                         'BaseType' => '1042817',
                                         'Name' => 'struct gnutls_tdb_int*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1042817' => {
                                         'Line' => '38',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'store',
                                                              'offset' => '0',
                                                              'type' => '1042640'
                                                            },
                                                     '1' => {
                                                              'name' => 'cstore',
                                                              'offset' => '8',
                                                              'type' => '1042693'
                                                            },
                                                     '2' => {
                                                              'name' => 'verify',
                                                              'offset' => '16',
                                                              'type' => '1042751'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_tdb_int',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Source' => 'verify-tofu.c',
                                         'Type' => 'Struct'
                                       },
                          '10456' => {
                                       'BaseType' => '6096',
                                       'Header' => 'hash_int.h',
                                       'Line' => '39',
                                       'Name' => 'hash_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10467' => {
                                       'BaseType' => '6096',
                                       'Header' => 'hash_int.h',
                                       'Line' => '40',
                                       'Name' => 'nonce_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10478' => {
                                       'BaseType' => '6430',
                                       'Header' => 'hash_int.h',
                                       'Line' => '41',
                                       'Name' => 'output_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10489' => {
                                       'BaseType' => '4784',
                                       'Header' => 'hash_int.h',
                                       'Line' => '43',
                                       'Name' => 'hash_deinit_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1052768' => {
                                         'BaseType' => '1042799',
                                         'Name' => 'gnutls_tdb_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10591' => {
                                       'BaseType' => '10212',
                                       'Name' => 'mac_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10597' => {
                                       'Header' => 'hash_int.h',
                                       'Line' => '55',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'e',
                                                            'offset' => '0',
                                                            'type' => '10591'
                                                          },
                                                   '1' => {
                                                            'name' => 'hash',
                                                            'offset' => '8',
                                                            'type' => '10456'
                                                          },
                                                   '2' => {
                                                            'name' => 'output',
                                                            'offset' => '16',
                                                            'type' => '10478'
                                                          },
                                                   '3' => {
                                                            'name' => 'deinit',
                                                            'offset' => '24',
                                                            'type' => '10489'
                                                          },
                                                   '4' => {
                                                            'name' => 'key',
                                                            'offset' => '32',
                                                            'type' => '329'
                                                          },
                                                   '5' => {
                                                            'name' => 'keysize',
                                                            'offset' => '40',
                                                            'type' => '75'
                                                          },
                                                   '6' => {
                                                            'name' => 'handle',
                                                            'offset' => '48',
                                                            'type' => '211'
                                                          }
                                                 },
                                       'Name' => 'struct digest_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10699' => {
                                       'Header' => 'hash_int.h',
                                       'Line' => '67',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'e',
                                                            'offset' => '0',
                                                            'type' => '10591'
                                                          },
                                                   '1' => {
                                                            'name' => 'mac_len',
                                                            'offset' => '8',
                                                            'type' => '75'
                                                          },
                                                   '2' => {
                                                            'name' => 'hash',
                                                            'offset' => '16',
                                                            'type' => '10456'
                                                          },
                                                   '3' => {
                                                            'name' => 'setnonce',
                                                            'offset' => '24',
                                                            'type' => '10467'
                                                          },
                                                   '4' => {
                                                            'name' => 'output',
                                                            'offset' => '32',
                                                            'type' => '10478'
                                                          },
                                                   '5' => {
                                                            'name' => 'deinit',
                                                            'offset' => '40',
                                                            'type' => '10489'
                                                          },
                                                   '6' => {
                                                            'name' => 'handle',
                                                            'offset' => '48',
                                                            'type' => '211'
                                                          }
                                                 },
                                       'Name' => 'struct mac_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '1073168' => {
                                         'BaseType' => '164',
                                         'Header' => 'types.h',
                                         'Line' => '194',
                                         'Name' => 'int8_t',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '10732' => {
                                       'BaseType' => '6149',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '33',
                                       'Name' => 'cipher_encrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10743' => {
                                       'BaseType' => '6149',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '35',
                                       'Name' => 'cipher_decrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10754' => {
                                       'BaseType' => '6261',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '37',
                                       'Name' => 'aead_cipher_encrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10765' => {
                                       'BaseType' => '6261',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '43',
                                       'Name' => 'aead_cipher_decrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10776' => {
                                       'BaseType' => '4784',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '49',
                                       'Name' => 'cipher_deinit_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1077741' => {
                                         'BaseType' => '1077752',
                                         'Header' => 'tpm.h',
                                         'Line' => '36',
                                         'Name' => 'gnutls_tpm_key_list_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1077752' => {
                                         'BaseType' => '1077758',
                                         'Name' => 'struct tpm_key_list_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1077758' => {
                                         'Line' => '186',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'size',
                                                              'offset' => '0',
                                                              'type' => '1092884'
                                                            },
                                                     '1' => {
                                                              'name' => 'ki',
                                                              'offset' => '8',
                                                              'type' => '1094494'
                                                            },
                                                     '2' => {
                                                              'name' => 'tpm_ctx',
                                                              'offset' => '16',
                                                              'type' => '1092945'
                                                            }
                                                   },
                                         'Name' => 'struct tpm_key_list_st',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Source' => 'tpm.c',
                                         'Type' => 'Struct'
                                       },
                          '1077837' => {
                                         'Header' => 'tpm.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_RAW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_DER',
                                                              'value' => '0'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_CTK_PEM',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_tpmkey_fmt_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '10787' => {
                                       'BaseType' => '6096',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '51',
                                       'Name' => 'cipher_auth_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10798' => {
                                       'BaseType' => '6096',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '52',
                                       'Name' => 'cipher_setiv_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10809' => {
                                       'BaseType' => '6223',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '54',
                                       'Name' => 'cipher_tag_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1092851' => {
                                         'BaseType' => '957',
                                         'Header' => 'platform.h',
                                         'Line' => '17',
                                         'Name' => 'BYTE',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '1092862' => {
                                         'BaseType' => '1073168',
                                         'Header' => 'platform.h',
                                         'Line' => '18',
                                         'Name' => 'TSS_BOOL',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '1092873' => {
                                         'BaseType' => '973',
                                         'Header' => 'platform.h',
                                         'Line' => '19',
                                         'Name' => 'UINT16',
                                         'Size' => '2',
                                         'Type' => 'Typedef'
                                       },
                          '1092884' => {
                                         'BaseType' => '984',
                                         'Header' => 'platform.h',
                                         'Line' => '20',
                                         'Name' => 'UINT32',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1092906' => {
                                         'BaseType' => '1092851',
                                         'Name' => 'BYTE*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1092912' => {
                                         'BaseType' => '1092884',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '17',
                                         'Name' => 'TSS_FLAG',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1092934' => {
                                         'BaseType' => '1092884',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '20',
                                         'Name' => 'TSS_HOBJECT',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1092945' => {
                                         'BaseType' => '1092934',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '21',
                                         'Name' => 'TSS_HCONTEXT',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1093011' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '14',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'bMajor',
                                                              'offset' => '0',
                                                              'type' => '1092851'
                                                            },
                                                     '1' => {
                                                              'name' => 'bMinor',
                                                              'offset' => '1',
                                                              'type' => '1092851'
                                                            },
                                                     '2' => {
                                                              'name' => 'bRevMajor',
                                                              'offset' => '2',
                                                              'type' => '1092851'
                                                            },
                                                     '3' => {
                                                              'name' => 'bRevMinor',
                                                              'offset' => '3',
                                                              'type' => '1092851'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_VERSION',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Struct'
                                       },
                          '1093072' => {
                                         'BaseType' => '1093011',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '20',
                                         'Name' => 'TSS_VERSION',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1093083' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '62',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ulTimeLow',
                                                              'offset' => '0',
                                                              'type' => '1092884'
                                                            },
                                                     '1' => {
                                                              'name' => 'usTimeMid',
                                                              'offset' => '4',
                                                              'type' => '1092873'
                                                            },
                                                     '2' => {
                                                              'name' => 'usTimeHigh',
                                                              'offset' => '6',
                                                              'type' => '1092873'
                                                            },
                                                     '3' => {
                                                              'name' => 'bClockSeqHigh',
                                                              'offset' => '8',
                                                              'type' => '1092851'
                                                            },
                                                     '4' => {
                                                              'name' => 'bClockSeqLow',
                                                              'offset' => '9',
                                                              'type' => '1092851'
                                                            },
                                                     '5' => {
                                                              'name' => 'rgbNode',
                                                              'offset' => '10',
                                                              'type' => '1093168'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_UUID',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1093168' => {
                                         'BaseType' => '1092851',
                                         'Name' => 'BYTE[6]',
                                         'Size' => '6',
                                         'Type' => 'Array'
                                       },
                          '1093184' => {
                                         'BaseType' => '1093083',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '70',
                                         'Name' => 'TSS_UUID',
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '1093200' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '87',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'versionInfo',
                                                              'offset' => '0',
                                                              'type' => '1093072'
                                                            },
                                                     '1' => {
                                                              'name' => 'keyUUID',
                                                              'offset' => '4',
                                                              'type' => '1093184'
                                                            },
                                                     '2' => {
                                                              'name' => 'parentKeyUUID',
                                                              'offset' => '20',
                                                              'type' => '1093184'
                                                            },
                                                     '3' => {
                                                              'name' => 'bAuthDataUsage',
                                                              'offset' => '36',
                                                              'type' => '1092851'
                                                            },
                                                     '4' => {
                                                              'name' => 'persistentStorageType',
                                                              'offset' => '40',
                                                              'type' => '1092912'
                                                            },
                                                     '5' => {
                                                              'name' => 'persistentStorageTypeParent',
                                                              'offset' => '44',
                                                              'type' => '1092912'
                                                            },
                                                     '6' => {
                                                              'name' => 'fIsLoaded',
                                                              'offset' => '48',
                                                              'type' => '1092862'
                                                            },
                                                     '7' => {
                                                              'name' => 'ulVendorDataLength',
                                                              'offset' => '52',
                                                              'type' => '1092884'
                                                            },
                                                     '8' => {
                                                              'name' => 'rgbVendorData',
                                                              'offset' => '56',
                                                              'type' => '1092906'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_KM_KEYINFO2',
                                         'PrivateABI' => 1,
                                         'Size' => '64',
                                         'Type' => 'Struct'
                                       },
                          '1093321' => {
                                         'BaseType' => '1093200',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '101',
                                         'Name' => 'TSS_KM_KEYINFO2',
                                         'Size' => '64',
                                         'Type' => 'Typedef'
                                       },
                          '1094494' => {
                                         'BaseType' => '1093321',
                                         'Name' => 'TSS_KM_KEYINFO2*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10947' => {
                                       'BaseType' => '9753',
                                       'Name' => 'cipher_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10953' => {
                                       'Header' => 'cipher_int.h',
                                       'Line' => '67',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'handle',
                                                            'offset' => '0',
                                                            'type' => '211'
                                                          },
                                                   '1' => {
                                                            'name' => 'e',
                                                            'offset' => '8',
                                                            'type' => '10947'
                                                          },
                                                   '2' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '16',
                                                            'type' => '10732'
                                                          },
                                                   '3' => {
                                                            'name' => 'decrypt',
                                                            'offset' => '24',
                                                            'type' => '10743'
                                                          },
                                                   '4' => {
                                                            'name' => 'aead_encrypt',
                                                            'offset' => '32',
                                                            'type' => '10754'
                                                          },
                                                   '5' => {
                                                            'name' => 'aead_decrypt',
                                                            'offset' => '40',
                                                            'type' => '10765'
                                                          },
                                                   '6' => {
                                                            'name' => 'auth',
                                                            'offset' => '48',
                                                            'type' => '10787'
                                                          },
                                                   '7' => {
                                                            'name' => 'tag',
                                                            'offset' => '56',
                                                            'type' => '10809'
                                                          },
                                                   '8' => {
                                                            'name' => 'setiv',
                                                            'offset' => '64',
                                                            'type' => '10798'
                                                          },
                                                   '9' => {
                                                            'name' => 'deinit',
                                                            'offset' => '72',
                                                            'type' => '10776'
                                                          }
                                                 },
                                       'Name' => 'struct cipher_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '1095999' => {
                                         'BaseType' => '1077741',
                                         'Name' => 'gnutls_tpm_key_list_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10964' => {
                                       'Header' => 'cipher_int.h',
                                       'Line' => '191',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dig',
                                                            'offset' => '0',
                                                            'type' => '10597'
                                                          },
                                                   '1' => {
                                                            'name' => 'mac',
                                                            'offset' => '0',
                                                            'type' => '10699'
                                                          }
                                                 },
                                       'Name' => 'anon-union-cipher_int.h-191',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Union'
                                     },
                          '110' => {
                                     'BaseType' => '128',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '11100' => {
                                       'Header' => 'cipher_int.h',
                                       'Line' => '202',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cipher',
                                                            'offset' => '0',
                                                            'type' => '10953'
                                                          },
                                                   '1' => {
                                                            'name' => 'mac',
                                                            'offset' => '80',
                                                            'type' => '10964'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'is_mac',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ssl_hmac',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'non_null',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'etm',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '6' => {
                                                            'name' => 'tag_size',
                                                            'offset' => '144',
                                                            'type' => '52'
                                                          }
                                                 },
                                       'Name' => 'struct auth_cipher_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '11133' => {
                                       'BaseType' => '957',
                                       'Name' => 'uint8_t[2]',
                                       'Size' => '2',
                                       'Type' => 'Array'
                                     },
                          '11149' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '532',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'id',
                                                            'offset' => '0',
                                                            'type' => '11133'
                                                          }
                                                 },
                                       'Name' => 'struct sign_algorithm_st',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Struct'
                                     },
                          '11161' => {
                                       'BaseType' => '11149',
                                       'Name' => 'sign_algorithm_st const',
                                       'Size' => '2',
                                       'Type' => 'Const'
                                     },
                          '11493' => {
                                       'BaseType' => '957',
                                       'Name' => 'uint8_t[48]',
                                       'Size' => '48',
                                       'Type' => 'Array'
                                     },
                          '11509' => {
                                       'BaseType' => '957',
                                       'Name' => 'uint8_t[32]',
                                       'Size' => '32',
                                       'Type' => 'Array'
                                     },
                          '11525' => {
                                       'BaseType' => '10052',
                                       'Name' => 'gnutls_group_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11531' => {
                                       'BaseType' => '10407',
                                       'Name' => 'version_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11537' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '620',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '145'
                                                          },
                                                   '1' => {
                                                            'name' => 'epoch_read',
                                                            'offset' => '4',
                                                            'type' => '973'
                                                          },
                                                   '10' => {
                                                             'name' => 'session_id',
                                                             'offset' => '140',
                                                             'type' => '11509'
                                                           },
                                                   '11' => {
                                                             'name' => 'session_id_size',
                                                             'offset' => '172',
                                                             'type' => '957'
                                                           },
                                                   '12' => {
                                                             'name' => 'timestamp',
                                                             'offset' => '176',
                                                             'type' => '263'
                                                           },
                                                   '13' => {
                                                             'name' => 'max_record_send_size',
                                                             'offset' => '184',
                                                             'type' => '973'
                                                           },
                                                   '14' => {
                                                             'name' => 'max_record_recv_size',
                                                             'offset' => '186',
                                                             'type' => '973'
                                                           },
                                                   '15' => {
                                                             'name' => 'cert_type',
                                                             'offset' => '188',
                                                             'type' => '2816'
                                                           },
                                                   '16' => {
                                                             'name' => 'grp',
                                                             'offset' => '192',
                                                             'type' => '11525'
                                                           },
                                                   '17' => {
                                                             'name' => 'server_sign_algo',
                                                             'offset' => '200',
                                                             'type' => '3156'
                                                           },
                                                   '18' => {
                                                             'name' => 'client_sign_algo',
                                                             'offset' => '204',
                                                             'type' => '3156'
                                                           },
                                                   '19' => {
                                                             'name' => 'ext_master_secret',
                                                             'offset' => '208',
                                                             'type' => '957'
                                                           },
                                                   '2' => {
                                                            'name' => 'epoch_write',
                                                            'offset' => '6',
                                                            'type' => '973'
                                                          },
                                                   '20' => {
                                                             'name' => 'etm',
                                                             'offset' => '209',
                                                             'type' => '957'
                                                           },
                                                   '21' => {
                                                             'name' => 'do_recv_supplemental',
                                                             'offset' => '212',
                                                             'type' => '75'
                                                           },
                                                   '22' => {
                                                             'name' => 'do_send_supplemental',
                                                             'offset' => '216',
                                                             'type' => '75'
                                                           },
                                                   '23' => {
                                                             'name' => 'pversion',
                                                             'offset' => '224',
                                                             'type' => '11531'
                                                           },
                                                   '3' => {
                                                            'name' => 'epoch_next',
                                                            'offset' => '8',
                                                            'type' => '973'
                                                          },
                                                   '4' => {
                                                            'name' => 'epoch_min',
                                                            'offset' => '10',
                                                            'type' => '973'
                                                          },
                                                   '5' => {
                                                            'name' => 'cs',
                                                            'offset' => '16',
                                                            'type' => '11723'
                                                          },
                                                   '6' => {
                                                            'name' => 'prf_mac',
                                                            'offset' => '24',
                                                            'type' => '2429'
                                                          },
                                                   '7' => {
                                                            'name' => 'master_secret',
                                                            'offset' => '28',
                                                            'type' => '11493'
                                                          },
                                                   '8' => {
                                                            'name' => 'client_random',
                                                            'offset' => '76',
                                                            'type' => '11509'
                                                          },
                                                   '9' => {
                                                            'name' => 'server_random',
                                                            'offset' => '108',
                                                            'type' => '11509'
                                                          }
                                                 },
                                       'Name' => 'struct security_parameters_st',
                                       'PrivateABI' => 1,
                                       'Size' => '232',
                                       'Type' => 'Struct'
                                     },
                          '11587' => {
                                       'BaseType' => '145',
                                       'Name' => 'unsigned int[64]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '116' => {
                                     'BaseType' => '110',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '11603' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '665',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'priority',
                                                            'offset' => '0',
                                                            'type' => '11587'
                                                          },
                                                   '1' => {
                                                            'name' => 'algorithms',
                                                            'offset' => '256',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct priority_st',
                                       'PrivateABI' => 1,
                                       'Size' => '260',
                                       'Type' => 'Struct'
                                     },
                          '11653' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '672',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SR_DISABLED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SR_UNSAFE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SR_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SR_SAFE',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum safe_renegotiation_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '1166036' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '2046',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_RANDOM_ART_OPENSSH',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_random_art',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1166060' => {
                                         'BaseType' => '1166036',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2048',
                                         'Name' => 'gnutls_random_art_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '11665' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '676',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entry',
                                                            'offset' => '0',
                                                            'type' => '11707'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '2048',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct ciphersuite_list_st',
                                       'PrivateABI' => 1,
                                       'Size' => '2056',
                                       'Type' => 'Struct'
                                     },
                          '11707' => {
                                       'BaseType' => '11723',
                                       'Name' => 'gnutls_cipher_suite_entry_st const*[256]',
                                       'Size' => '2048',
                                       'Type' => 'Array'
                                     },
                          '11723' => {
                                       'BaseType' => '9913',
                                       'Name' => 'gnutls_cipher_suite_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11729' => {
                                       'BaseType' => '11665',
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '679',
                                       'Name' => 'ciphersuite_list_st',
                                       'Size' => '2056',
                                       'Type' => 'Typedef'
                                     },
                          '11741' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '681',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entry',
                                                            'offset' => '0',
                                                            'type' => '11797'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '512',
                                                            'type' => '145'
                                                          },
                                                   '2' => {
                                                            'name' => 'have_ffdhe',
                                                            'offset' => '516',
                                                            'type' => '9734'
                                                          }
                                                 },
                                       'Name' => 'struct group_list_st',
                                       'PrivateABI' => 1,
                                       'Size' => '520',
                                       'Type' => 'Struct'
                                     },
                          '11797' => {
                                       'BaseType' => '11525',
                                       'Name' => 'gnutls_group_entry_st const*[64]',
                                       'Size' => '512',
                                       'Type' => 'Array'
                                     },
                          '11813' => {
                                       'BaseType' => '11741',
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '685',
                                       'Name' => 'group_list_st',
                                       'Size' => '520',
                                       'Type' => 'Typedef'
                                     },
                          '11825' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '687',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entry',
                                                            'offset' => '0',
                                                            'type' => '11867'
                                                          },
                                                   '1' => {
                                                            'name' => 'size',
                                                            'offset' => '512',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct sign_algo_list_st',
                                       'PrivateABI' => 1,
                                       'Size' => '520',
                                       'Type' => 'Struct'
                                     },
                          '11867' => {
                                       'BaseType' => '246949',
                                       'Name' => 'struct gnutls_sign_entry_st const*[64]',
                                       'Size' => '512',
                                       'Type' => 'Array'
                                     },
                          '11889' => {
                                       'Header' => 'algorithms.h',
                                       'Line' => '308',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'oid',
                                                            'offset' => '8',
                                                            'type' => '110'
                                                          },
                                                   '2' => {
                                                            'name' => 'id',
                                                            'offset' => '16',
                                                            'type' => '3156'
                                                          },
                                                   '3' => {
                                                            'name' => 'pk',
                                                            'offset' => '20',
                                                            'type' => '2896'
                                                          },
                                                   '4' => {
                                                            'name' => 'hash',
                                                            'offset' => '24',
                                                            'type' => '2545'
                                                          },
                                                   '5' => {
                                                            'name' => 'aid',
                                                            'offset' => '28',
                                                            'type' => '11161'
                                                          },
                                                   '6' => {
                                                            'name' => 'slevel',
                                                            'offset' => '32',
                                                            'type' => '14455'
                                                          }
                                                 },
                                       'Name' => 'struct gnutls_sign_entry_st',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '1190394' => {
                                         'BaseType' => '817911',
                                         'Name' => 'gnutls_custom_url_st const',
                                         'Size' => '64',
                                         'Type' => 'Const'
                                       },
                          '1190764' => {
                                         'BaseType' => '1190394',
                                         'Name' => 'gnutls_custom_url_st const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1192' => {
                                      'BaseType' => '103',
                                      'Header' => 'sockaddr.h',
                                      'Line' => '28',
                                      'Name' => 'sa_family_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '11997' => {
                                       'BaseType' => '11825',
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '690',
                                       'Name' => 'sign_algo_list_st',
                                       'Size' => '520',
                                       'Type' => 'Typedef'
                                     },
                          '12009' => {
                                       'Name' => 'atomic_uint',
                                       'Size' => '4',
                                       'Type' => 'Intrinsic'
                                     },
                          '1203' => {
                                      'Header' => 'socket.h',
                                      'Line' => '170',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa_family',
                                                           'offset' => '0',
                                                           'type' => '1192'
                                                         },
                                                  '1' => {
                                                           'name' => 'sa_data',
                                                           'offset' => '2',
                                                           'type' => '1245'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '121' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '12195' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '817',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cookie',
                                                            'offset' => '0',
                                                            'type' => '11509'
                                                          },
                                                   '1' => {
                                                            'name' => 'cookie_len',
                                                            'offset' => '32',
                                                            'type' => '957'
                                                          },
                                                   '10' => {
                                                             'name' => 'async_term',
                                                             'offset' => '56',
                                                             'type' => '263'
                                                           },
                                                   '11' => {
                                                             'name' => 'last_retransmit',
                                                             'offset' => '64',
                                                             'type' => '285'
                                                           },
                                                   '12' => {
                                                             'name' => 'packets_dropped',
                                                             'offset' => '80',
                                                             'type' => '145'
                                                           },
                                                   '2' => {
                                                            'name' => 'hsk_write_seq',
                                                            'offset' => '34',
                                                            'type' => '973'
                                                          },
                                                   '3' => {
                                                            'name' => 'hsk_read_seq',
                                                            'offset' => '36',
                                                            'type' => '145'
                                                          },
                                                   '4' => {
                                                            'name' => 'mtu',
                                                            'offset' => '40',
                                                            'type' => '973'
                                                          },
                                                   '5' => {
                                                            'name' => 'flight_init',
                                                            'offset' => '42',
                                                            'type' => '9734'
                                                          },
                                                   '6' => {
                                                            'name' => 'last_flight',
                                                            'offset' => '43',
                                                            'type' => '9734'
                                                          },
                                                   '7' => {
                                                            'name' => 'retrans_timeout_ms',
                                                            'offset' => '44',
                                                            'type' => '145'
                                                          },
                                                   '8' => {
                                                            'name' => 'hsk_hello_verify_requests',
                                                            'offset' => '48',
                                                            'type' => '145'
                                                          },
                                                   '9' => {
                                                            'name' => 'actual_retrans_timeout_ms',
                                                            'offset' => '52',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct dtls_st',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '12207' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '819',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '75'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '4',
                                                            'type' => '75'
                                                          },
                                                   '2' => {
                                                            'name' => 'connect_only',
                                                            'offset' => '8',
                                                            'type' => '9734'
                                                          },
                                                   '3' => {
                                                            'name' => 'connect_addr',
                                                            'offset' => '16',
                                                            'type' => '1261'
                                                          },
                                                   '4' => {
                                                            'name' => 'connect_addrlen',
                                                            'offset' => '144',
                                                            'type' => '1006'
                                                          }
                                                 },
                                       'Name' => 'struct tfo_st',
                                       'PrivateABI' => 1,
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '12285' => {
                                       'BaseType' => '12207',
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '825',
                                       'Name' => 'tfo_st',
                                       'Size' => '152',
                                       'Type' => 'Typedef'
                                     },
                          '12297' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '1098',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '973'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '5572'
                                                          },
                                                   '2' => {
                                                            'name' => 'resumed_priv',
                                                            'offset' => '16',
                                                            'type' => '5572'
                                                          },
                                                   '3' => {
                                                            'name' => 'set',
                                                            'offset' => '24',
                                                            'type' => '957'
                                                          },
                                                   '4' => {
                                                            'name' => 'resumed_set',
                                                            'offset' => '25',
                                                            'type' => '957'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-gnutls_int.h-1098',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '1245' => {
                                      'BaseType' => '121',
                                      'Name' => 'char[14]',
                                      'Size' => '14',
                                      'Type' => 'Array'
                                    },
                          '1261' => {
                                      'Header' => 'socket.h',
                                      'Line' => '183',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ss_family',
                                                           'offset' => '0',
                                                           'type' => '1192'
                                                         },
                                                  '1' => {
                                                           'name' => '__ss_padding',
                                                           'offset' => '2',
                                                           'type' => '1310'
                                                         },
                                                  '2' => {
                                                           'name' => '__ss_align',
                                                           'offset' => '120',
                                                           'type' => '68'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_storage',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '128' => {
                                     'BaseType' => '121',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '129605' => {
                                        'BaseType' => '121',
                                        'Name' => 'char[32]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '1304912' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '606',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_OPENPGP_CERT',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_OPENPGP_CERT_FINGERPRINT',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_openpgp_crt_status_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1305072' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '689',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_FULL',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_ONELINE',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_UNSIGNED_FULL',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_COMPACT',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_FULL_NUMBERS',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_certificate_print_formats',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1305120' => {
                                         'BaseType' => '1305072',
                                         'Header' => 'gnutls.h',
                                         'Line' => '695',
                                         'Name' => 'gnutls_certificate_print_formats_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1308005' => {
                                         'Header' => 'openpgp.h',
                                         'Line' => '49',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_OPENPGP_FMT_RAW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_OPENPGP_FMT_BASE64',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_openpgp_crt_fmt',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1308034' => {
                                         'BaseType' => '1308005',
                                         'Header' => 'openpgp.h',
                                         'Line' => '52',
                                         'Name' => 'gnutls_openpgp_crt_fmt_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1310' => {
                                      'BaseType' => '121',
                                      'Name' => 'char[118]',
                                      'Size' => '118',
                                      'Type' => 'Array'
                                    },
                          '131576' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '220',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_PARAMS_RSA_EXPORT',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_PARAMS_DH',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'GNUTLS_PARAMS_ECDH',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_params_type_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '1317192' => {
                                         'BaseType' => '135830',
                                         'Name' => 'gnutls_openpgp_crt_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1317563' => {
                                         'BaseType' => '135853',
                                         'Name' => 'gnutls_openpgp_privkey_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '132474' => {
                                        'BaseType' => '2896',
                                        'Name' => 'gnutls_pk_algorithm_t const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '1326' => {
                                      'BaseType' => '1203',
                                      'Name' => 'struct sockaddr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '133119' => {
                                        'BaseType' => '133131',
                                        'Header' => 'gnutls.h',
                                        'Line' => '935',
                                        'Name' => 'gnutls_dh_params_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '133131' => {
                                        'BaseType' => '133137',
                                        'Name' => 'struct gnutls_dh_params_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133137' => {
                                        'Header' => 'gnutls_int.h',
                                        'Line' => '774',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'params',
                                                             'offset' => '0',
                                                             'type' => '143424'
                                                           },
                                                    '1' => {
                                                             'name' => 'q_bits',
                                                             'offset' => '16',
                                                             'type' => '75'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_dh_params_int',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '133177' => {
                                        'BaseType' => '133189',
                                        'Header' => 'gnutls.h',
                                        'Line' => '939',
                                        'Name' => 'gnutls_rsa_params_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '133189' => {
                                        'BaseType' => '133195',
                                        'Name' => 'struct gnutls_x509_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133195' => {
                                        'Header' => 'x509_int.h',
                                        'Line' => '134',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'params',
                                                             'offset' => '0',
                                                             'type' => '8064'
                                                           },
                                                    '1' => {
                                                             'name' => 'expanded',
                                                             'offset' => '464',
                                                             'type' => '145'
                                                           },
                                                    '2' => {
                                                             'name' => 'flags',
                                                             'offset' => '468',
                                                             'type' => '145'
                                                           },
                                                    '3' => {
                                                             'name' => 'key',
                                                             'offset' => '472',
                                                             'type' => '8455'
                                                           },
                                                    '4' => {
                                                             'name' => 'pin',
                                                             'offset' => '480',
                                                             'type' => '140685'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_privkey_int',
                                        'PrivateABI' => 1,
                                        'Size' => '496',
                                        'Type' => 'Struct'
                                      },
                          '133742' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '952',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dh',
                                                             'offset' => '0',
                                                             'type' => '133119'
                                                           },
                                                    '1' => {
                                                             'name' => 'rsa_export',
                                                             'offset' => '0',
                                                             'type' => '133177'
                                                           }
                                                  },
                                        'Name' => 'union params',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '133779' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '950',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '131576'
                                                           },
                                                    '1' => {
                                                             'name' => 'params',
                                                             'offset' => '8',
                                                             'type' => '133742'
                                                           },
                                                    '2' => {
                                                             'name' => 'deinit',
                                                             'offset' => '16',
                                                             'type' => '75'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_params_st',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '133832' => {
                                        'BaseType' => '133779',
                                        'Header' => 'gnutls.h',
                                        'Line' => '957',
                                        'Name' => 'gnutls_params_st',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '133844' => {
                                        'BaseType' => '133856',
                                        'Header' => 'gnutls.h',
                                        'Line' => '959',
                                        'Name' => 'gnutls_params_function',
                                        'Type' => 'Typedef'
                                      },
                          '133856' => {
                                        'Name' => 'int()(gnutls_session_t, gnutls_params_type_t, gnutls_params_st*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '3461'
                                                            },
                                                     '1' => {
                                                              'type' => '131576'
                                                            },
                                                     '2' => {
                                                              'type' => '133881'
                                                            }
                                                   },
                                        'Return' => '75',
                                        'Type' => 'Func'
                                      },
                          '133881' => {
                                        'BaseType' => '133832',
                                        'Name' => 'gnutls_params_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134413' => {
                                        'BaseType' => '4596',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1641',
                                        'Name' => 'gnutls_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '134436' => {
                                        'BaseType' => '133189',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1644',
                                        'Name' => 'gnutls_x509_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '134448' => {
                                        'BaseType' => '134460',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1650',
                                        'Name' => 'gnutls_x509_crt_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '134460' => {
                                        'BaseType' => '134466',
                                        'Name' => 'struct gnutls_x509_crt_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134466' => {
                                        'Header' => 'x509_int.h',
                                        'Line' => '77',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cert',
                                                             'offset' => '0',
                                                             'type' => '8455'
                                                           },
                                                    '1' => {
                                                             'name' => 'use_extensions',
                                                             'offset' => '8',
                                                             'type' => '75'
                                                           },
                                                    '10' => {
                                                              'name' => 'san',
                                                              'offset' => '104',
                                                              'type' => '146035'
                                                            },
                                                    '11' => {
                                                              'name' => 'ian',
                                                              'offset' => '112',
                                                              'type' => '146035'
                                                            },
                                                    '12' => {
                                                              'name' => 'dn',
                                                              'offset' => '120',
                                                              'type' => '146057'
                                                            },
                                                    '13' => {
                                                              'name' => 'idn',
                                                              'offset' => '128',
                                                              'type' => '146057'
                                                            },
                                                    '2' => {
                                                             'name' => 'expanded',
                                                             'offset' => '12',
                                                             'type' => '145'
                                                           },
                                                    '3' => {
                                                             'name' => 'modified',
                                                             'offset' => '16',
                                                             'type' => '145'
                                                           },
                                                    '4' => {
                                                             'name' => 'flags',
                                                             'offset' => '20',
                                                             'type' => '145'
                                                           },
                                                    '5' => {
                                                             'name' => 'pin',
                                                             'offset' => '24',
                                                             'type' => '140685'
                                                           },
                                                    '6' => {
                                                             'name' => 'raw_dn',
                                                             'offset' => '40',
                                                             'type' => '4000'
                                                           },
                                                    '7' => {
                                                             'name' => 'raw_issuer_dn',
                                                             'offset' => '56',
                                                             'type' => '4000'
                                                           },
                                                    '8' => {
                                                             'name' => 'raw_spki',
                                                             'offset' => '72',
                                                             'type' => '4000'
                                                           },
                                                    '9' => {
                                                             'name' => 'der',
                                                             'offset' => '88',
                                                             'type' => '4000'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_crt_int',
                                        'PrivateABI' => 1,
                                        'Size' => '136',
                                        'Type' => 'Struct'
                                      },
                          '134646' => {
                                        'BaseType' => '134658',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1663',
                                        'Name' => 'gnutls_certificate_credentials_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '134658' => {
                                        'BaseType' => '134664',
                                        'Name' => 'struct gnutls_certificate_credentials_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134664' => {
                                        'Header' => 'cert.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dh_params',
                                                             'offset' => '0',
                                                             'type' => '133119'
                                                           },
                                                    '1' => {
                                                             'name' => 'deinit_dh_params',
                                                             'offset' => '8',
                                                             'type' => '145'
                                                           },
                                                    '10' => {
                                                              'name' => 'verify_depth',
                                                              'offset' => '64',
                                                              'type' => '145'
                                                            },
                                                    '11' => {
                                                              'name' => 'verify_bits',
                                                              'offset' => '68',
                                                              'type' => '145'
                                                            },
                                                    '12' => {
                                                              'name' => 'get_cert_callback',
                                                              'offset' => '72',
                                                              'type' => '146250'
                                                            },
                                                    '13' => {
                                                              'name' => 'get_cert_callback2',
                                                              'offset' => '80',
                                                              'type' => '146256'
                                                            },
                                                    '14' => {
                                                              'name' => 'verify_callback',
                                                              'offset' => '88',
                                                              'type' => '14229'
                                                            },
                                                    '15' => {
                                                              'name' => 'pin',
                                                              'offset' => '96',
                                                              'type' => '140685'
                                                            },
                                                    '16' => {
                                                              'name' => 'pin_tmp',
                                                              'offset' => '112',
                                                              'type' => '129605'
                                                            },
                                                    '17' => {
                                                              'name' => 'glob_ocsp_func',
                                                              'offset' => '144',
                                                              'type' => '4607'
                                                            },
                                                    '18' => {
                                                              'name' => 'glob_ocsp_func_ptr',
                                                              'offset' => '152',
                                                              'type' => '211'
                                                            },
                                                    '2' => {
                                                             'name' => 'dh_sec_param',
                                                             'offset' => '12',
                                                             'type' => '3437'
                                                           },
                                                    '3' => {
                                                             'name' => 'params_func',
                                                             'offset' => '16',
                                                             'type' => '146238'
                                                           },
                                                    '4' => {
                                                             'name' => 'certs',
                                                             'offset' => '24',
                                                             'type' => '146244'
                                                           },
                                                    '5' => {
                                                             'name' => 'ncerts',
                                                             'offset' => '32',
                                                             'type' => '145'
                                                           },
                                                    '6' => {
                                                             'name' => 'sorted_cert_idx',
                                                             'offset' => '40',
                                                             'type' => '22483'
                                                           },
                                                    '7' => {
                                                             'name' => 'tlist',
                                                             'offset' => '48',
                                                             'type' => '136696'
                                                           },
                                                    '8' => {
                                                             'name' => 'flags',
                                                             'offset' => '56',
                                                             'type' => '145'
                                                           },
                                                    '9' => {
                                                             'name' => 'verify_flags',
                                                             'offset' => '60',
                                                             'type' => '145'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_certificate_credentials_st',
                                        'PrivateABI' => 1,
                                        'Size' => '160',
                                        'Type' => 'Struct'
                                      },
                          '135830' => {
                                        'BaseType' => '135842',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2285',
                                        'Name' => 'gnutls_openpgp_crt_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '135842' => {
                                        'BaseType' => '135848',
                                        'Name' => 'struct gnutls_openpgp_crt_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '135848' => {
                                        'Name' => 'struct gnutls_openpgp_crt_int',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '135853' => {
                                        'BaseType' => '135865',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2288',
                                        'Name' => 'gnutls_openpgp_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '135865' => {
                                        'BaseType' => '135871',
                                        'Name' => 'struct gnutls_openpgp_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '135871' => {
                                        'Name' => 'struct gnutls_openpgp_privkey_int',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '135876' => {
                                        'BaseType' => '135888',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2291',
                                        'Name' => 'gnutls_pkcs11_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '135888' => {
                                        'BaseType' => '135894',
                                        'Name' => 'struct gnutls_pkcs11_privkey_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '135894' => {
                                        'Header' => 'pkcs11_int.h',
                                        'Line' => '64',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pk_algorithm',
                                                             'offset' => '0',
                                                             'type' => '2896'
                                                           },
                                                    '1' => {
                                                             'name' => 'rsa_pss_ok',
                                                             'offset' => '4',
                                                             'type' => '145'
                                                           },
                                                    '2' => {
                                                             'name' => 'flags',
                                                             'offset' => '8',
                                                             'type' => '145'
                                                           },
                                                    '3' => {
                                                             'name' => 'uinfo',
                                                             'offset' => '16',
                                                             'type' => '630336'
                                                           },
                                                    '4' => {
                                                             'name' => 'url',
                                                             'offset' => '24',
                                                             'type' => '235'
                                                           },
                                                    '5' => {
                                                             'name' => 'sinfo',
                                                             'offset' => '32',
                                                             'type' => '630234'
                                                           },
                                                    '6' => {
                                                             'name' => 'ref',
                                                             'offset' => '384',
                                                             'type' => '626986'
                                                           },
                                                    '7' => {
                                                             'name' => 'reauth',
                                                             'offset' => '392',
                                                             'type' => '145'
                                                           },
                                                    '8' => {
                                                             'name' => 'mutex',
                                                             'offset' => '400',
                                                             'type' => '211'
                                                           },
                                                    '9' => {
                                                             'name' => 'pin',
                                                             'offset' => '408',
                                                             'type' => '140685'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_pkcs11_privkey_st',
                                        'PrivateABI' => 1,
                                        'Size' => '424',
                                        'Type' => 'Struct'
                                      },
                          '135937' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '2307',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_PRIVKEY_X509',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_PRIVKEY_OPENPGP',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'GNUTLS_PRIVKEY_PKCS11',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'GNUTLS_PRIVKEY_EXT',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_privkey_type_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '135949' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '2313',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x509',
                                                             'offset' => '0',
                                                             'type' => '135983'
                                                           },
                                                    '1' => {
                                                             'name' => 'pgp',
                                                             'offset' => '0',
                                                             'type' => '135830'
                                                           }
                                                  },
                                        'Name' => 'anon-union-gnutls.h-2313',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '135983' => {
                                        'BaseType' => '134448',
                                        'Name' => 'gnutls_x509_crt_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '135989' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '2319',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x509',
                                                             'offset' => '0',
                                                             'type' => '134436'
                                                           },
                                                    '1' => {
                                                             'name' => 'pgp',
                                                             'offset' => '0',
                                                             'type' => '135853'
                                                           },
                                                    '2' => {
                                                             'name' => 'pkcs11',
                                                             'offset' => '0',
                                                             'type' => '135876'
                                                           }
                                                  },
                                        'Name' => 'anon-union-gnutls.h-2319',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '136035' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '2309',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cert_type',
                                                             'offset' => '0',
                                                             'type' => '2816'
                                                           },
                                                    '1' => {
                                                             'name' => 'key_type',
                                                             'offset' => '4',
                                                             'type' => '135937'
                                                           },
                                                    '2' => {
                                                             'name' => 'cert',
                                                             'offset' => '8',
                                                             'type' => '135949'
                                                           },
                                                    '3' => {
                                                             'name' => 'ncerts',
                                                             'offset' => '16',
                                                             'type' => '145'
                                                           },
                                                    '4' => {
                                                             'name' => 'key',
                                                             'offset' => '24',
                                                             'type' => '135989'
                                                           },
                                                    '5' => {
                                                             'name' => 'deinit_all',
                                                             'offset' => '32',
                                                             'type' => '145'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_retr2_st',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '136127' => {
                                        'BaseType' => '136035',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2326',
                                        'Name' => 'gnutls_retr2_st',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '136139' => {
                                        'BaseType' => '136151',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2360',
                                        'Name' => 'gnutls_certificate_retrieve_function',
                                        'Type' => 'Typedef'
                                      },
                          '136151' => {
                                        'Name' => 'int()(gnutls_session_t, gnutls_datum_t const*, int, gnutls_pk_algorithm_t const*, int, gnutls_retr2_st*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '3461'
                                                            },
                                                     '1' => {
                                                              'type' => '4549'
                                                            },
                                                     '2' => {
                                                              'type' => '75'
                                                            },
                                                     '3' => {
                                                              'type' => '136191'
                                                            },
                                                     '4' => {
                                                              'type' => '75'
                                                            },
                                                     '5' => {
                                                              'type' => '136197'
                                                            }
                                                   },
                                        'Return' => '75',
                                        'Type' => 'Func'
                                      },
                          '136191' => {
                                        'BaseType' => '132474',
                                        'Name' => 'gnutls_pk_algorithm_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '136197' => {
                                        'BaseType' => '136127',
                                        'Name' => 'gnutls_retr2_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '136203' => {
                                        'BaseType' => '136215',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2601',
                                        'Name' => 'gnutls_pin_callback_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '136215' => {
                                        'Name' => 'int(*)(void*, int, char const*, char const*, unsigned int, char*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '211'
                                                            },
                                                     '1' => {
                                                              'type' => '75'
                                                            },
                                                     '2' => {
                                                              'type' => '110'
                                                            },
                                                     '3' => {
                                                              'type' => '110'
                                                            },
                                                     '4' => {
                                                              'type' => '145'
                                                            },
                                                     '5' => {
                                                              'type' => '235'
                                                            },
                                                     '6' => {
                                                              'type' => '52'
                                                            }
                                                   },
                                        'Return' => '75',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '136671' => {
                                        'Header' => 'x509_int.h',
                                        'Line' => '73',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'asn',
                                                             'offset' => '0',
                                                             'type' => '8455'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_dn_st',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '136696' => {
                                        'BaseType' => '136708',
                                        'Header' => 'x509.h',
                                        'Line' => '1474',
                                        'Name' => 'gnutls_x509_trust_list_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '136708' => {
                                        'BaseType' => '136714',
                                        'Name' => 'struct gnutls_x509_trust_list_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '136714' => {
                                        'Header' => 'verify-high.h',
                                        'Line' => '26',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'size',
                                                             'offset' => '0',
                                                             'type' => '145'
                                                           },
                                                    '1' => {
                                                             'name' => 'node',
                                                             'offset' => '8',
                                                             'type' => '472896'
                                                           },
                                                    '2' => {
                                                             'name' => 'x509_rdn_sequence',
                                                             'offset' => '16',
                                                             'type' => '4000'
                                                           },
                                                    '3' => {
                                                             'name' => 'blacklisted',
                                                             'offset' => '32',
                                                             'type' => '135983'
                                                           },
                                                    '4' => {
                                                             'name' => 'blacklisted_size',
                                                             'offset' => '40',
                                                             'type' => '145'
                                                           },
                                                    '5' => {
                                                             'name' => 'keep_certs',
                                                             'offset' => '48',
                                                             'type' => '135983'
                                                           },
                                                    '6' => {
                                                             'name' => 'keep_certs_size',
                                                             'offset' => '56',
                                                             'type' => '145'
                                                           },
                                                    '7' => {
                                                             'name' => 'pkcs11_token',
                                                             'offset' => '64',
                                                             'type' => '235'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_trust_list_st',
                                        'PrivateABI' => 1,
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '136784' => {
                                        'BaseType' => '136796',
                                        'Header' => 'abstract.h',
                                        'Line' => '646',
                                        'Name' => 'gnutls_certificate_retrieve_function2',
                                        'Type' => 'Typedef'
                                      },
                          '136796' => {
                                        'Name' => 'int()(gnutls_session_t, gnutls_datum_t const*, int, gnutls_pk_algorithm_t const*, int, gnutls_pcert_st**, unsigned int*, gnutls_privkey_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '3461'
                                                            },
                                                     '1' => {
                                                              'type' => '4549'
                                                            },
                                                     '2' => {
                                                              'type' => '75'
                                                            },
                                                     '3' => {
                                                              'type' => '136191'
                                                            },
                                                     '4' => {
                                                              'type' => '75'
                                                            },
                                                     '5' => {
                                                              'type' => '136846'
                                                            },
                                                     '6' => {
                                                              'type' => '22483'
                                                            },
                                                     '7' => {
                                                              'type' => '136864'
                                                            }
                                                   },
                                        'Return' => '75',
                                        'Type' => 'Func'
                                      },
                          '136846' => {
                                        'BaseType' => '5709',
                                        'Name' => 'gnutls_pcert_st**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '136864' => {
                                        'BaseType' => '134413',
                                        'Name' => 'gnutls_privkey_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1376911' => {
                                         'BaseType' => '1376922',
                                         'Header' => 'system-keys.h',
                                         'Line' => '41',
                                         'Name' => 'gnutls_system_key_iter_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1376922' => {
                                         'BaseType' => '1376928',
                                         'Name' => 'struct system_key_iter_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1376928' => {
                                         'Name' => 'struct system_key_iter_st',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1377431' => {
                                         'BaseType' => '1376911',
                                         'Name' => 'gnutls_system_key_iter_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1384415' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '166',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_GENERIC',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_LIB',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_LIB_VERSION',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_url_type_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1384500' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '292',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_ID_HEX',
                                                              'value' => '1'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LABEL',
                                                              'value' => '2'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_LABEL',
                                                              'value' => '3'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_SERIAL',
                                                              'value' => '4'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_MANUFACTURER',
                                                              'value' => '5'
                                                            },
                                                     '5' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_MODEL',
                                                              'value' => '6'
                                                            },
                                                     '6' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_ID',
                                                              'value' => '7'
                                                            },
                                                     '7' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_VERSION',
                                                              'value' => '8'
                                                            },
                                                     '8' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_DESCRIPTION',
                                                              'value' => '9'
                                                            },
                                                     '9' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_MANUFACTURER',
                                                              'value' => '10'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_obj_info_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1384556' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '327',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_LABEL',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_SERIAL',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MANUFACTURER',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MODEL',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MODNAME',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_token_info_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1398863' => {
                                         'BaseType' => '946168',
                                         'Name' => 'gnutls_pkcs11_obj_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1398869' => {
                                         'BaseType' => '1398863',
                                         'Name' => 'gnutls_pkcs11_obj_t*const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '14022' => {
                                       'BaseType' => '8823',
                                       'Name' => 'handshake_buffer_st[6]',
                                       'Size' => '432',
                                       'Type' => 'Array'
                                     },
                          '1403167' => {
                                         'BaseType' => '1398863',
                                         'Name' => 'gnutls_pkcs11_obj_t**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '14038' => {
                                       'Header' => 'auth.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'gnutls_generate_server_certificate',
                                                            'offset' => '8',
                                                            'type' => '14382'
                                                          },
                                                   '10' => {
                                                             'name' => 'gnutls_process_client_kx',
                                                             'offset' => '80',
                                                             'type' => '14413'
                                                           },
                                                   '11' => {
                                                             'name' => 'gnutls_process_client_crt_vrfy',
                                                             'offset' => '88',
                                                             'type' => '14413'
                                                           },
                                                   '12' => {
                                                             'name' => 'gnutls_process_server_crt_request',
                                                             'offset' => '96',
                                                             'type' => '14413'
                                                           },
                                                   '2' => {
                                                            'name' => 'gnutls_generate_client_certificate',
                                                            'offset' => '16',
                                                            'type' => '14382'
                                                          },
                                                   '3' => {
                                                            'name' => 'gnutls_generate_server_kx',
                                                            'offset' => '24',
                                                            'type' => '14382'
                                                          },
                                                   '4' => {
                                                            'name' => 'gnutls_generate_client_kx',
                                                            'offset' => '32',
                                                            'type' => '14382'
                                                          },
                                                   '5' => {
                                                            'name' => 'gnutls_generate_client_crt_vrfy',
                                                            'offset' => '40',
                                                            'type' => '14382'
                                                          },
                                                   '6' => {
                                                            'name' => 'gnutls_generate_server_crt_request',
                                                            'offset' => '48',
                                                            'type' => '14382'
                                                          },
                                                   '7' => {
                                                            'name' => 'gnutls_process_server_certificate',
                                                            'offset' => '56',
                                                            'type' => '14413'
                                                          },
                                                   '8' => {
                                                            'name' => 'gnutls_process_client_certificate',
                                                            'offset' => '64',
                                                            'type' => '14413'
                                                          },
                                                   '9' => {
                                                            'name' => 'gnutls_process_server_kx',
                                                            'offset' => '72',
                                                            'type' => '14413'
                                                          }
                                                 },
                                       'Name' => 'struct mod_auth_st_int',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '140685' => {
                                        'Header' => 'gnutls_int.h',
                                        'Line' => '439',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cb',
                                                             'offset' => '0',
                                                             'type' => '136203'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '211'
                                                           }
                                                  },
                                        'Name' => 'struct pin_info_st',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '1419590' => {
                                         'Header' => 'x509.h',
                                         'Line' => '1645',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'oid',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'critical',
                                                              'offset' => '8',
                                                              'type' => '145'
                                                            },
                                                     '2' => {
                                                              'name' => 'data',
                                                              'offset' => '16',
                                                              'type' => '4000'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_ext_st',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1419643' => {
                                         'BaseType' => '1419590',
                                         'Header' => 'x509.h',
                                         'Line' => '1649',
                                         'Name' => 'gnutls_x509_ext_st',
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '14207' => {
                                       'BaseType' => '14038',
                                       'Name' => 'struct mod_auth_st_int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14213' => {
                                       'BaseType' => '157',
                                       'Name' => 'unsigned char[36]',
                                       'Size' => '36',
                                       'Type' => 'Array'
                                     },
                          '14229' => {
                                       'BaseType' => '4233',
                                       'Name' => 'gnutls_certificate_verify_function*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14235' => {
                                       'BaseType' => '4365',
                                       'Name' => 'gnutls_typed_vdata_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14241' => {
                                       'BaseType' => '121',
                                       'Name' => 'char[129]',
                                       'Size' => '129',
                                       'Type' => 'Array'
                                     },
                          '14257' => {
                                       'Line' => '52',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '235'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '844534'
                                                          },
                                                   '2' => {
                                                            'name' => 'supp_recv_func',
                                                            'offset' => '16',
                                                            'type' => '845978'
                                                          },
                                                   '3' => {
                                                            'name' => 'supp_send_func',
                                                            'offset' => '24',
                                                            'type' => '845990'
                                                          }
                                                 },
                                       'Name' => 'struct gnutls_supplemental_entry_st',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'supplemental.c',
                                       'Type' => 'Struct'
                                     },
                          '14268' => {
                                       'Header' => 'extensions.h',
                                       'Line' => '59',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'free_struct',
                                                            'offset' => '8',
                                                            'type' => '145'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '12',
                                                            'type' => '973'
                                                          },
                                                   '3' => {
                                                            'name' => 'parse_type',
                                                            'offset' => '16',
                                                            'type' => '22340'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_func',
                                                            'offset' => '24',
                                                            'type' => '22098'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_func',
                                                            'offset' => '32',
                                                            'type' => '22147'
                                                          },
                                                   '6' => {
                                                            'name' => 'deinit_func',
                                                            'offset' => '40',
                                                            'type' => '22185'
                                                          },
                                                   '7' => {
                                                            'name' => 'pack_func',
                                                            'offset' => '48',
                                                            'type' => '22214'
                                                          },
                                                   '8' => {
                                                            'name' => 'unpack_func',
                                                            'offset' => '56',
                                                            'type' => '22252'
                                                          },
                                                   '9' => {
                                                            'name' => 'cannot_be_overriden',
                                                            'offset' => '64',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct extension_entry_st',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '14284' => {
                                       'BaseType' => '12297',
                                       'Name' => 'anon-struct-gnutls_int.h-1098[32]',
                                       'Size' => '1024',
                                       'Type' => 'Array'
                                     },
                          '14300' => {
                                       'BaseType' => '350041',
                                       'Name' => 'struct extension_entry_st const*[32]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '14322' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '1125',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_buffer',
                                                            'offset' => '0',
                                                            'type' => '8919'
                                                          },
                                                   '1' => {
                                                            'name' => 'handshake_hash_buffer_prev_len',
                                                            'offset' => '32',
                                                            'type' => '75'
                                                          },
                                                   '10' => {
                                                             'name' => 'may_not_read',
                                                             'offset' => '89',
                                                             'type' => '9734'
                                                           },
                                                   '100' => {
                                                              'name' => 'vc_status',
                                                              'offset' => '1532',
                                                              'type' => '145'
                                                            },
                                                   '101' => {
                                                              'name' => 'additional_verify_flags',
                                                              'offset' => '1536',
                                                              'type' => '145'
                                                            },
                                                   '102' => {
                                                              'name' => 'cert_hash',
                                                              'offset' => '1540',
                                                              'type' => '11509'
                                                            },
                                                   '103' => {
                                                              'name' => 'cert_hash_set',
                                                              'offset' => '1572',
                                                              'type' => '9734'
                                                            },
                                                   '104' => {
                                                              'name' => 'saved_username',
                                                              'offset' => '1573',
                                                              'type' => '14241'
                                                            },
                                                   '105' => {
                                                              'name' => 'saved_username_set',
                                                              'offset' => '1702',
                                                              'type' => '9734'
                                                            },
                                                   '106' => {
                                                              'name' => 'false_start_used',
                                                              'offset' => '1703',
                                                              'type' => '9734'
                                                            },
                                                   '107' => {
                                                              'name' => 'tfo',
                                                              'offset' => '1704',
                                                              'type' => '12285'
                                                            },
                                                   '108' => {
                                                              'name' => 'rsup',
                                                              'offset' => '1856',
                                                              'type' => '855047'
                                                            },
                                                   '109' => {
                                                              'name' => 'rsup_size',
                                                              'offset' => '1864',
                                                              'type' => '145'
                                                            },
                                                   '11' => {
                                                             'name' => 'may_not_write',
                                                             'offset' => '90',
                                                             'type' => '9734'
                                                           },
                                                   '110' => {
                                                              'name' => 'rexts',
                                                              'offset' => '1872',
                                                              'type' => '350664'
                                                            },
                                                   '111' => {
                                                              'name' => 'rexts_size',
                                                              'offset' => '1880',
                                                              'type' => '145'
                                                            },
                                                   '112' => {
                                                              'name' => 'ext_data',
                                                              'offset' => '1888',
                                                              'type' => '14284'
                                                            },
                                                   '113' => {
                                                              'name' => 'used_exts',
                                                              'offset' => '2912',
                                                              'type' => '14300'
                                                            },
                                                   '114' => {
                                                              'name' => 'used_exts_size',
                                                              'offset' => '3168',
                                                              'type' => '145'
                                                            },
                                                   '115' => {
                                                              'name' => 'max_recv_size',
                                                              'offset' => '3172',
                                                              'type' => '145'
                                                            },
                                                   '116' => {
                                                              'name' => 'have_ffdhe',
                                                              'offset' => '3176',
                                                              'type' => '9734'
                                                            },
                                                   '117' => {
                                                              'name' => 'cand_ec_group',
                                                              'offset' => '3184',
                                                              'type' => '11525'
                                                            },
                                                   '118' => {
                                                              'name' => 'cand_dh_group',
                                                              'offset' => '3192',
                                                              'type' => '11525'
                                                            },
                                                   '12' => {
                                                             'name' => 'read_eof',
                                                             'offset' => '91',
                                                             'type' => '9734'
                                                           },
                                                   '13' => {
                                                             'name' => 'last_alert',
                                                             'offset' => '92',
                                                             'type' => '75'
                                                           },
                                                   '14' => {
                                                             'name' => 'last_handshake_in',
                                                             'offset' => '96',
                                                             'type' => '75'
                                                           },
                                                   '15' => {
                                                             'name' => 'last_handshake_out',
                                                             'offset' => '100',
                                                             'type' => '75'
                                                           },
                                                   '16' => {
                                                             'name' => 'priorities',
                                                             'offset' => '104',
                                                             'type' => '3548'
                                                           },
                                                   '17' => {
                                                             'name' => 'allow_large_records',
                                                             'offset' => '112',
                                                             'type' => '9734'
                                                           },
                                                   '18' => {
                                                             'name' => 'no_etm',
                                                             'offset' => '113',
                                                             'type' => '9734'
                                                           },
                                                   '19' => {
                                                             'name' => 'no_ext_master_secret',
                                                             'offset' => '114',
                                                             'type' => '9734'
                                                           },
                                                   '2' => {
                                                            'name' => 'handshake_hash_buffer_client_kx_len',
                                                            'offset' => '36',
                                                            'type' => '145'
                                                          },
                                                   '20' => {
                                                             'name' => 'allow_key_usage_violation',
                                                             'offset' => '115',
                                                             'type' => '9734'
                                                           },
                                                   '21' => {
                                                             'name' => 'allow_wrong_pms',
                                                             'offset' => '116',
                                                             'type' => '9734'
                                                           },
                                                   '22' => {
                                                             'name' => 'dumbfw',
                                                             'offset' => '117',
                                                             'type' => '9734'
                                                           },
                                                   '23' => {
                                                             'name' => 'dh_prime_bits',
                                                             'offset' => '120',
                                                             'type' => '145'
                                                           },
                                                   '24' => {
                                                             'name' => 'resumed',
                                                             'offset' => '124',
                                                             'type' => '9734'
                                                           },
                                                   '25' => {
                                                             'name' => 'resumption_requested',
                                                             'offset' => '125',
                                                             'type' => '9734'
                                                           },
                                                   '26' => {
                                                             'name' => 'resumed_security_parameters',
                                                             'offset' => '128',
                                                             'type' => '11537'
                                                           },
                                                   '27' => {
                                                             'name' => 'resumption_data',
                                                             'offset' => '360',
                                                             'type' => '4000'
                                                           },
                                                   '28' => {
                                                             'name' => 'handshake_send_buffer',
                                                             'offset' => '376',
                                                             'type' => '8919'
                                                           },
                                                   '29' => {
                                                             'name' => 'handshake_recv_buffer',
                                                             'offset' => '408',
                                                             'type' => '14022'
                                                           },
                                                   '3' => {
                                                            'name' => 'handshake_hash_buffer',
                                                            'offset' => '40',
                                                            'type' => '8533'
                                                          },
                                                   '30' => {
                                                             'name' => 'handshake_recv_buffer_size',
                                                             'offset' => '840',
                                                             'type' => '75'
                                                           },
                                                   '31' => {
                                                             'name' => 'record_recv_buffer',
                                                             'offset' => '848',
                                                             'type' => '8919'
                                                           },
                                                   '32' => {
                                                             'name' => 'record_send_buffer',
                                                             'offset' => '880',
                                                             'type' => '8919'
                                                           },
                                                   '33' => {
                                                             'name' => 'record_send_buffer_user_size',
                                                             'offset' => '912',
                                                             'type' => '52'
                                                           },
                                                   '34' => {
                                                             'name' => 'record_flush_mode',
                                                             'offset' => '920',
                                                             'type' => '6032'
                                                           },
                                                   '35' => {
                                                             'name' => 'record_presend_buffer',
                                                             'offset' => '928',
                                                             'type' => '8533'
                                                           },
                                                   '36' => {
                                                             'name' => 'expire_time',
                                                             'offset' => '960',
                                                             'type' => '263'
                                                           },
                                                   '37' => {
                                                             'name' => 'auth_struct',
                                                             'offset' => '968',
                                                             'type' => '14207'
                                                           },
                                                   '38' => {
                                                             'name' => 'adv_version_major',
                                                             'offset' => '976',
                                                             'type' => '957'
                                                           },
                                                   '39' => {
                                                             'name' => 'adv_version_minor',
                                                             'offset' => '977',
                                                             'type' => '957'
                                                           },
                                                   '4' => {
                                                            'name' => 'resumable',
                                                            'offset' => '72',
                                                            'type' => '9734'
                                                          },
                                                   '40' => {
                                                             'name' => 'send_cert_req',
                                                             'offset' => '980',
                                                             'type' => '145'
                                                           },
                                                   '41' => {
                                                             'name' => 'max_handshake_data_buffer_size',
                                                             'offset' => '984',
                                                             'type' => '52'
                                                           },
                                                   '42' => {
                                                             'name' => 'pull_timeout_func',
                                                             'offset' => '992',
                                                             'type' => '5127'
                                                           },
                                                   '43' => {
                                                             'name' => 'pull_func',
                                                             'offset' => '1000',
                                                             'type' => '5041'
                                                           },
                                                   '44' => {
                                                             'name' => 'push_func',
                                                             'offset' => '1008',
                                                             'type' => '5084'
                                                           },
                                                   '45' => {
                                                             'name' => 'vec_push_func',
                                                             'offset' => '1016',
                                                             'type' => '5165'
                                                           },
                                                   '46' => {
                                                             'name' => 'errno_func',
                                                             'offset' => '1024',
                                                             'type' => '5214'
                                                           },
                                                   '47' => {
                                                             'name' => 'transport_recv_ptr',
                                                             'offset' => '1032',
                                                             'type' => '3449'
                                                           },
                                                   '48' => {
                                                             'name' => 'transport_send_ptr',
                                                             'offset' => '1040',
                                                             'type' => '3449'
                                                           },
                                                   '49' => {
                                                             'name' => 'db_store_func',
                                                             'offset' => '1048',
                                                             'type' => '4377'
                                                           },
                                                   '5' => {
                                                            'name' => 'ticket_sent',
                                                            'offset' => '73',
                                                            'type' => '9734'
                                                          },
                                                   '50' => {
                                                             'name' => 'db_retrieve_func',
                                                             'offset' => '1056',
                                                             'type' => '4458'
                                                           },
                                                   '51' => {
                                                             'name' => 'db_remove_func',
                                                             'offset' => '1064',
                                                             'type' => '4420'
                                                           },
                                                   '52' => {
                                                             'name' => 'db_ptr',
                                                             'offset' => '1072',
                                                             'type' => '211'
                                                           },
                                                   '53' => {
                                                             'name' => 'user_hello_func',
                                                             'offset' => '1080',
                                                             'type' => '4555'
                                                           },
                                                   '54' => {
                                                             'name' => 'h_hook',
                                                             'offset' => '1088',
                                                             'type' => '4496'
                                                           },
                                                   '55' => {
                                                             'name' => 'h_type',
                                                             'offset' => '1096',
                                                             'type' => '145'
                                                           },
                                                   '56' => {
                                                             'name' => 'h_post',
                                                             'offset' => '1100',
                                                             'type' => '274'
                                                           },
                                                   '57' => {
                                                             'name' => 'selected_cert_list',
                                                             'offset' => '1104',
                                                             'type' => '5709'
                                                           },
                                                   '58' => {
                                                             'name' => 'selected_cert_list_length',
                                                             'offset' => '1112',
                                                             'type' => '274'
                                                           },
                                                   '59' => {
                                                             'name' => 'selected_key',
                                                             'offset' => '1120',
                                                             'type' => '4596'
                                                           },
                                                   '6' => {
                                                            'name' => 'bye_state',
                                                            'offset' => '76',
                                                            'type' => '8328'
                                                          },
                                                   '60' => {
                                                             'name' => 'selected_need_free',
                                                             'offset' => '1128',
                                                             'type' => '9734'
                                                           },
                                                   '61' => {
                                                             'name' => 'selected_ocsp_func',
                                                             'offset' => '1136',
                                                             'type' => '4607'
                                                           },
                                                   '62' => {
                                                             'name' => 'selected_ocsp_func_ptr',
                                                             'offset' => '1144',
                                                             'type' => '211'
                                                           },
                                                   '63' => {
                                                             'name' => 'default_record_version',
                                                             'offset' => '1152',
                                                             'type' => '11133'
                                                           },
                                                   '64' => {
                                                             'name' => 'default_hello_version',
                                                             'offset' => '1154',
                                                             'type' => '11133'
                                                           },
                                                   '65' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '1160',
                                                             'type' => '211'
                                                           },
                                                   '66' => {
                                                             'name' => 'direction',
                                                             'offset' => '1168',
                                                             'type' => '9734'
                                                           },
                                                   '67' => {
                                                             'name' => 'ignore_rdn_sequence',
                                                             'offset' => '1169',
                                                             'type' => '9734'
                                                           },
                                                   '68' => {
                                                             'name' => 'rsa_pms_version',
                                                             'offset' => '1170',
                                                             'type' => '11133'
                                                           },
                                                   '69' => {
                                                             'name' => 'errnum',
                                                             'offset' => '1172',
                                                             'type' => '75'
                                                           },
                                                   '7' => {
                                                            'name' => 'handshake_final_state',
                                                            'offset' => '80',
                                                            'type' => '8282'
                                                          },
                                                   '70' => {
                                                             'name' => 'srp_prime_bits',
                                                             'offset' => '1176',
                                                             'type' => '973'
                                                           },
                                                   '71' => {
                                                             'name' => 'initial_negotiation_completed',
                                                             'offset' => '1178',
                                                             'type' => '9734'
                                                           },
                                                   '72' => {
                                                             'name' => 'transport',
                                                             'offset' => '1180',
                                                             'type' => '5992'
                                                           },
                                                   '73' => {
                                                             'name' => 'dtls',
                                                             'offset' => '1184',
                                                             'type' => '12195'
                                                           },
                                                   '74' => {
                                                             'name' => 'handshake_suspicious_loops',
                                                             'offset' => '1272',
                                                             'type' => '145'
                                                           },
                                                   '75' => {
                                                             'name' => 'handshake_in_progress',
                                                             'offset' => '1276',
                                                             'type' => '9734'
                                                           },
                                                   '76' => {
                                                             'name' => 'premaster_set',
                                                             'offset' => '1277',
                                                             'type' => '9734'
                                                           },
                                                   '77' => {
                                                             'name' => 'cb_tls_unique_len',
                                                             'offset' => '1280',
                                                             'type' => '145'
                                                           },
                                                   '78' => {
                                                             'name' => 'cb_tls_unique',
                                                             'offset' => '1284',
                                                             'type' => '14213'
                                                           },
                                                   '79' => {
                                                             'name' => 'handshake_start_time',
                                                             'offset' => '1320',
                                                             'type' => '285'
                                                           },
                                                   '8' => {
                                                            'name' => 'handshake_state',
                                                            'offset' => '84',
                                                            'type' => '8282'
                                                          },
                                                   '80' => {
                                                             'name' => 'handshake_endtime',
                                                             'offset' => '1336',
                                                             'type' => '263'
                                                           },
                                                   '81' => {
                                                             'name' => 'handshake_timeout_ms',
                                                             'offset' => '1344',
                                                             'type' => '145'
                                                           },
                                                   '82' => {
                                                             'name' => 'record_timeout_ms',
                                                             'offset' => '1348',
                                                             'type' => '145'
                                                           },
                                                   '83' => {
                                                             'name' => 'crt_requested',
                                                             'offset' => '1352',
                                                             'type' => '145'
                                                           },
                                                   '84' => {
                                                             'name' => 'hb_local_data',
                                                             'offset' => '1360',
                                                             'type' => '8533'
                                                           },
                                                   '85' => {
                                                             'name' => 'hb_remote_data',
                                                             'offset' => '1392',
                                                             'type' => '8533'
                                                           },
                                                   '86' => {
                                                             'name' => 'hb_ping_start',
                                                             'offset' => '1424',
                                                             'type' => '285'
                                                           },
                                                   '87' => {
                                                             'name' => 'hb_ping_sent',
                                                             'offset' => '1440',
                                                             'type' => '285'
                                                           },
                                                   '88' => {
                                                             'name' => 'hb_actual_retrans_timeout_ms',
                                                             'offset' => '1456',
                                                             'type' => '145'
                                                           },
                                                   '89' => {
                                                             'name' => 'hb_retrans_timeout_ms',
                                                             'offset' => '1460',
                                                             'type' => '145'
                                                           },
                                                   '9' => {
                                                            'name' => 'invalid_connection',
                                                            'offset' => '88',
                                                            'type' => '9734'
                                                          },
                                                   '90' => {
                                                             'name' => 'hb_total_timeout_ms',
                                                             'offset' => '1464',
                                                             'type' => '145'
                                                           },
                                                   '91' => {
                                                             'name' => 'ocsp_check_ok',
                                                             'offset' => '1468',
                                                             'type' => '9734'
                                                           },
                                                   '92' => {
                                                             'name' => 'hb_state',
                                                             'offset' => '1472',
                                                             'type' => '8374'
                                                           },
                                                   '93' => {
                                                             'name' => 'recv_state',
                                                             'offset' => '1476',
                                                             'type' => '8427'
                                                           },
                                                   '94' => {
                                                             'name' => 'sc_random_set',
                                                             'offset' => '1480',
                                                             'type' => '9734'
                                                           },
                                                   '95' => {
                                                             'name' => 'flags',
                                                             'offset' => '1484',
                                                             'type' => '145'
                                                           },
                                                   '96' => {
                                                             'name' => 'verify_callback',
                                                             'offset' => '1488',
                                                             'type' => '14229'
                                                           },
                                                   '97' => {
                                                             'name' => 'vc_data',
                                                             'offset' => '1496',
                                                             'type' => '14235'
                                                           },
                                                   '98' => {
                                                             'name' => 'vc_sdata',
                                                             'offset' => '1504',
                                                             'type' => '4365'
                                                           },
                                                   '99' => {
                                                             'name' => 'vc_elements',
                                                             'offset' => '1528',
                                                             'type' => '145'
                                                           }
                                                 },
                                       'Name' => 'struct internals_st',
                                       'PrivateABI' => 1,
                                       'Size' => '3200',
                                       'Type' => 'Struct'
                                     },
                          '1433373' => {
                                         'BaseType' => '1419643',
                                         'Name' => 'gnutls_x509_ext_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '14334' => {
                                       'BaseType' => '14350',
                                       'Name' => 'record_parameters_st*[4]',
                                       'Size' => '32',
                                       'Type' => 'Array'
                                     },
                          '1433760' => {
                                         'BaseType' => '1433373',
                                         'Name' => 'gnutls_x509_ext_st**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '143424' => {
                                        'BaseType' => '7079',
                                        'Name' => 'bigint_t[2]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '14350' => {
                                       'BaseType' => '9406',
                                       'Name' => 'record_parameters_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14376' => {
                                       'BaseType' => '8533',
                                       'Name' => 'gnutls_buffer_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14382' => {
                                       'Name' => 'int(*)(gnutls_session_t, gnutls_buffer_st*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3461'
                                                           },
                                                    '1' => {
                                                             'type' => '14376'
                                                           }
                                                  },
                                       'Return' => '75',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14413' => {
                                       'Name' => 'int(*)(gnutls_session_t, uint8_t*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3461'
                                                           },
                                                    '1' => {
                                                             'type' => '8527'
                                                           },
                                                    '2' => {
                                                             'type' => '52'
                                                           }
                                                  },
                                       'Return' => '75',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '14419' => {
                                       'Header' => 'algorithms.h',
                                       'Line' => '302',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_SECURE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => '_INSECURE_FOR_CERTS',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => '_INSECURE',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum hash_security_level_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '14455' => {
                                       'BaseType' => '14419',
                                       'Header' => 'algorithms.h',
                                       'Line' => '306',
                                       'Name' => 'hash_security_level_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '145' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '146035' => {
                                        'BaseType' => '146046',
                                        'Header' => 'x509-ext.h',
                                        'Line' => '37',
                                        'Name' => 'gnutls_subject_alt_names_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '146046' => {
                                        'BaseType' => '146052',
                                        'Name' => 'struct gnutls_subject_alt_names_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146052' => {
                                        'Line' => '36',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'names',
                                                             'offset' => '0',
                                                             'type' => '2253567'
                                                           },
                                                    '1' => {
                                                             'name' => 'size',
                                                             'offset' => '8',
                                                             'type' => '145'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_subject_alt_names_st',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'x509_ext.c',
                                        'Type' => 'Struct'
                                      },
                          '146057' => {
                                        'BaseType' => '136671',
                                        'Header' => 'x509_int.h',
                                        'Line' => '75',
                                        'Name' => 'gnutls_x509_dn_st',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '146068' => {
                                        'Header' => 'str_array.h',
                                        'Line' => '33',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'str',
                                                             'offset' => '0',
                                                             'type' => '235'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '145'
                                                           },
                                                    '2' => {
                                                             'name' => 'next',
                                                             'offset' => '16',
                                                             'type' => '146117'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_str_array_st',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '146117' => {
                                        'BaseType' => '146068',
                                        'Name' => 'struct gnutls_str_array_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146123' => {
                                        'BaseType' => '146117',
                                        'Header' => 'str_array.h',
                                        'Line' => '37',
                                        'Name' => 'gnutls_str_array_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '146227' => {
                                        'Header' => 'cert.h',
                                        'Line' => '44',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cert_list',
                                                             'offset' => '0',
                                                             'type' => '5709'
                                                           },
                                                    '1' => {
                                                             'name' => 'cert_list_length',
                                                             'offset' => '8',
                                                             'type' => '145'
                                                           },
                                                    '2' => {
                                                             'name' => 'names',
                                                             'offset' => '16',
                                                             'type' => '146123'
                                                           },
                                                    '3' => {
                                                             'name' => 'ocsp_func',
                                                             'offset' => '24',
                                                             'type' => '4607'
                                                           },
                                                    '4' => {
                                                             'name' => 'ocsp_func_ptr',
                                                             'offset' => '32',
                                                             'type' => '211'
                                                           },
                                                    '5' => {
                                                             'name' => 'ocsp_response_file',
                                                             'offset' => '40',
                                                             'type' => '235'
                                                           },
                                                    '6' => {
                                                             'name' => 'pkey',
                                                             'offset' => '48',
                                                             'type' => '134413'
                                                           }
                                                  },
                                        'Name' => 'struct certs_st',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '146238' => {
                                        'BaseType' => '133844',
                                        'Name' => 'gnutls_params_function*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146244' => {
                                        'BaseType' => '146227',
                                        'Name' => 'certs_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146250' => {
                                        'BaseType' => '136139',
                                        'Name' => 'gnutls_certificate_retrieve_function*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146256' => {
                                        'BaseType' => '136784',
                                        'Name' => 'gnutls_certificate_retrieve_function2*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '14903' => {
                                       'BaseType' => '4065',
                                       'Name' => 'gnutls_range_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '152' => {
                                     'BaseType' => '145',
                                     'Name' => 'unsigned int const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '1531394' => {
                                         'BaseType' => '1531406',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2063',
                                         'Name' => 'gnutls_srp_server_credentials_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1531406' => {
                                         'BaseType' => '1531412',
                                         'Name' => 'struct gnutls_srp_server_credentials_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1531412' => {
                                         'Header' => 'srp_kx.h',
                                         'Line' => '34',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'password_file',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'password_conf_file',
                                                              'offset' => '8',
                                                              'type' => '235'
                                                            },
                                                     '2' => {
                                                              'name' => 'pwd_callback',
                                                              'offset' => '16',
                                                              'type' => '1541033'
                                                            },
                                                     '3' => {
                                                              'name' => 'fake_salt_seed',
                                                              'offset' => '24',
                                                              'type' => '4000'
                                                            },
                                                     '4' => {
                                                              'name' => 'fake_salt_length',
                                                              'offset' => '40',
                                                              'type' => '145'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_srp_server_credentials_st',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1531485' => {
                                         'BaseType' => '1531497',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2065',
                                         'Name' => 'gnutls_srp_client_credentials_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1531497' => {
                                         'BaseType' => '1531503',
                                         'Name' => 'struct gnutls_srp_client_credentials_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1531503' => {
                                         'Header' => 'srp_kx.h',
                                         'Line' => '28',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'username',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'password',
                                                              'offset' => '8',
                                                              'type' => '235'
                                                            },
                                                     '2' => {
                                                              'name' => 'get_function',
                                                              'offset' => '16',
                                                              'type' => '1541027'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_srp_client_credentials_st',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1531816' => {
                                         'BaseType' => '1531828',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2134',
                                         'Name' => 'gnutls_srp_server_credentials_function',
                                         'Type' => 'Typedef'
                                       },
                          '1531828' => {
                                         'Name' => 'int()(gnutls_session_t, char const*, gnutls_datum_t*, gnutls_datum_t*, gnutls_datum_t*, gnutls_datum_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3461'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '4650'
                                                             },
                                                      '3' => {
                                                               'type' => '4650'
                                                             },
                                                      '4' => {
                                                               'type' => '4650'
                                                             },
                                                      '5' => {
                                                               'type' => '4650'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Type' => 'Func'
                                       },
                          '1531868' => {
                                         'BaseType' => '1531880',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2148',
                                         'Name' => 'gnutls_srp_client_credentials_function',
                                         'Type' => 'Typedef'
                                       },
                          '1531880' => {
                                         'Name' => 'int()(gnutls_session_t, char**, char**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3461'
                                                             },
                                                      '1' => {
                                                               'type' => '1030'
                                                             },
                                                      '2' => {
                                                               'type' => '1030'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Type' => 'Func'
                                       },
                          '15396' => {
                                       'BaseType' => '4053',
                                       'Name' => 'gnutls_range_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1541027' => {
                                         'BaseType' => '1531868',
                                         'Name' => 'gnutls_srp_client_credentials_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1541033' => {
                                         'BaseType' => '1531816',
                                         'Name' => 'gnutls_srp_server_credentials_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1542061' => {
                                         'BaseType' => '1531394',
                                         'Name' => 'gnutls_srp_server_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1542281' => {
                                         'BaseType' => '1531485',
                                         'Name' => 'gnutls_srp_client_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1550084' => {
                                         'BaseType' => '1550096',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2177',
                                         'Name' => 'gnutls_psk_server_credentials_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1550096' => {
                                         'BaseType' => '1550102',
                                         'Name' => 'struct gnutls_psk_server_credentials_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1550102' => {
                                         'Header' => 'psk.h',
                                         'Line' => '35',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'password_file',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'pwd_callback',
                                                              'offset' => '8',
                                                              'type' => '1559428'
                                                            },
                                                     '2' => {
                                                              'name' => 'dh_params',
                                                              'offset' => '16',
                                                              'type' => '133119'
                                                            },
                                                     '3' => {
                                                              'name' => 'deinit_dh_params',
                                                              'offset' => '24',
                                                              'type' => '145'
                                                            },
                                                     '4' => {
                                                              'name' => 'dh_sec_param',
                                                              'offset' => '28',
                                                              'type' => '3437'
                                                            },
                                                     '5' => {
                                                              'name' => 'params_func',
                                                              'offset' => '32',
                                                              'type' => '146238'
                                                            },
                                                     '6' => {
                                                              'name' => 'hint',
                                                              'offset' => '40',
                                                              'type' => '235'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_psk_server_credentials_st',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1550199' => {
                                         'BaseType' => '1550211',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2179',
                                         'Name' => 'gnutls_psk_client_credentials_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1550211' => {
                                         'BaseType' => '1550217',
                                         'Name' => 'struct gnutls_psk_client_credentials_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1550217' => {
                                         'Header' => 'psk.h',
                                         'Line' => '29',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'username',
                                                              'offset' => '0',
                                                              'type' => '4000'
                                                            },
                                                     '1' => {
                                                              'name' => 'key',
                                                              'offset' => '16',
                                                              'type' => '4000'
                                                            },
                                                     '2' => {
                                                              'name' => 'get_function',
                                                              'offset' => '32',
                                                              'type' => '1559422'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_psk_client_credentials_st',
                                         'PrivateABI' => 1,
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '1550266' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '2188',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PSK_KEY_RAW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PSK_KEY_HEX',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_psk_key_flags',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1550296' => {
                                         'BaseType' => '1550266',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2191',
                                         'Name' => 'gnutls_psk_key_flags',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1550308' => {
                                         'BaseType' => '1550320',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2218',
                                         'Name' => 'gnutls_psk_server_credentials_function',
                                         'Type' => 'Typedef'
                                       },
                          '1550320' => {
                                         'Name' => 'int()(gnutls_session_t, char const*, gnutls_datum_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3461'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '4650'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Type' => 'Func'
                                       },
                          '1550345' => {
                                         'BaseType' => '1550357',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2227',
                                         'Name' => 'gnutls_psk_client_credentials_function',
                                         'Type' => 'Typedef'
                                       },
                          '1550357' => {
                                         'Name' => 'int()(gnutls_session_t, char**, gnutls_datum_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3461'
                                                             },
                                                      '1' => {
                                                               'type' => '1030'
                                                             },
                                                      '2' => {
                                                               'type' => '4650'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Type' => 'Func'
                                       },
                          '1559422' => {
                                         'BaseType' => '1550345',
                                         'Name' => 'gnutls_psk_client_credentials_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1559428' => {
                                         'BaseType' => '1550308',
                                         'Name' => 'gnutls_psk_server_credentials_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1560316' => {
                                         'BaseType' => '1550084',
                                         'Name' => 'gnutls_psk_server_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1560591' => {
                                         'BaseType' => '1550199',
                                         'Name' => 'gnutls_psk_client_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '157' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1577508' => {
                                         'BaseType' => '805438',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2282',
                                         'Name' => 'gnutls_x509_subject_alt_name_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '164' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '16400' => {
                                       'BaseType' => '157',
                                       'Name' => 'unsigned char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '1655964' => {
                                         'BaseType' => '1655976',
                                         'Header' => 'x509.h',
                                         'Line' => '812',
                                         'Name' => 'gnutls_x509_crl_iter_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1655976' => {
                                         'BaseType' => '1655982',
                                         'Name' => 'struct gnutls_x509_crl_iter*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1655982' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'rcache',
                                                              'offset' => '0',
                                                              'type' => '8455'
                                                            },
                                                     '1' => {
                                                              'name' => 'rcache_idx',
                                                              'offset' => '8',
                                                              'type' => '145'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_crl_iter',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1665891' => {
                                         'BaseType' => '818803',
                                         'Name' => 'gnutls_x509_crl_t**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1668407' => {
                                         'BaseType' => '1655964',
                                         'Name' => 'gnutls_x509_crl_iter_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '171' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1713374' => {
                                         'BaseType' => '944586',
                                         'Name' => 'gnutls_x509_crq_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1719661' => {
                                         'BaseType' => '2116375',
                                         'Header' => 'x509.h',
                                         'Line' => '726',
                                         'Name' => 'gnutls_x509_dn_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '17333' => {
                                       'BaseType' => '75',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1780400' => {
                                         'BaseType' => '1780411',
                                         'Header' => 'x509-ext.h',
                                         'Line' => '107',
                                         'Name' => 'gnutls_x509_aki_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1780411' => {
                                         'BaseType' => '1780417',
                                         'Name' => 'struct gnutls_x509_aki_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1780417' => {
                                         'Line' => '688',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'id',
                                                              'offset' => '0',
                                                              'type' => '4000'
                                                            },
                                                     '1' => {
                                                              'name' => 'cert_issuer',
                                                              'offset' => '16',
                                                              'type' => '146052'
                                                            },
                                                     '2' => {
                                                              'name' => 'serial',
                                                              'offset' => '32',
                                                              'type' => '4000'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_aki_st',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1807674' => {
                                         'BaseType' => '134448',
                                         'Name' => 'gnutls_x509_crt_t const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1809422' => {
                                         'BaseType' => '1809434',
                                         'Header' => 'x509.h',
                                         'Line' => '318',
                                         'Name' => 'gnutls_x509_name_constraints_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1809434' => {
                                         'BaseType' => '1809440',
                                         'Name' => 'struct gnutls_name_constraints_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1809440' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '507',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'permitted',
                                                              'offset' => '0',
                                                              'type' => '2188425'
                                                            },
                                                     '1' => {
                                                              'name' => 'excluded',
                                                              'offset' => '8',
                                                              'type' => '2188425'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_name_constraints_st',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1809598' => {
                                         'Header' => 'x509.h',
                                         'Line' => '540',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_X509_QUALIFIER_UNKNOWN',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_X509_QUALIFIER_URI',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_X509_QUALIFIER_NOTICE',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_x509_qualifier_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1809634' => {
                                         'BaseType' => '1809598',
                                         'Header' => 'x509.h',
                                         'Line' => '543',
                                         'Name' => 'gnutls_x509_qualifier_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1809646' => {
                                         'Header' => 'x509.h',
                                         'Line' => '548',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '1809634'
                                                            },
                                                     '1' => {
                                                              'name' => 'data',
                                                              'offset' => '8',
                                                              'type' => '235'
                                                            },
                                                     '2' => {
                                                              'name' => 'size',
                                                              'offset' => '16',
                                                              'type' => '145'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-x509.h-548',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1809695' => {
                                         'Header' => 'x509.h',
                                         'Line' => '545',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'oid',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'qualifiers',
                                                              'offset' => '8',
                                                              'type' => '145'
                                                            },
                                                     '2' => {
                                                              'name' => 'qualifier',
                                                              'offset' => '16',
                                                              'type' => '1809748'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_policy_st',
                                         'Size' => '208',
                                         'Type' => 'Struct'
                                       },
                          '1809748' => {
                                         'BaseType' => '1809646',
                                         'Name' => 'anon-struct-x509.h-548[8]',
                                         'Size' => '192',
                                         'Type' => 'Array'
                                       },
                          '1819410' => {
                                         'BaseType' => '1819421',
                                         'Header' => 'x509-ext.h',
                                         'Line' => '60',
                                         'Name' => 'gnutls_x509_crl_dist_points_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1819421' => {
                                         'BaseType' => '1819427',
                                         'Name' => 'struct gnutls_x509_crl_dist_points_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1819427' => {
                                         'Line' => '2240',
                                         'Memb' => {
                                                     '0' => {
