$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.14',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '5.3.1',
          'Headers' => {
                         'abstract.h' => 1,
                         'crypto-backend.h' => 1,
                         'dane.h' => 1,
                         'gnutls.h' => 1,
                         'gnutls_auth.h' => 1,
                         'gnutls_cipher_int.h' => 1,
                         'gnutls_compress.h' => 1,
                         'gnutls_hash_int.h' => 1,
                         'gnutls_int.h' => 1,
                         'gnutls_str.h' => 1,
                         'openpgp.h' => 1,
                         'stddef.h' => 1,
                         'stdint.h' => 1,
                         'stdio.h' => 1,
                         'time.h' => 1,
                         'types.h' => 1,
                         'unbound.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libgnutls-dane.so.0.4.1',
          'LibraryVersion' => '3.4.0',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libgmp.so.10' => 1,
                        'libgnutls.so.30' => 1,
                        'libhogweed.so.4' => 1,
                        'libidn.so.11' => 1,
                        'libnettle.so.6' => 1,
                        'libp11-kit.so.0' => 1,

                               'dane_strerror' => 'dane_strerror@@DANE_0_0',
                               'dane_verification_status_print' => 'dane_verification_status_print@@DANE_0_0',
                               'dane_verify_crt' => 'dane_verify_crt@@DANE_0_0',
                               'dane_verify_crt_raw' => 'dane_verify_crt_raw@@DANE_0_0',
                               'dane_verify_session_crt' => 'dane_verify_session_crt@@DANE_0_0',
                               'ub_ctx_add_ta_file' => 'stderr@@GLIBC_2.2.5',
                               'ub_ctx_create' => 'stderr@@GLIBC_2.2.5',
                               'ub_ctx_debugout' => 'stderr@@GLIBC_2.2.5',
                               'ub_ctx_delete' => 'stderr@@GLIBC_2.2.5',
                               'ub_ctx_hosts' => 'stderr@@GLIBC_2.2.5',
                               'ub_ctx_resolvconf' => 'stderr@@GLIBC_2.2.5',
                               'ub_ctx_set_option' => 'stderr@@GLIBC_2.2.5',
                               'ub_resolve' => 'stderr@@GLIBC_2.2.5',
                               'ub_resolve_free' => 'stderr@@GLIBC_2.2.5'
                             },
          'Symbols' => {
                         'libgnutls-dane.so.0.4.1' => {
                                                        'dane_cert_type_name@@DANE_0_0' => 1,
                                                        'dane_cert_usage_name@@DANE_0_0' => 1,
                                                        'dane_match_type_name@@DANE_0_0' => 1,
                                                        'dane_query_data@@DANE_0_0' => 1,
                                                        'dane_query_deinit@@DANE_0_0' => 1,
                                                        'dane_query_entries@@DANE_0_0' => 1,
                                                        'dane_query_status@@DANE_0_0' => 1,
                                                        'dane_query_tlsa@@DANE_0_0' => 1,
                                                        'dane_query_to_raw_tlsa@@DANE_0_0' => 1,
                                                        'dane_raw_tlsa@@DANE_0_0' => 1,
                                                        'dane_state_deinit@@DANE_0_0' => 1,
                                                        'dane_state_init@@DANE_0_0' => 1,
                                                        'dane_state_set_dlv_file@@DANE_0_0' => 1,
                                                        'dane_strerror@@DANE_0_0' => 1,
                                                        'dane_verification_status_print@@DANE_0_0' => 1,
                                                        'dane_verify_crt@@DANE_0_0' => 1,
                                                        'dane_verify_crt_raw@@DANE_0_0' => 1,
                                                        'dane_verify_session_crt@@DANE_0_0' => 1
                                                      }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '105' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '11091' => {
                                       'BaseType' => '6913',
                                       'Name' => 'handshake_buffer_st[6]',
                                       'Size' => '432',
                                       'Type' => 'Array'
                                     },
                          '11107' => {
                                       'Header' => 'gnutls_auth.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '679'
                                                          },
                                                   '1' => {
                                                            'name' => 'gnutls_generate_server_certificate',
                                                            'offset' => '8',
                                                            'type' => '11406'
                                                          },
                                                   '10' => {
                                                             'name' => 'gnutls_process_client_kx',
                                                             'offset' => '80',
                                                             'type' => '11437'
                                                           },
                                                   '11' => {
                                                             'name' => 'gnutls_process_client_crt_vrfy',
                                                             'offset' => '88',
                                                             'type' => '11437'
                                                           },
                                                   '12' => {
                                                             'name' => 'gnutls_process_server_crt_request',
                                                             'offset' => '96',
                                                             'type' => '11437'
                                                           },
                                                   '2' => {
                                                            'name' => 'gnutls_generate_client_certificate',
                                                            'offset' => '16',
                                                            'type' => '11406'
                                                          },
                                                   '3' => {
                                                            'name' => 'gnutls_generate_server_kx',
                                                            'offset' => '24',
                                                            'type' => '11406'
                                                          },
                                                   '4' => {
                                                            'name' => 'gnutls_generate_client_kx',
                                                            'offset' => '32',
                                                            'type' => '11406'
                                                          },
                                                   '5' => {
                                                            'name' => 'gnutls_generate_client_crt_vrfy',
                                                            'offset' => '40',
                                                            'type' => '11406'
                                                          },
                                                   '6' => {
                                                            'name' => 'gnutls_generate_server_crt_request',
                                                            'offset' => '48',
                                                            'type' => '11406'
                                                          },
                                                   '7' => {
                                                            'name' => 'gnutls_process_server_certificate',
                                                            'offset' => '56',
                                                            'type' => '11437'
                                                          },
                                                   '8' => {
                                                            'name' => 'gnutls_process_client_certificate',
                                                            'offset' => '64',
                                                            'type' => '11437'
                                                          },
                                                   '9' => {
                                                            'name' => 'gnutls_process_server_kx',
                                                            'offset' => '72',
                                                            'type' => '11437'
                                                          }
                                                 },
                                       'Name' => 'struct mod_auth_st_int',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '11276' => {
                                       'BaseType' => '11107',
                                       'Name' => 'struct mod_auth_st_int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11282' => {
                                       'BaseType' => '816',
                                       'Name' => 'uint16_t[32]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '11298' => {
                                       'BaseType' => '9710',
                                       'Name' => 'anon-struct-gnutls_int.h-948[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '11314' => {
                                       'BaseType' => '9759',
                                       'Name' => 'anon-struct-gnutls_int.h-954[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '11330' => {
                                       'BaseType' => '63',
                                       'Name' => 'unsigned char[36]',
                                       'Size' => '36',
                                       'Type' => 'Array'
                                     },
                          '11346' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '1002',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_buffer',
                                                            'offset' => '0',
                                                            'type' => '7009'
                                                          },
                                                   '1' => {
                                                            'name' => 'handshake_hash_buffer_prev_len',
                                                            'offset' => '32',
                                                            'type' => '98'
                                                          },
                                                   '10' => {
                                                             'name' => 'may_not_write',
                                                             'offset' => '86',
                                                             'type' => '8202'
                                                           },
                                                   '11' => {
                                                             'name' => 'read_eof',
                                                             'offset' => '87',
                                                             'type' => '8202'
                                                           },
                                                   '12' => {
                                                             'name' => 'last_alert',
                                                             'offset' => '88',
                                                             'type' => '98'
                                                           },
                                                   '13' => {
                                                             'name' => 'last_handshake_in',
                                                             'offset' => '92',
                                                             'type' => '98'
                                                           },
                                                   '14' => {
                                                             'name' => 'last_handshake_out',
                                                             'offset' => '96',
                                                             'type' => '98'
                                                           },
                                                   '15' => {
                                                             'name' => 'priorities',
                                                             'offset' => '100',
                                                             'type' => '3271'
                                                           },
                                                   '16' => {
                                                             'name' => 'resumed',
                                                             'offset' => '1188',
                                                             'type' => '8202'
                                                           },
                                                   '17' => {
                                                             'name' => 'resumption_requested',
                                                             'offset' => '1189',
                                                             'type' => '8202'
                                                           },
                                                   '18' => {
                                                             'name' => 'resumed_security_parameters',
                                                             'offset' => '1192',
                                                             'type' => '9290'
                                                           },
                                                   '19' => {
                                                             'name' => 'handshake_send_buffer',
                                                             'offset' => '1416',
                                                             'type' => '7009'
                                                           },
                                                   '2' => {
                                                            'name' => 'handshake_hash_buffer_client_kx_len',
                                                            'offset' => '36',
                                                            'type' => '77'
                                                          },
                                                   '20' => {
                                                             'name' => 'handshake_recv_buffer',
                                                             'offset' => '1448',
                                                             'type' => '11091'
                                                           },
                                                   '21' => {
                                                             'name' => 'handshake_recv_buffer_size',
                                                             'offset' => '1880',
                                                             'type' => '98'
                                                           },
                                                   '22' => {
                                                             'name' => 'record_recv_buffer',
                                                             'offset' => '1888',
                                                             'type' => '7009'
                                                           },
                                                   '23' => {
                                                             'name' => 'record_send_buffer',
                                                             'offset' => '1920',
                                                             'type' => '7009'
                                                           },
                                                   '24' => {
                                                             'name' => 'record_send_buffer_user_size',
                                                             'offset' => '1952',
                                                             'type' => '45'
                                                           },
                                                   '25' => {
                                                             'name' => 'record_flush_mode',
                                                             'offset' => '1960',
                                                             'type' => '5482'
                                                           },
                                                   '26' => {
                                                             'name' => 'record_presend_buffer',
                                                             'offset' => '1968',
                                                             'type' => '6668'
                                                           },
                                                   '27' => {
                                                             'name' => 'expire_time',
                                                             'offset' => '2000',
                                                             'type' => '77'
                                                           },
                                                   '28' => {
                                                             'name' => 'auth_struct',
                                                             'offset' => '2008',
                                                             'type' => '11276'
                                                           },
                                                   '29' => {
                                                             'name' => 'adv_version_major',
                                                             'offset' => '2016',
                                                             'type' => '805'
                                                           },
                                                   '3' => {
                                                            'name' => 'handshake_hash_buffer',
                                                            'offset' => '40',
                                                            'type' => '6668'
                                                          },
                                                   '30' => {
                                                             'name' => 'adv_version_minor',
                                                             'offset' => '2017',
                                                             'type' => '805'
                                                           },
                                                   '31' => {
                                                             'name' => 'send_cert_req',
                                                             'offset' => '2020',
                                                             'type' => '77'
                                                           },
                                                   '32' => {
                                                             'name' => 'max_handshake_data_buffer_size',
                                                             'offset' => '2024',
                                                             'type' => '45'
                                                           },
                                                   '33' => {
                                                             'name' => 'pull_timeout_func',
                                                             'offset' => '2032',
                                                             'type' => '4324'
                                                           },
                                                   '34' => {
                                                             'name' => 'pull_func',
                                                             'offset' => '2040',
                                                             'type' => '4238'
                                                           },
                                                   '35' => {
                                                             'name' => 'push_func',
                                                             'offset' => '2048',
                                                             'type' => '4281'
                                                           },
                                                   '36' => {
                                                             'name' => 'vec_push_func',
                                                             'offset' => '2056',
                                                             'type' => '4362'
                                                           },
                                                   '37' => {
                                                             'name' => 'errno_func',
                                                             'offset' => '2064',
                                                             'type' => '4416'
                                                           },
                                                   '38' => {
                                                             'name' => 'transport_recv_ptr',
                                                             'offset' => '2072',
                                                             'type' => '3114'
                                                           },
                                                   '39' => {
                                                             'name' => 'transport_send_ptr',
                                                             'offset' => '2080',
                                                             'type' => '3114'
                                                           },
                                                   '4' => {
                                                            'name' => 'resumable',
                                                            'offset' => '72',
                                                            'type' => '8202'
                                                          },
                                                   '40' => {
                                                             'name' => 'db_store_func',
                                                             'offset' => '2088',
                                                             'type' => '3821'
                                                           },
                                                   '41' => {
                                                             'name' => 'db_retrieve_func',
                                                             'offset' => '2096',
                                                             'type' => '3902'
                                                           },
                                                   '42' => {
                                                             'name' => 'db_remove_func',
                                                             'offset' => '2104',
                                                             'type' => '3864'
                                                           },
                                                   '43' => {
                                                             'name' => 'db_ptr',
                                                             'offset' => '2112',
                                                             'type' => '152'
                                                           },
                                                   '44' => {
                                                             'name' => 'user_hello_func',
                                                             'offset' => '2120',
                                                             'type' => '4004'
                                                           },
                                                   '45' => {
                                                             'name' => 'h_hook',
                                                             'offset' => '2128',
                                                             'type' => '3940'
                                                           },
                                                   '46' => {
                                                             'name' => 'h_type',
                                                             'offset' => '2136',
                                                             'type' => '77'
                                                           },
                                                   '47' => {
                                                             'name' => 'h_post',
                                                             'offset' => '2140',
                                                             'type' => '726'
                                                           },
                                                   '48' => {
                                                             'name' => 'selected_cert_list',
                                                             'offset' => '2144',
                                                             'type' => '5127'
                                                           },
                                                   '49' => {
                                                             'name' => 'selected_cert_list_length',
                                                             'offset' => '2152',
                                                             'type' => '726'
                                                           },
                                                   '5' => {
                                                            'name' => 'ticket_sent',
                                                            'offset' => '73',
                                                            'type' => '8202'
                                                          },
                                                   '50' => {
                                                             'name' => 'selected_key',
                                                             'offset' => '2160',
                                                             'type' => '4060'
                                                           },
                                                   '51' => {
                                                             'name' => 'selected_need_free',
                                                             'offset' => '2168',
                                                             'type' => '8202'
                                                           },
                                                   '52' => {
                                                             'name' => 'extensions_sent',
                                                             'offset' => '2170',
                                                             'type' => '11282'
                                                           },
                                                   '53' => {
                                                             'name' => 'extensions_sent_size',
                                                             'offset' => '2234',
                                                             'type' => '816'
                                                           },
                                                   '54' => {
                                                             'name' => 'pgp_fingerprint',
                                                             'offset' => '2236',
                                                             'type' => '8202'
                                                           },
                                                   '55' => {
                                                             'name' => 'default_record_version',
                                                             'offset' => '2237',
                                                             'type' => '7879'
                                                           },
                                                   '56' => {
                                                             'name' => 'default_hello_version',
                                                             'offset' => '2239',
                                                             'type' => '7879'
                                                           },
                                                   '57' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '2248',
                                                             'type' => '152'
                                                           },
                                                   '58' => {
                                                             'name' => 'enable_private',
                                                             'offset' => '2256',
                                                             'type' => '8202'
                                                           },
                                                   '59' => {
                                                             'name' => 'direction',
                                                             'offset' => '2257',
                                                             'type' => '8202'
                                                           },
                                                   '6' => {
                                                            'name' => 'handshake_final_state',
                                                            'offset' => '76',
                                                            'type' => '6565'
                                                          },
                                                   '60' => {
                                                             'name' => 'openpgp_recv_key_func',
                                                             'offset' => '2264',
                                                             'type' => '5014'
                                                           },
                                                   '61' => {
                                                             'name' => 'ignore_rdn_sequence',
                                                             'offset' => '2272',
                                                             'type' => '8202'
                                                           },
                                                   '62' => {
                                                             'name' => 'rsa_pms_version',
                                                             'offset' => '2273',
                                                             'type' => '7879'
                                                           },
                                                   '63' => {
                                                             'name' => 'params',
                                                             'offset' => '2280',
                                                             'type' => '9468'
                                                           },
                                                   '64' => {
                                                             'name' => 'errnum',
                                                             'offset' => '2296',
                                                             'type' => '98'
                                                           },
                                                   '65' => {
                                                             'name' => 'srp_prime_bits',
                                                             'offset' => '2300',
                                                             'type' => '816'
                                                           },
                                                   '66' => {
                                                             'name' => 'initial_negotiation_completed',
                                                             'offset' => '2302',
                                                             'type' => '8202'
                                                           },
                                                   '67' => {
                                                             'name' => 'extension_int_data',
                                                             'offset' => '2304',
                                                             'type' => '11298'
                                                           },
                                                   '68' => {
                                                             'name' => 'resumed_extension_int_data',
                                                             'offset' => '3072',
                                                             'type' => '11314'
                                                           },
                                                   '69' => {
                                                             'name' => 'transport',
                                                             'offset' => '3840',
                                                             'type' => '5442'
                                                           },
                                                   '7' => {
                                                            'name' => 'handshake_state',
                                                            'offset' => '80',
                                                            'type' => '6565'
                                                          },
                                                   '70' => {
                                                             'name' => 'dtls',
                                                             'offset' => '3848',
                                                             'type' => '9698'
                                                           },
                                                   '71' => {
                                                             'name' => 'handshake_large_loops',
                                                             'offset' => '3968',
                                                             'type' => '77'
                                                           },
                                                   '72' => {
                                                             'name' => 'handshake_in_progress',
                                                             'offset' => '3972',
                                                             'type' => '8202'
                                                           },
                                                   '73' => {
                                                             'name' => 'premaster_set',
                                                             'offset' => '3973',
                                                             'type' => '8202'
                                                           },
                                                   '74' => {
                                                             'name' => 'cb_tls_unique_len',
                                                             'offset' => '3976',
                                                             'type' => '77'
                                                           },
                                                   '75' => {
                                                             'name' => 'cb_tls_unique',
                                                             'offset' => '3980',
                                                             'type' => '11330'
                                                           },
                                                   '76' => {
                                                             'name' => 'handshake_endtime',
                                                             'offset' => '4016',
                                                             'type' => '715'
                                                           },
                                                   '77' => {
                                                             'name' => 'handshake_timeout_ms',
                                                             'offset' => '4024',
                                                             'type' => '77'
                                                           },
                                                   '78' => {
                                                             'name' => 'record_timeout_ms',
                                                             'offset' => '4028',
                                                             'type' => '77'
                                                           },
                                                   '79' => {
                                                             'name' => 'hb_local_data',
                                                             'offset' => '4032',
                                                             'type' => '6668'
                                                           },
                                                   '8' => {
                                                            'name' => 'invalid_connection',
                                                            'offset' => '84',
                                                            'type' => '8202'
                                                          },
                                                   '80' => {
                                                             'name' => 'hb_remote_data',
                                                             'offset' => '4064',
                                                             'type' => '6668'
                                                           },
                                                   '81' => {
                                                             'name' => 'hb_ping_start',
                                                             'offset' => '4096',
                                                             'type' => '737'
                                                           },
                                                   '82' => {
                                                             'name' => 'hb_ping_sent',
                                                             'offset' => '4112',
                                                             'type' => '737'
                                                           },
                                                   '83' => {
                                                             'name' => 'hb_actual_retrans_timeout_ms',
                                                             'offset' => '4128',
                                                             'type' => '77'
                                                           },
                                                   '84' => {
                                                             'name' => 'hb_retrans_timeout_ms',
                                                             'offset' => '4132',
                                                             'type' => '77'
                                                           },
                                                   '85' => {
                                                             'name' => 'hb_total_timeout_ms',
                                                             'offset' => '4136',
                                                             'type' => '77'
                                                           },
                                                   '86' => {
                                                             'name' => 'ocsp_check_ok',
                                                             'offset' => '4140',
                                                             'type' => '8202'
                                                           },
                                                   '87' => {
                                                             'name' => 'hb_state',
                                                             'offset' => '4144',
                                                             'type' => '6611'
                                                           },
                                                   '88' => {
                                                             'name' => 'recv_state',
                                                             'offset' => '4148',
                                                             'type' => '6651'
                                                           },
                                                   '89' => {
                                                             'name' => 'sc_random_set',
                                                             'offset' => '4152',
                                                             'type' => '8202'
                                                           },
                                                   '9' => {
                                                            'name' => 'may_not_read',
                                                            'offset' => '85',
                                                            'type' => '8202'
                                                          },
                                                   '90' => {
                                                             'name' => 'no_replay_protection',
                                                             'offset' => '4153',
                                                             'type' => '8202'
                                                           },
                                                   '91' => {
                                                             'name' => 'try_ext_master_secret',
                                                             'offset' => '4154',
                                                             'type' => '8202'
                                                           }
                                                 },
                                       'Name' => 'struct internals_st',
                                       'Size' => '4160',
                                       'Type' => 'Struct'
                                     },
                          '11358' => {
                                       'BaseType' => '11374',
                                       'Name' => 'record_parameters_st*[16]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '11374' => {
                                       'BaseType' => '7535',
                                       'Name' => 'record_parameters_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11400' => {
                                       'BaseType' => '6668',
                                       'Name' => 'gnutls_buffer_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11406' => {
                                       'Name' => 'int(*)(gnutls_session_t, gnutls_buffer_st*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3126'
                                                           },
                                                    '1' => {
                                                             'type' => '11400'
                                                           }
                                                  },
                                       'Return' => '98',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11437' => {
                                       'Name' => 'int(*)(gnutls_session_t, uint8_t*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3126'
                                                           },
                                                    '1' => {
                                                             'type' => '6662'
                                                           },
                                                    '2' => {
                                                             'type' => '45'
                                                           }
                                                  },
                                       'Return' => '98',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11443' => {
                                       'Name' => 'struct ub_ctx',
                                       'Type' => 'Struct'
                                     },
                          '11448' => {
                                       'BaseType' => '11443',
                                       'Name' => 'struct ub_ctx*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11454' => {
                                       'BaseType' => '4574',
                                       'Name' => 'dane_cert_usage_t[100]',
                                       'Size' => '400',
                                       'Type' => 'Array'
                                     },
                          '11470' => {
                                       'BaseType' => '4614',
                                       'Name' => 'dane_cert_type_t[100]',
                                       'Size' => '400',
                                       'Type' => 'Array'
                                     },
                          '11486' => {
                                       'BaseType' => '4660',
                                       'Name' => 'dane_match_type_t[100]',
                                       'Size' => '400',
                                       'Type' => 'Array'
                                     },
                          '11502' => {
                                       'BaseType' => '3646',
                                       'Name' => 'gnutls_datum_t[100]',
                                       'Size' => '1600',
                                       'Type' => 'Array'
                                     },
                          '12793' => {
                                       'BaseType' => '1822',
                                       'Name' => 'char***',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12799' => {
                                       'BaseType' => '781',
                                       'Name' => 'int**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13098' => {
                                       'BaseType' => '4723',
                                       'Name' => 'dane_state_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13560' => {
                                       'BaseType' => '4777',
                                       'Name' => 'dane_query_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13566' => {
                                       'BaseType' => '13572',
                                       'Name' => 'char*const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13572' => {
                                       'BaseType' => '176',
                                       'Name' => 'char*const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '141' => {
                                     'BaseType' => '105',
                                     'Header' => 'types.h',
                                     'Line' => '139',
                                     'Name' => '__time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '152' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '154' => {
                                     'BaseType' => '105',
                                     'Header' => 'types.h',
                                     'Line' => '172',
                                     'Name' => '__ssize_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1613' => {
                                      'BaseType' => '63',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '1629' => {
                                      'Header' => 'unbound.h',
                                      'Line' => '123',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'qname',
                                                           'offset' => '0',
                                                           'type' => '176'
                                                         },
                                                  '1' => {
                                                           'name' => 'qtype',
                                                           'offset' => '8',
                                                           'type' => '98'
                                                         },
                                                  '10' => {
                                                            'name' => 'nxdomain',
                                                            'offset' => '64',
                                                            'type' => '98'
                                                          },
                                                  '11' => {
                                                            'name' => 'secure',
                                                            'offset' => '68',
                                                            'type' => '98'
                                                          },
                                                  '12' => {
                                                            'name' => 'bogus',
                                                            'offset' => '72',
                                                            'type' => '98'
                                                          },
                                                  '13' => {
                                                            'name' => 'why_bogus',
                                                            'offset' => '80',
                                                            'type' => '176'
                                                          },
                                                  '14' => {
                                                            'name' => 'ttl',
                                                            'offset' => '88',
                                                            'type' => '98'
                                                          },
                                                  '2' => {
                                                           'name' => 'qclass',
                                                           'offset' => '12',
                                                           'type' => '98'
                                                         },
                                                  '3' => {
                                                           'name' => 'data',
                                                           'offset' => '16',
                                                           'type' => '1822'
                                                         },
                                                  '4' => {
                                                           'name' => 'len',
                                                           'offset' => '24',
                                                           'type' => '781'
                                                         },
                                                  '5' => {
                                                           'name' => 'canonname',
                                                           'offset' => '32',
                                                           'type' => '176'
                                                         },
                                                  '6' => {
                                                           'name' => 'rcode',
                                                           'offset' => '40',
                                                           'type' => '98'
                                                         },
                                                  '7' => {
                                                           'name' => 'answer_packet',
                                                           'offset' => '48',
                                                           'type' => '152'
                                                         },
                                                  '8' => {
                                                           'name' => 'answer_len',
                                                           'offset' => '56',
                                                           'type' => '98'
                                                         },
                                                  '9' => {
                                                           'name' => 'havedata',
                                                           'offset' => '60',
                                                           'type' => '98'
                                                         }
                                                },
                                      'Name' => 'struct ub_result',
                                      'Size' => '96',
                                      'Type' => 'Struct'
                                    },
                          '165' => {
                                     'BaseType' => '105',
                                     'Header' => 'types.h',
                                     'Line' => '175',
                                     'Name' => '__syscall_slong_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '176' => {
                                     'BaseType' => '182',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '182' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1822' => {
                                      'BaseType' => '176',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1828' => {
                                      'BaseType' => '1629',
                                      'Name' => 'struct ub_result*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1834' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '114',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_CIPHER_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_CIPHER_NULL',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_128_GCM',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_256_GCM',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_CIPHER_CAMELLIA_192_CBC',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'GNUTLS_CIPHER_SALSA20_256',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'GNUTLS_CIPHER_ESTREAM_SALSA20_256',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'GNUTLS_CIPHER_CAMELLIA_128_GCM',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'GNUTLS_CIPHER_CAMELLIA_256_GCM',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'GNUTLS_CIPHER_RC2_40_CBC',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'GNUTLS_CIPHER_DES_CBC',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_128_CCM',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_CIPHER_ARCFOUR_128',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_256_CCM',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_128_CCM_8',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_256_CCM_8',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'GNUTLS_CIPHER_CHACHA20_POLY1305',
                                                            'value' => '23'
                                                          },
                                                  '24' => {
                                                            'name' => 'GNUTLS_CIPHER_IDEA_PGP_CFB',
                                                            'value' => '200'
                                                          },
                                                  '25' => {
                                                            'name' => 'GNUTLS_CIPHER_3DES_PGP_CFB',
                                                            'value' => '201'
                                                          },
                                                  '26' => {
                                                            'name' => 'GNUTLS_CIPHER_CAST5_PGP_CFB',
                                                            'value' => '202'
                                                          },
                                                  '27' => {
                                                            'name' => 'GNUTLS_CIPHER_BLOWFISH_PGP_CFB',
                                                            'value' => '203'
                                                          },
                                                  '28' => {
                                                            'name' => 'GNUTLS_CIPHER_SAFER_SK128_PGP_CFB',
                                                            'value' => '204'
                                                          },
                                                  '29' => {
                                                            'name' => 'GNUTLS_CIPHER_AES128_PGP_CFB',
                                                            'value' => '205'
                                                          },
                                                  '3' => {
                                                           'name' => 'GNUTLS_CIPHER_3DES_CBC',
                                                           'value' => '3'
                                                         },
                                                  '30' => {
                                                            'name' => 'GNUTLS_CIPHER_AES192_PGP_CFB',
                                                            'value' => '206'
                                                          },
                                                  '31' => {
                                                            'name' => 'GNUTLS_CIPHER_AES256_PGP_CFB',
                                                            'value' => '207'
                                                          },
                                                  '32' => {
                                                            'name' => 'GNUTLS_CIPHER_TWOFISH_PGP_CFB',
                                                            'value' => '208'
                                                          },
                                                  '4' => {
                                                           'name' => 'GNUTLS_CIPHER_AES_128_CBC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_CIPHER_AES_256_CBC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_CIPHER_ARCFOUR_40',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_CIPHER_CAMELLIA_128_CBC',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_CIPHER_CAMELLIA_256_CBC',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_CIPHER_AES_192_CBC',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_cipher_algorithm',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2049' => {
                                      'BaseType' => '1834',
                                      'Header' => 'gnutls.h',
                                      'Line' => '151',
                                      'Name' => 'gnutls_cipher_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2169' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '191',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_KX_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_KX_RSA',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_KX_DHE_PSK',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_KX_ANON_ECDH',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_KX_ECDHE_RSA',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'GNUTLS_KX_ECDHE_ECDSA',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'GNUTLS_KX_ECDHE_PSK',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'GNUTLS_KX_RSA_PSK',
                                                            'value' => '15'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_KX_DHE_DSS',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_KX_DHE_RSA',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_KX_ANON_DH',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_KX_SRP',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_KX_RSA_EXPORT',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_KX_SRP_RSA',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_KX_SRP_DSS',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_KX_PSK',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_kx_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2223' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '223',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_CRD_CERTIFICATE',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_CRD_ANON',
                                                           'value' => '2'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_CRD_SRP',
                                                           'value' => '3'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_CRD_PSK',
                                                           'value' => '4'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_CRD_IA',
                                                           'value' => '5'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_credentials_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2325' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '263',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_MAC_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_MAC_NULL',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_MAC_AEAD',
                                                            'value' => '200'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_MAC_UMAC_96',
                                                            'value' => '201'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_MAC_UMAC_128',
                                                            'value' => '202'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_MAC_MD5',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_MAC_SHA1',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_MAC_RMD160',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_MAC_MD2',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_MAC_SHA256',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_MAC_SHA384',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_MAC_SHA512',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_MAC_SHA224',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_mac_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2449' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '316',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_COMP_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_COMP_NULL',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_COMP_DEFLATE',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_COMP_ZLIB',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_compression_method_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2572' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '457',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_HELLO_REQUEST',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_CLIENT_HELLO',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_HANDSHAKE_CLIENT_KEY_EXCHANGE',
                                                            'value' => '16'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_HANDSHAKE_FINISHED',
                                                            'value' => '20'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_HANDSHAKE_CERTIFICATE_STATUS',
                                                            'value' => '22'
                                                          },
                                                  '13' => {
                                                            'name' => 'GNUTLS_HANDSHAKE_SUPPLEMENTAL',
                                                            'value' => '23'
                                                          },
                                                  '14' => {
                                                            'name' => 'GNUTLS_HANDSHAKE_CHANGE_CIPHER_SPEC',
                                                            'value' => '254'
                                                          },
                                                  '15' => {
                                                            'name' => 'GNUTLS_HANDSHAKE_CLIENT_HELLO_V2',
                                                            'value' => '1024'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_SERVER_HELLO',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_HELLO_VERIFY_REQUEST',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_NEW_SESSION_TICKET',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_CERTIFICATE_PKT',
                                                           'value' => '11'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_SERVER_KEY_EXCHANGE',
                                                           'value' => '12'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_CERTIFICATE_REQUEST',
                                                           'value' => '13'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_SERVER_HELLO_DONE',
                                                           'value' => '14'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_HANDSHAKE_CERTIFICATE_VERIFY',
                                                           'value' => '15'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_handshake_description_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2670' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '579',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_SSL3',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_TLS1_0',
                                                           'value' => '2'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_TLS_VERSION_MAX',
                                                            'value' => '4'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_VERSION_UNKNOWN',
                                                            'value' => '255'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_TLS1',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_TLS1_1',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_TLS1_2',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_DTLS0_9',
                                                           'value' => '200'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_DTLS1_0',
                                                           'value' => '201'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_DTLS1_2',
                                                           'value' => '202'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_DTLS_VERSION_MIN',
                                                           'value' => '200'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_DTLS_VERSION_MAX',
                                                           'value' => '202'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_protocol_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2720' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '595',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_CRT_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_CRT_X509',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_CRT_OPENPGP',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_CRT_RAW',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_certificate_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2802' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '644',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_PK_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_PK_RSA',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_PK_DSA',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_PK_DH',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_PK_EC',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_pk_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2954' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '696',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_SIGN_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_SIGN_RSA_SHA1',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_SIGN_RSA_SHA512',
                                                            'value' => '8'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_SIGN_RSA_SHA224',
                                                            'value' => '9'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_SIGN_DSA_SHA224',
                                                            'value' => '10'
                                                          },
                                                  '13' => {
                                                            'name' => 'GNUTLS_SIGN_DSA_SHA256',
                                                            'value' => '11'
                                                          },
                                                  '14' => {
                                                            'name' => 'GNUTLS_SIGN_ECDSA_SHA1',
                                                            'value' => '12'
                                                          },
                                                  '15' => {
                                                            'name' => 'GNUTLS_SIGN_ECDSA_SHA224',
                                                            'value' => '13'
                                                          },
                                                  '16' => {
                                                            'name' => 'GNUTLS_SIGN_ECDSA_SHA256',
                                                            'value' => '14'
                                                          },
                                                  '17' => {
                                                            'name' => 'GNUTLS_SIGN_ECDSA_SHA384',
                                                            'value' => '15'
                                                          },
                                                  '18' => {
                                                            'name' => 'GNUTLS_SIGN_ECDSA_SHA512',
                                                            'value' => '16'
                                                          },
                                                  '19' => {
                                                            'name' => 'GNUTLS_SIGN_DSA_SHA384',
                                                            'value' => '17'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_SIGN_RSA_SHA',
                                                           'value' => '1'
                                                         },
                                                  '20' => {
                                                            'name' => 'GNUTLS_SIGN_DSA_SHA512',
                                                            'value' => '18'
                                                          },
                                                  '3' => {
                                                           'name' => 'GNUTLS_SIGN_DSA_SHA1',
                                                           'value' => '2'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_SIGN_DSA_SHA',
                                                           'value' => '2'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_SIGN_RSA_MD5',
                                                           'value' => '3'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_SIGN_RSA_MD2',
                                                           'value' => '4'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_SIGN_RSA_RMD160',
                                                           'value' => '5'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_SIGN_RSA_SHA256',
                                                           'value' => '6'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_SIGN_RSA_SHA384',
                                                           'value' => '7'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_sign_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3016' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '716',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_ECC_CURVE_INVALID',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_ECC_CURVE_SECP224R1',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_ECC_CURVE_SECP256R1',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_ECC_CURVE_SECP384R1',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_ECC_CURVE_SECP521R1',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_ECC_CURVE_SECP192R1',
                                                           'value' => '5'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_ecc_curve_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3102' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '750',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_INSECURE',
                                                           'value' => '5'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_EXPORT',
                                                           'value' => '10'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_VERY_WEAK',
                                                           'value' => '15'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_WEAK',
                                                           'value' => '20'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_LOW',
                                                           'value' => '25'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_LEGACY',
                                                           'value' => '30'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_MEDIUM',
                                                           'value' => '35'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_HIGH',
                                                           'value' => '40'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_SEC_PARAM_ULTRA',
                                                           'value' => '45'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_sec_param_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3114' => {
                                      'BaseType' => '152',
                                      'Header' => 'gnutls.h',
                                      'Line' => '769',
                                      'Name' => 'gnutls_transport_ptr_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3126' => {
                                      'BaseType' => '3138',
                                      'Header' => 'gnutls.h',
                                      'Line' => '772',
                                      'Name' => 'gnutls_session_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3138' => {
                                      'BaseType' => '3144',
                                      'Name' => 'struct gnutls_session_int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3144' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '1007',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'security_parameters',
                                                           'offset' => '0',
                                                           'type' => '9290'
                                                         },
                                                  '1' => {
                                                           'name' => 'record_parameters',
                                                           'offset' => '224',
                                                           'type' => '11358'
                                                         },
                                                  '2' => {
                                                           'name' => 'internals',
                                                           'offset' => '352',
                                                           'type' => '11346'
                                                         },
                                                  '3' => {
                                                           'name' => 'key',
                                                           'offset' => '4512',
                                                           'type' => '7420'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_session_int',
                                      'Size' => '4968',
                                      'Type' => 'Struct'
                                    },
                          '3213' => {
                                      'BaseType' => '3225',
                                      'Header' => 'gnutls.h',
                                      'Line' => '775',
                                      'Name' => 'gnutls_dh_params_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3225' => {
                                      'BaseType' => '3231',
                                      'Name' => 'struct gnutls_dh_params_int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3231' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '696',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'params',
                                                           'offset' => '0',
                                                           'type' => '7398'
                                                         },
                                                  '1' => {
                                                           'name' => 'q_bits',
                                                           'offset' => '16',
                                                           'type' => '98'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_dh_params_int',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '3271' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '648',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cipher',
                                                           'offset' => '0',
                                                           'type' => '9370'
                                                         },
                                                  '1' => {
                                                           'name' => 'mac',
                                                           'offset' => '132',
                                                           'type' => '9370'
                                                         },
                                                  '10' => {
                                                            'name' => 'allow_large_records',
                                                            'offset' => '1058',
                                                            'type' => '8202'
                                                          },
                                                  '11' => {
                                                            'name' => 'dumbfw',
                                                            'offset' => '1060',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'sr',
                                                            'offset' => '1064',
                                                            'type' => '9420'
                                                          },
                                                  '13' => {
                                                            'name' => 'min_record_version',
                                                            'offset' => '1068',
                                                            'type' => '8202'
                                                          },
                                                  '14' => {
                                                            'name' => 'server_precedence',
                                                            'offset' => '1069',
                                                            'type' => '8202'
                                                          },
                                                  '15' => {
                                                            'name' => 'allow_wrong_pms',
                                                            'offset' => '1070',
                                                            'type' => '8202'
                                                          },
                                                  '16' => {
                                                            'name' => 'no_tickets',
                                                            'offset' => '1071',
                                                            'type' => '8202'
                                                          },
                                                  '17' => {
                                                            'name' => 'no_etm',
                                                            'offset' => '1072',
                                                            'type' => '8202'
                                                          },
                                                  '18' => {
                                                            'name' => 'have_cbc',
                                                            'offset' => '1073',
                                                            'type' => '8202'
                                                          },
                                                  '19' => {
                                                            'name' => 'stateless_compression',
                                                            'offset' => '1074',
                                                            'type' => '8202'
                                                          },
                                                  '2' => {
                                                           'name' => 'kx',
                                                           'offset' => '264',
                                                           'type' => '9370'
                                                         },
                                                  '20' => {
                                                            'name' => 'additional_verify_flags',
                                                            'offset' => '1076',
                                                            'type' => '77'
                                                          },
                                                  '21' => {
                                                            'name' => 'level',
                                                            'offset' => '1080',
                                                            'type' => '3102'
                                                          },
                                                  '22' => {
                                                            'name' => 'dh_prime_bits',
                                                            'offset' => '1084',
                                                            'type' => '77'
                                                          },
                                                  '3' => {
                                                           'name' => 'compression',
                                                           'offset' => '396',
                                                           'type' => '9370'
                                                         },
                                                  '4' => {
                                                           'name' => 'protocol',
                                                           'offset' => '528',
                                                           'type' => '9370'
                                                         },
                                                  '5' => {
                                                           'name' => 'cert_type',
                                                           'offset' => '660',
                                                           'type' => '9370'
                                                         },
                                                  '6' => {
                                                           'name' => 'sign_algo',
                                                           'offset' => '792',
                                                           'type' => '9370'
                                                         },
                                                  '7' => {
                                                           'name' => 'supported_ecc',
                                                           'offset' => '924',
                                                           'type' => '9370'
                                                         },
                                                  '8' => {
                                                           'name' => 'no_extensions',
                                                           'offset' => '1056',
                                                           'type' => '8202'
                                                         },
                                                  '9' => {
                                                           'name' => 'no_ext_master_secret',
                                                           'offset' => '1057',
                                                           'type' => '8202'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_priority_st',
                                      'Size' => '1088',
                                      'Type' => 'Struct'
                                    },
                          '3640' => {
                                      'BaseType' => '63',
                                      'Name' => 'unsigned char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3646' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '787',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '3640'
                                                         },
                                                  '1' => {
                                                           'name' => 'size',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_datum_t',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3664' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '310',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '7003'
                                                         },
                                                  '1' => {
                                                           'name' => 'prev',
                                                           'offset' => '8',
                                                           'type' => '7003'
                                                         },
                                                  '10' => {
                                                            'name' => 'handshake_sequence',
                                                            'offset' => '72',
                                                            'type' => '816'
                                                          },
                                                  '2' => {
                                                           'name' => 'mark',
                                                           'offset' => '16',
                                                           'type' => '45'
                                                         },
                                                  '3' => {
                                                           'name' => 'msg',
                                                           'offset' => '24',
                                                           'type' => '3646'
                                                         },
                                                  '4' => {
                                                           'name' => 'maximum_size',
                                                           'offset' => '40',
                                                           'type' => '45'
                                                         },
                                                  '5' => {
                                                           'name' => 'uhead_mark',
                                                           'offset' => '48',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'type',
                                                           'offset' => '52',
                                                           'type' => '6771'
                                                         },
                                                  '7' => {
                                                           'name' => 'record_sequence',
                                                           'offset' => '56',
                                                           'type' => '5354'
                                                         },
                                                  '8' => {
                                                           'name' => 'epoch',
                                                           'offset' => '64',
                                                           'type' => '816'
                                                         },
                                                  '9' => {
                                                           'name' => 'htype',
                                                           'offset' => '68',
                                                           'type' => '2572'
                                                         }
                                                },
                                      'Name' => 'struct mbuffer_st',
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '3821' => {
                                      'BaseType' => '3833',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1229',
                                      'Name' => 'gnutls_db_store_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3833' => {
                                      'Name' => 'int(*)(void*, gnutls_datum_t, gnutls_datum_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '3646'
                                                          },
                                                   '2' => {
                                                            'type' => '3646'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3864' => {
                                      'BaseType' => '3876',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1231',
                                      'Name' => 'gnutls_db_remove_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3876' => {
                                      'Name' => 'int(*)(void*, gnutls_datum_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '3646'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3902' => {
                                      'BaseType' => '3914',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1232',
                                      'Name' => 'gnutls_db_retr_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3914' => {
                                      'Name' => 'gnutls_datum_t(*)(void*, gnutls_datum_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '3646'
                                                          }
                                                 },
                                      'Return' => '3646',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3940' => {
                                      'BaseType' => '3952',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1267',
                                      'Name' => 'gnutls_handshake_hook_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3952' => {
                                      'Name' => 'int(*)(gnutls_session_t, unsigned int, unsigned int, unsigned int, gnutls_datum_t const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3126'
                                                          },
                                                   '1' => {
                                                            'type' => '77'
                                                          },
                                                   '2' => {
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'type' => '77'
                                                          },
                                                   '4' => {
                                                            'type' => '3993'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3993' => {
                                      'BaseType' => '3999',
                                      'Name' => 'gnutls_datum_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3999' => {
                                      'BaseType' => '3646',
                                      'Name' => 'gnutls_datum_t const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '4004' => {
                                      'BaseType' => '4016',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1276',
                                      'Name' => 'gnutls_handshake_post_client_hello_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4016' => {
                                      'Name' => 'int(*)(gnutls_session_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3126'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4037' => {
                                      'BaseType' => '4049',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1304',
                                      'Name' => 'gnutls_pubkey_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4049' => {
                                      'BaseType' => '4055',
                                      'Name' => 'struct gnutls_pubkey_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4055' => {
                                      'Name' => 'struct gnutls_pubkey_st',
                                      'Type' => 'Struct'
                                    },
                          '4060' => {
                                      'BaseType' => '4066',
                                      'Name' => 'struct gnutls_privkey_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4066' => {
                                      'Name' => 'struct gnutls_privkey_st',
                                      'Type' => 'Struct'
                                    },
                          '4117' => {
                                      'BaseType' => '3646',
                                      'Name' => 'gnutls_datum_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4173' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4226' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '1610',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'iov_base',
                                                           'offset' => '0',
                                                           'type' => '152'
                                                         },
                                                  '1' => {
                                                           'name' => 'iov_len',
                                                           'offset' => '8',
                                                           'type' => '45'
                                                         }
                                                },
                                      'Name' => 'struct giovec_t',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4238' => {
                                      'BaseType' => '4250',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1612',
                                      'Name' => 'gnutls_pull_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4250' => {
                                      'Name' => 'ssize_t(*)(gnutls_transport_ptr_t, void*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3114'
                                                          },
                                                   '1' => {
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'type' => '45'
                                                          }
                                                 },
                                      'Return' => '690',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4281' => {
                                      'BaseType' => '4293',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1614',
                                      'Name' => 'gnutls_push_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4293' => {
                                      'Name' => 'ssize_t(*)(gnutls_transport_ptr_t, void const*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3114'
                                                          },
                                                   '1' => {
                                                            'type' => '798'
                                                          },
                                                   '2' => {
                                                            'type' => '45'
                                                          }
                                                 },
                                      'Return' => '690',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4324' => {
                                      'BaseType' => '4336',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1618',
                                      'Name' => 'gnutls_pull_timeout_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4336' => {
                                      'Name' => 'int(*)(gnutls_transport_ptr_t, unsigned int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3114'
                                                          },
                                                   '1' => {
                                                            'type' => '77'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4362' => {
                                      'BaseType' => '4374',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1621',
                                      'Name' => 'gnutls_vec_push_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4374' => {
                                      'Name' => 'ssize_t(*)(gnutls_transport_ptr_t, giovec_t const*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3114'
                                                          },
                                                   '1' => {
                                                            'type' => '4405'
                                                          },
                                                   '2' => {
                                                            'type' => '98'
                                                          }
                                                 },
                                      'Return' => '690',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4405' => {
                                      'BaseType' => '4411',
                                      'Name' => 'giovec_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4411' => {
                                      'BaseType' => '4226',
                                      'Name' => 'giovec_t const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '4416' => {
                                      'BaseType' => '4428',
                                      'Header' => 'gnutls.h',
                                      'Line' => '1624',
                                      'Name' => 'gnutls_errno_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4428' => {
                                      'Name' => 'int(*)(gnutls_transport_ptr_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3114'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4449' => {
                                      'Header' => 'gnutls_str.h',
                                      'Line' => '37',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'allocd',
                                                           'offset' => '0',
                                                           'type' => '6662'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '6662'
                                                         },
                                                  '2' => {
                                                           'name' => 'max_length',
                                                           'offset' => '16',
                                                           'type' => '45'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '24',
                                                           'type' => '45'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_buffer_st',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'BaseType' => '56',
                                    'Header' => 'stddef.h',
                                    'Line' => '216',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4510' => {
                                      'BaseType' => '152',
                                      'Header' => 'gnutls.h',
                                      'Line' => '2240',
                                      'Name' => 'gnutls_ext_priv_data_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4522' => {
                                      'BaseType' => '4528',
                                      'Name' => 'unsigned char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4528' => {
                                      'BaseType' => '63',
                                      'Name' => 'unsigned char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '4533' => {
                                      'Header' => 'dane.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'DANE_CERT_USAGE_CA',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'DANE_CERT_USAGE_EE',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'DANE_CERT_USAGE_LOCAL_CA',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'DANE_CERT_USAGE_LOCAL_EE',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum dane_cert_usage_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4574' => {
                                      'BaseType' => '4533',
                                      'Header' => 'dane.h',
                                      'Line' => '44',
                                      'Name' => 'dane_cert_usage_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4585' => {
                                      'Header' => 'dane.h',
                                      'Line' => '53',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'DANE_CERT_X509',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'DANE_CERT_PK',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum dane_cert_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4614' => {
                                      'BaseType' => '4585',
                                      'Header' => 'dane.h',
                                      'Line' => '56',
                                      'Name' => 'dane_cert_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4625' => {
                                      'Header' => 'dane.h',
                                      'Line' => '66',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'DANE_MATCH_EXACT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'DANE_MATCH_SHA2_256',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'DANE_MATCH_SHA2_512',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum dane_match_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4660' => {
                                      'BaseType' => '4625',
                                      'Header' => 'dane.h',
                                      'Line' => '70',
                                      'Name' => 'dane_match_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4671' => {
                                      'Header' => 'dane.h',
                                      'Line' => '81',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'DANE_QUERY_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'DANE_QUERY_DNSSEC_VERIFIED',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'DANE_QUERY_BOGUS',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'DANE_QUERY_NO_DNSSEC',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum dane_query_status_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4712' => {
                                      'BaseType' => '4671',
                                      'Header' => 'dane.h',
                                      'Line' => '86',
                                      'Name' => 'dane_query_status_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '4723' => {
                                      'BaseType' => '4734',
                                      'Header' => 'dane.h',
                                      'Line' => '88',
                                      'Name' => 'dane_state_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4734' => {
                                      'BaseType' => '4740',
                                      'Name' => 'struct dane_state_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4740' => {
                                      'Line' => '57',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ctx',
                                                           'offset' => '0',
                                                           'type' => '11448'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct dane_state_st',
                                      'Size' => '16',
                                      'Source' => 'dane.c',
                                      'Type' => 'Struct'
                                    },
                          '4777' => {
                                      'BaseType' => '4788',
                                      'Header' => 'dane.h',
                                      'Line' => '89',
                                      'Name' => 'dane_query_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4788' => {
                                      'BaseType' => '4794',
                                      'Name' => 'struct dane_query_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4794' => {
                                      'Line' => '62',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'result',
                                                           'offset' => '0',
                                                           'type' => '1828'
                                                         },
                                                  '1' => {
                                                           'name' => 'data_entries',
                                                           'offset' => '8',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'usage',
                                                           'offset' => '12',
                                                           'type' => '11454'
                                                         },
                                                  '3' => {
                                                           'name' => 'type',
                                                           'offset' => '412',
                                                           'type' => '11470'
                                                         },
                                                  '4' => {
                                                           'name' => 'match',
                                                           'offset' => '812',
                                                           'type' => '11486'
                                                         },
                                                  '5' => {
                                                           'name' => 'data',
                                                           'offset' => '1216',
                                                           'type' => '11502'
                                                         },
                                                  '6' => {
                                                           'name' => 'flags',
                                                           'offset' => '2816',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'status',
                                                           'offset' => '2820',
                                                           'type' => '4712'
                                                         }
                                                },
                                      'Name' => 'struct dane_query_st',
                                      'Size' => '2824',
                                      'Source' => 'dane.c',
                                      'Type' => 'Struct'
                                    },
                          '5014' => {
                                      'BaseType' => '5026',
                                      'Header' => 'openpgp.h',
                                      'Line' => '317',
                                      'Name' => 'gnutls_openpgp_recv_key_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5026' => {
                                      'Name' => 'int(*)(gnutls_session_t, unsigned char const*, unsigned int, gnutls_datum_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3126'
                                                          },
                                                   '1' => {
                                                            'type' => '4522'
                                                          },
                                                   '2' => {
                                                            'type' => '77'
                                                          },
                                                   '3' => {
                                                            'type' => '4117'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5062' => {
                                      'Header' => 'abstract.h',
                                      'Line' => '451',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pubkey',
                                                           'offset' => '0',
                                                           'type' => '4037'
                                                         },
                                                  '1' => {
                                                           'name' => 'cert',
                                                           'offset' => '8',
                                                           'type' => '3646'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '24',
                                                           'type' => '2720'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_pcert_st',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '5115' => {
                                      'BaseType' => '5062',
                                      'Header' => 'abstract.h',
                                      'Line' => '455',
                                      'Name' => 'gnutls_pcert_st',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '5127' => {
                                      'BaseType' => '5115',
                                      'Name' => 'gnutls_pcert_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5133' => {
                                      'BaseType' => '77',
                                      'Name' => 'unsigned int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5139' => {
                                      'Name' => 'int(*)(void*, void const*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '798'
                                                          },
                                                   '2' => {
                                                            'type' => '45'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5170' => {
                                      'Name' => 'int(*)(void*, void const*, size_t, void*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '798'
                                                          },
                                                   '2' => {
                                                            'type' => '45'
                                                          },
                                                   '3' => {
                                                            'type' => '152'
                                                          },
                                                   '4' => {
                                                            'type' => '45'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5211' => {
                                      'Name' => 'void(*)(void*, void*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'type' => '45'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5238' => {
                                      'Name' => 'int(*)(void*, void const*, size_t, void const*, size_t, size_t, void const*, size_t, void*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '798'
                                                          },
                                                   '2' => {
                                                            'type' => '45'
                                                          },
                                                   '3' => {
                                                            'type' => '798'
                                                          },
                                                   '4' => {
                                                            'type' => '45'
                                                          },
                                                   '5' => {
                                                            'type' => '45'
                                                          },
                                                   '6' => {
                                                            'type' => '798'
                                                          },
                                                   '7' => {
                                                            'type' => '45'
                                                          },
                                                   '8' => {
                                                            'type' => '152'
                                                          },
                                                   '9' => {
                                                            'type' => '45'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5304' => {
                                      'Name' => 'int(*)(void*, void*, size_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '152'
                                                          },
                                                   '1' => {
                                                            'type' => '152'
                                                          },
                                                   '2' => {
                                                            'type' => '45'
                                                          }
                                                 },
                                      'Return' => '98',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5354' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '91',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'i',
                                                           'offset' => '0',
                                                           'type' => '1613'
                                                         }
                                                },
                                      'Name' => 'struct uint64',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '5413' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_STREAM',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_DGRAM',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum transport_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5442' => {
                                      'BaseType' => '5413',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '149',
                                      'Name' => 'transport_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '5453' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '151',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'RECORD_FLUSH',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'RECORD_CORKED',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum record_flush_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5482' => {
                                      'BaseType' => '5453',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '154',
                                      'Name' => 'record_flush_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '5493' => {
                                      'BaseType' => '152',
                                      'Header' => 'crypto-backend.h',
                                      'Line' => '84',
                                      'Name' => 'bigint_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '56' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '63' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '6341' => {
                                      'BaseType' => '5493',
                                      'Name' => 'bigint_t[16]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '6357' => {
                                      'Header' => 'crypto-backend.h',
                                      'Line' => '177',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'params',
                                                           'offset' => '0',
                                                           'type' => '6341'
                                                         },
                                                  '1' => {
                                                           'name' => 'params_nr',
                                                           'offset' => '128',
                                                           'type' => '77'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '132',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'algo',
                                                           'offset' => '136',
                                                           'type' => '2802'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_pk_params_st',
                                      'Size' => '144',
                                      'Type' => 'Struct'
                                    },
                          '6368' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '220',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'STATE0',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'STATE1',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'STATE10',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'STATE11',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'STATE12',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'STATE13',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'STATE14',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'STATE15',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'STATE16',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'STATE17',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'STATE18',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'STATE20',
                                                            'value' => '20'
                                                          },
                                                  '2' => {
                                                           'name' => 'STATE2',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'STATE21',
                                                            'value' => '21'
                                                          },
                                                  '21' => {
                                                            'name' => 'STATE22',
                                                            'value' => '22'
                                                          },
                                                  '22' => {
                                                            'name' => 'STATE30',
                                                            'value' => '30'
                                                          },
                                                  '23' => {
                                                            'name' => 'STATE31',
                                                            'value' => '31'
                                                          },
                                                  '24' => {
                                                            'name' => 'STATE40',
                                                            'value' => '40'
                                                          },
                                                  '25' => {
                                                            'name' => 'STATE41',
                                                            'value' => '41'
                                                          },
                                                  '26' => {
                                                            'name' => 'STATE50',
                                                            'value' => '50'
                                                          },
                                                  '27' => {
                                                            'name' => 'STATE60',
                                                            'value' => '60'
                                                          },
                                                  '28' => {
                                                            'name' => 'STATE61',
                                                            'value' => '61'
                                                          },
                                                  '29' => {
                                                            'name' => 'STATE62',
                                                            'value' => '62'
                                                          },
                                                  '3' => {
                                                           'name' => 'STATE3',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'STATE4',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'STATE5',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'STATE6',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'STATE7',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'STATE8',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'STATE9',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum handshake_state_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6565' => {
                                      'BaseType' => '6368',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '227',
                                      'Name' => 'handshake_state_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '6576' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '229',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'SHB_SEND1',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'SHB_SEND2',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'SHB_RECV',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum heartbeat_state_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6611' => {
                                      'BaseType' => '6576',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '233',
                                      'Name' => 'heartbeat_state_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '6622' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '235',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'RECV_STATE_0',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'RECV_STATE_DTLS_RETRANSMIT',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum recv_state_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6651' => {
                                      'BaseType' => '6622',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '238',
                                      'Name' => 'recv_state_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '6662' => {
                                      'BaseType' => '805',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6668' => {
                                      'BaseType' => '4449',
                                      'Header' => 'gnutls_str.h',
                                      'Line' => '42',
                                      'Name' => 'gnutls_buffer_st',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '6711' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '268',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'CIPHER_STREAM',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'CIPHER_BLOCK',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'CIPHER_AEAD',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum cipher_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6723' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '274',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_CHANGE_CIPHER_SPEC',
                                                           'value' => '20'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_ALERT',
                                                           'value' => '21'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_HANDSHAKE',
                                                           'value' => '22'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_APPLICATION_DATA',
                                                           'value' => '23'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_HEARTBEAT',
                                                           'value' => '24'
                                                         }
                                                },
                                      'Name' => 'enum content_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6771' => {
                                      'BaseType' => '6723',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '278',
                                      'Name' => 'content_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '679' => {
                                     'BaseType' => '685',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '685' => {
                                     'BaseType' => '182',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '6897' => {
                                      'BaseType' => '805',
                                      'Name' => 'uint8_t[12]',
                                      'Size' => '12',
                                      'Type' => 'Array'
                                    },
                          '690' => {
                                     'BaseType' => '154',
                                     'Header' => 'stdio.h',
                                     'Line' => '102',
                                     'Name' => 'ssize_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '6913' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '308',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'htype',
                                                           'offset' => '0',
                                                           'type' => '2572'
                                                         },
                                                  '1' => {
                                                           'name' => 'length',
                                                           'offset' => '4',
                                                           'type' => '827'
                                                         },
                                                  '2' => {
                                                           'name' => 'sequence',
                                                           'offset' => '8',
                                                           'type' => '816'
                                                         },
                                                  '3' => {
                                                           'name' => 'start_offset',
                                                           'offset' => '12',
                                                           'type' => '827'
                                                         },
                                                  '4' => {
                                                           'name' => 'end_offset',
                                                           'offset' => '16',
                                                           'type' => '827'
                                                         },
                                                  '5' => {
                                                           'name' => 'header',
                                                           'offset' => '20',
                                                           'type' => '6897'
                                                         },
                                                  '6' => {
                                                           'name' => 'header_size',
                                                           'offset' => '32',
                                                           'type' => '98'
                                                         },
                                                  '7' => {
                                                           'name' => 'data',
                                                           'offset' => '40',
                                                           'type' => '6668'
                                                         }
                                                },
                                      'Name' => 'struct handshake_buffer_st',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '6925' => {
                                      'BaseType' => '3664',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '349',
                                      'Name' => 'mbuffer_st',
                                      'Size' => '80',
                                      'Type' => 'Typedef'
                                    },
                          '6937' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '351',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'head',
                                                           'offset' => '0',
                                                           'type' => '7003'
                                                         },
                                                  '1' => {
                                                           'name' => 'tail',
                                                           'offset' => '8',
                                                           'type' => '7003'
                                                         },
                                                  '2' => {
                                                           'name' => 'length',
                                                           'offset' => '16',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'byte_length',
                                                           'offset' => '24',
                                                           'type' => '45'
                                                         }
                                                },
                                      'Name' => 'struct mbuffer_head_st',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '70' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '7003' => {
                                      'BaseType' => '6925',
                                      'Name' => 'mbuffer_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7009' => {
                                      'BaseType' => '6937',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '357',
                                      'Name' => 'mbuffer_head_st',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '7021' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '362',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'algorithm',
                                                           'offset' => '0',
                                                           'type' => '2223'
                                                         },
                                                  '1' => {
                                                           'name' => 'credentials',
                                                           'offset' => '8',
                                                           'type' => '152'
                                                         },
                                                  '2' => {
                                                           'name' => 'next',
                                                           'offset' => '16',
                                                           'type' => '7414'
                                                         }
                                                },
                                      'Name' => 'struct auth_cred_st',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7080' => {
                                      'BaseType' => '7021',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '369',
                                      'Name' => 'auth_cred_st',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '7092' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '371',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ecdh_params',
                                                           'offset' => '0',
                                                           'type' => '6357'
                                                         },
                                                  '1' => {
                                                           'name' => 'ecdh_x',
                                                           'offset' => '144',
                                                           'type' => '5493'
                                                         },
                                                  '10' => {
                                                            'name' => 'B',
                                                            'offset' => '360',
                                                            'type' => '5493'
                                                          },
                                                  '11' => {
                                                            'name' => 'u',
                                                            'offset' => '368',
                                                            'type' => '5493'
                                                          },
                                                  '12' => {
                                                            'name' => 'b',
                                                            'offset' => '376',
                                                            'type' => '5493'
                                                          },
                                                  '13' => {
                                                            'name' => 'a',
                                                            'offset' => '384',
                                                            'type' => '5493'
                                                          },
                                                  '14' => {
                                                            'name' => 'x',
                                                            'offset' => '392',
                                                            'type' => '5493'
                                                          },
                                                  '15' => {
                                                            'name' => 'rsa',
                                                            'offset' => '400',
                                                            'type' => '7398'
                                                          },
                                                  '16' => {
                                                            'name' => 'auth_info',
                                                            'offset' => '416',
                                                            'type' => '152'
                                                          },
                                                  '17' => {
                                                            'name' => 'auth_info_type',
                                                            'offset' => '424',
                                                            'type' => '2223'
                                                          },
                                                  '18' => {
                                                            'name' => 'auth_info_size',
                                                            'offset' => '428',
                                                            'type' => '98'
                                                          },
                                                  '19' => {
                                                            'name' => 'crypt_algo',
                                                            'offset' => '432',
                                                            'type' => '805'
                                                          },
                                                  '2' => {
                                                           'name' => 'ecdh_y',
                                                           'offset' => '152',
                                                           'type' => '5493'
                                                         },
                                                  '20' => {
                                                            'name' => 'cred',
                                                            'offset' => '440',
                                                            'type' => '7414'
                                                          },
                                                  '21' => {
                                                            'name' => 'crt_requested',
                                                            'offset' => '448',
                                                            'type' => '98'
                                                          },
                                                  '3' => {
                                                           'name' => 'key',
                                                           'offset' => '160',
                                                           'type' => '3646'
                                                         },
                                                  '4' => {
                                                           'name' => 'dh_params',
                                                           'offset' => '176',
                                                           'type' => '6357'
                                                         },
                                                  '5' => {
                                                           'name' => 'client_Y',
                                                           'offset' => '320',
                                                           'type' => '5493'
                                                         },
                                                  '6' => {
                                                           'name' => 'srp_key',
                                                           'offset' => '328',
                                                           'type' => '5493'
                                                         },
                                                  '7' => {
                                                           'name' => 'srp_g',
                                                           'offset' => '336',
                                                           'type' => '5493'
                                                         },
                                                  '8' => {
                                                           'name' => 'srp_p',
                                                           'offset' => '344',
                                                           'type' => '5493'
                                                         },
                                                  '9' => {
                                                           'name' => 'A',
                                                           'offset' => '352',
                                                           'type' => '5493'
                                                         }
                                                },
                                      'Name' => 'struct gnutls_key_st',
                                      'Size' => '456',
                                      'Type' => 'Struct'
                                    },
                          '715' => {
                                     'BaseType' => '141',
                                     'Header' => 'time.h',
                                     'Line' => '75',
                                     'Name' => 'time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '726' => {
                                     'BaseType' => '91',
                                     'Header' => 'types.h',
                                     'Line' => '195',
                                     'Name' => 'int16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '737' => {
                                     'Header' => 'time.h',
                                     'Line' => '120',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tv_sec',
                                                          'offset' => '0',
                                                          'type' => '141'
                                                        },
                                                 '1' => {
                                                          'name' => 'tv_nsec',
                                                          'offset' => '8',
                                                          'type' => '165'
                                                        }
                                               },
                                     'Name' => 'struct timespec',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '7398' => {
                                      'BaseType' => '5493',
                                      'Name' => 'bigint_t[2]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '7414' => {
                                      'BaseType' => '7080',
                                      'Name' => 'auth_cred_st*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7420' => {
                                      'BaseType' => '7092',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '422',
                                      'Name' => 'gnutls_key_st',
                                      'Size' => '456',
                                      'Type' => 'Typedef'
                                    },
                          '7432' => {
                                      'BaseType' => '7444',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '430',
                                      'Name' => 'record_state_st',
                                      'Size' => '224',
                                      'Type' => 'Typedef'
                                    },
                          '7444' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '591',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'mac_secret',
                                                           'offset' => '0',
                                                           'type' => '3646'
                                                         },
                                                  '1' => {
                                                           'name' => 'IV',
                                                           'offset' => '16',
                                                           'type' => '3646'
                                                         },
                                                  '2' => {
                                                           'name' => 'key',
                                                           'offset' => '32',
                                                           'type' => '3646'
                                                         },
                                                  '3' => {
                                                           'name' => 'cipher_state',
                                                           'offset' => '48',
                                                           'type' => '8853'
                                                         },
                                                  '4' => {
                                                           'name' => 'compression_state',
                                                           'offset' => '200',
                                                           'type' => '8901'
                                                         },
                                                  '5' => {
                                                           'name' => 'sequence_number',
                                                           'offset' => '216',
                                                           'type' => '5354'
                                                         }
                                                },
                                      'Name' => 'struct record_state_st',
                                      'Size' => '224',
                                      'Type' => 'Struct'
                                    },
                          '7535' => {
                                      'BaseType' => '7547',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '433',
                                      'Name' => 'record_parameters_st',
                                      'Size' => '1016',
                                      'Type' => 'Typedef'
                                    },
                          '7547' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '609',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'epoch',
                                                           'offset' => '0',
                                                           'type' => '816'
                                                         },
                                                  '1' => {
                                                           'name' => 'initialized',
                                                           'offset' => '4',
                                                           'type' => '98'
                                                         },
                                                  '10' => {
                                                            'name' => 'write',
                                                            'offset' => '784',
                                                            'type' => '7432'
                                                          },
                                                  '11' => {
                                                            'name' => 'send_nonce',
                                                            'offset' => '1008',
                                                            'type' => '77'
                                                          },
                                                  '12' => {
                                                            'name' => 'usage_cnt',
                                                            'offset' => '1012',
                                                            'type' => '98'
                                                          },
                                                  '2' => {
                                                           'name' => 'compression_algorithm',
                                                           'offset' => '8',
                                                           'type' => '2449'
                                                         },
                                                  '3' => {
                                                           'name' => 'cipher',
                                                           'offset' => '16',
                                                           'type' => '8695'
                                                         },
                                                  '4' => {
                                                           'name' => 'etm',
                                                           'offset' => '24',
                                                           'type' => '8202'
                                                         },
                                                  '5' => {
                                                           'name' => 'mac',
                                                           'offset' => '32',
                                                           'type' => '8356'
                                                         },
                                                  '6' => {
                                                           'name' => 'record_sw',
                                                           'offset' => '40',
                                                           'type' => '9302'
                                                         },
                                                  '7' => {
                                                           'name' => 'record_sw_head_idx',
                                                           'offset' => '552',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'record_sw_size',
                                                           'offset' => '556',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'read',
                                                           'offset' => '560',
                                                           'type' => '7432'
                                                         }
                                                },
                                      'Name' => 'struct record_parameters_st',
                                      'Size' => '1016',
                                      'Type' => 'Struct'
                                    },
                          '77' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7737' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '436',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '679'
                                                         },
                                                  '1' => {
                                                           'name' => 'id',
                                                           'offset' => '8',
                                                           'type' => '2049'
                                                         },
                                                  '2' => {
                                                           'name' => 'blocksize',
                                                           'offset' => '12',
                                                           'type' => '816'
                                                         },
                                                  '3' => {
                                                           'name' => 'keysize',
                                                           'offset' => '14',
                                                           'type' => '816'
                                                         },
                                                  '4' => {
                                                           'name' => 'type',
                                                           'offset' => '16',
                                                           'type' => '6711'
                                                         },
                                                  '5' => {
                                                           'name' => 'implicit_iv',
                                                           'offset' => '20',
                                                           'type' => '816'
                                                         },
                                                  '6' => {
                                                           'name' => 'explicit_iv',
                                                           'offset' => '22',
                                                           'type' => '816'
                                                         },
                                                  '7' => {
                                                           'name' => 'cipher_iv',
                                                           'offset' => '24',
                                                           'type' => '816'
                                                         },
                                                  '8' => {
                                                           'name' => 'tagsize',
                                                           'offset' => '26',
                                                           'type' => '816'
                                                         }
                                                },
                                      'Name' => 'struct cipher_entry_st',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '781' => {
                                     'BaseType' => '98',
                                     'Name' => 'int*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7867' => {
                                      'BaseType' => '7737',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '446',
                                      'Name' => 'cipher_entry_st',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '787' => {
                                     'BaseType' => '793',
                                     'Name' => 'int const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7879' => {
                                      'BaseType' => '805',
                                      'Name' => 'uint8_t[2]',
                                      'Size' => '2',
                                      'Type' => 'Array'
                                    },
                          '7895' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '469',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '679'
                                                         },
                                                  '1' => {
                                                           'name' => 'oid',
                                                           'offset' => '8',
                                                           'type' => '679'
                                                         },
                                                  '2' => {
                                                           'name' => 'id',
                                                           'offset' => '16',
                                                           'type' => '2325'
                                                         },
                                                  '3' => {
                                                           'name' => 'output_size',
                                                           'offset' => '20',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'key_size',
                                                           'offset' => '24',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'name' => 'nonce_size',
                                                           'offset' => '28',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'placeholder',
                                                           'offset' => '32',
                                                           'type' => '77'
                                                         },
                                                  '7' => {
                                                           'name' => 'secure',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'block_size',
                                                           'offset' => '40',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct mac_entry_st',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '793' => {
                                     'BaseType' => '98',
                                     'Name' => 'int const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '798' => {
                                     'BaseType' => '804',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '8025' => {
                                      'BaseType' => '7895',
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '479',
                                      'Name' => 'mac_entry_st',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '804' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '805' => {
                                     'BaseType' => '63',
                                     'Header' => 'stdint.h',
                                     'Line' => '48',
                                     'Name' => 'uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '816' => {
                                     'BaseType' => '70',
                                     'Header' => 'stdint.h',
                                     'Line' => '49',
                                     'Name' => 'uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '8202' => {
                                      'Name' => '_Bool',
                                      'Size' => '1',
                                      'Type' => 'Intrinsic'
                                    },
                          '8209' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '494',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '679'
                                                         },
                                                  '1' => {
                                                           'name' => 'id',
                                                           'offset' => '8',
                                                           'type' => '2670'
                                                         },
                                                  '10' => {
                                                            'name' => 'selectable_prf',
                                                            'offset' => '28',
                                                            'type' => '8202'
                                                          },
                                                  '11' => {
                                                            'name' => 'obsolete',
                                                            'offset' => '29',
                                                            'type' => '8202'
                                                          },
                                                  '2' => {
                                                           'name' => 'age',
                                                           'offset' => '12',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'name' => 'major',
                                                           'offset' => '16',
                                                           'type' => '805'
                                                         },
                                                  '4' => {
                                                           'name' => 'minor',
                                                           'offset' => '17',
                                                           'type' => '805'
                                                         },
                                                  '5' => {
                                                           'name' => 'transport',
                                                           'offset' => '20',
                                                           'type' => '5442'
                                                         },
                                                  '6' => {
                                                           'name' => 'supported',
                                                           'offset' => '24',
                                                           'type' => '8202'
                                                         },
                                                  '7' => {
                                                           'name' => 'explicit_iv',
                                                           'offset' => '25',
                                                           'type' => '8202'
                                                         },
                                                  '8' => {
                                                           'name' => 'extensions',
                                                           'offset' => '26',
                                                           'type' => '8202'
                                                         },
                                                  '9' => {
                                                           'name' => 'selectable_sighash',
                                                           'offset' => '27',
                                                           'type' => '8202'
                                                         }
                                                },
                                      'Name' => 'struct version_entry_st',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '8221' => {
                                      'BaseType' => '5139',
                                      'Header' => 'gnutls_hash_int.h',
                                      'Line' => '39',
                                      'Name' => 'hash_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8232' => {
                                      'BaseType' => '5139',
                                      'Header' => 'gnutls_hash_int.h',
                                      'Line' => '40',
                                      'Name' => 'nonce_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8243' => {
                                      'BaseType' => '5304',
                                      'Header' => 'gnutls_hash_int.h',
                                      'Line' => '41',
                                      'Name' => 'output_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8254' => {
                                      'BaseType' => '4173',
                                      'Header' => 'gnutls_hash_int.h',
                                      'Line' => '43',
                                      'Name' => 'hash_deinit_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '827' => {
                                     'BaseType' => '77',
                                     'Header' => 'stdint.h',
                                     'Line' => '51',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '8356' => {
                                      'BaseType' => '8362',
                                      'Name' => 'mac_entry_st const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8362' => {
                                      'BaseType' => '8025',
                                      'Name' => 'mac_entry_st const',
                                      'Size' => '48',
                                      'Type' => 'Const'
                                    },
                          '8367' => {
                                      'Header' => 'gnutls_hash_int.h',
                                      'Line' => '55',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'e',
                                                           'offset' => '0',
                                                           'type' => '8356'
                                                         },
                                                  '1' => {
                                                           'name' => 'hash',
                                                           'offset' => '8',
                                                           'type' => '8221'
                                                         },
                                                  '2' => {
                                                           'name' => 'output',
                                                           'offset' => '16',
                                                           'type' => '8243'
                                                         },
                                                  '3' => {
                                                           'name' => 'deinit',
                                                           'offset' => '24',
                                                           'type' => '8254'
                                                         },
                                                  '4' => {
                                                           'name' => 'key',
                                                           'offset' => '32',
                                                           'type' => '798'
                                                         },
                                                  '5' => {
                                                           'name' => 'keysize',
                                                           'offset' => '40',
                                                           'type' => '98'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '48',
                                                           'type' => '152'
                                                         }
                                                },
                                      'Name' => 'struct digest_hd_st',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '838' => {
                                     'BaseType' => '56',
                                     'Header' => 'stdint.h',
                                     'Line' => '55',
                                     'Name' => 'uint64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '8469' => {
                                      'Header' => 'gnutls_hash_int.h',
                                      'Line' => '67',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'e',
                                                           'offset' => '0',
                                                           'type' => '8356'
                                                         },
                                                  '1' => {
                                                           'name' => 'mac_len',
                                                           'offset' => '8',
                                                           'type' => '98'
                                                         },
                                                  '2' => {
                                                           'name' => 'hash',
                                                           'offset' => '16',
                                                           'type' => '8221'
                                                         },
                                                  '3' => {
                                                           'name' => 'setnonce',
                                                           'offset' => '24',
                                                           'type' => '8232'
                                                         },
                                                  '4' => {
                                                           'name' => 'output',
                                                           'offset' => '32',
                                                           'type' => '8243'
                                                         },
                                                  '5' => {
                                                           'name' => 'deinit',
                                                           'offset' => '40',
                                                           'type' => '8254'
                                                         },
                                                  '6' => {
                                                           'name' => 'handle',
                                                           'offset' => '48',
                                                           'type' => '152'
                                                         }
                                                },
                                      'Name' => 'struct mac_hd_st',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '8480' => {
                                      'BaseType' => '5170',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '33',
                                      'Name' => 'cipher_encrypt_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8491' => {
                                      'BaseType' => '5170',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '35',
                                      'Name' => 'cipher_decrypt_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8502' => {
                                      'BaseType' => '5238',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '37',
                                      'Name' => 'aead_cipher_encrypt_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8513' => {
                                      'BaseType' => '5238',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '43',
                                      'Name' => 'aead_cipher_decrypt_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8524' => {
                                      'BaseType' => '4173',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '49',
                                      'Name' => 'cipher_deinit_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8535' => {
                                      'BaseType' => '5139',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '51',
                                      'Name' => 'cipher_auth_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8546' => {
                                      'BaseType' => '5139',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '52',
                                      'Name' => 'cipher_setiv_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8557' => {
                                      'BaseType' => '5211',
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '54',
                                      'Name' => 'cipher_tag_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8695' => {
                                      'BaseType' => '8701',
                                      'Name' => 'cipher_entry_st const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8701' => {
                                      'BaseType' => '7867',
                                      'Name' => 'cipher_entry_st const',
                                      'Size' => '32',
                                      'Type' => 'Const'
                                    },
                          '8706' => {
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '67',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'handle',
                                                           'offset' => '0',
                                                           'type' => '152'
                                                         },
                                                  '1' => {
                                                           'name' => 'e',
                                                           'offset' => '8',
                                                           'type' => '8695'
                                                         },
                                                  '2' => {
                                                           'name' => 'encrypt',
                                                           'offset' => '16',
                                                           'type' => '8480'
                                                         },
                                                  '3' => {
                                                           'name' => 'decrypt',
                                                           'offset' => '24',
                                                           'type' => '8491'
                                                         },
                                                  '4' => {
                                                           'name' => 'aead_encrypt',
                                                           'offset' => '32',
                                                           'type' => '8502'
                                                         },
                                                  '5' => {
                                                           'name' => 'aead_decrypt',
                                                           'offset' => '40',
                                                           'type' => '8513'
                                                         },
                                                  '6' => {
                                                           'name' => 'auth',
                                                           'offset' => '48',
                                                           'type' => '8535'
                                                         },
                                                  '7' => {
                                                           'name' => 'tag',
                                                           'offset' => '56',
                                                           'type' => '8557'
                                                         },
                                                  '8' => {
                                                           'name' => 'setiv',
                                                           'offset' => '64',
                                                           'type' => '8546'
                                                         },
                                                  '9' => {
                                                           'name' => 'deinit',
                                                           'offset' => '72',
                                                           'type' => '8524'
                                                         }
                                                },
                                      'Name' => 'struct cipher_hd_st',
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '8717' => {
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '191',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dig',
                                                           'offset' => '0',
                                                           'type' => '8367'
                                                         },
                                                  '1' => {
                                                           'name' => 'mac',
                                                           'offset' => '0',
                                                           'type' => '8469'
                                                         }
                                                },
                                      'Name' => 'anon-union-gnutls_cipher_int.h-191',
                                      'Size' => '56',
                                      'Type' => 'Union'
                                    },
                          '8853' => {
                                      'Header' => 'gnutls_cipher_int.h',
                                      'Line' => '200',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cipher',
                                                           'offset' => '0',
                                                           'type' => '8706'
                                                         },
                                                  '1' => {
                                                           'name' => 'mac',
                                                           'offset' => '80',
                                                           'type' => '8717'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'is_mac',
                                                           'offset' => '136',
                                                           'type' => '77'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'ssl_hmac',
                                                           'offset' => '136',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'non_null',
                                                           'offset' => '136',
                                                           'type' => '77'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'etm',
                                                           'offset' => '136',
                                                           'type' => '77'
                                                         },
                                                  '6' => {
                                                           'name' => 'tag_size',
                                                           'offset' => '144',
                                                           'type' => '45'
                                                         }
                                                },
                                      'Name' => 'struct auth_cipher_hd_st',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '8864' => {
                                      'Header' => 'gnutls_compress.h',
                                      'Line' => '38',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'handle',
                                                           'offset' => '0',
                                                           'type' => '152'
                                                         },
                                                  '1' => {
                                                           'name' => 'algo',
                                                           'offset' => '8',
                                                           'type' => '2449'
                                                         }
                                                },
                                      'Name' => 'struct comp_hd_st',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8901' => {
                                      'BaseType' => '8864',
                                      'Header' => 'gnutls_compress.h',
                                      'Line' => '41',
                                      'Name' => 'comp_hd_st',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '91' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '9247' => {
                                      'BaseType' => '805',
                                      'Name' => 'uint8_t[48]',
                                      'Size' => '48',
                                      'Type' => 'Array'
                                    },
                          '9263' => {
                                      'BaseType' => '805',
                                      'Name' => 'uint8_t[32]',
                                      'Size' => '32',
                                      'Type' => 'Array'
                                    },
                          '9279' => {
                                      'BaseType' => '9285',
                                      'Name' => 'version_entry_st const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9285' => {
                                      'BaseType' => '8209',
                                      'Name' => 'version_entry_st const',
                                      'Size' => '32',
                                      'Type' => 'Const'
                                    },
                          '9290' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '589',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'entity',
                                                           'offset' => '0',
                                                           'type' => '77'
                                                         },
                                                  '1' => {
                                                           'name' => 'kx_algorithm',
                                                           'offset' => '4',
                                                           'type' => '2169'
                                                         },
                                                  '10' => {
                                                            'name' => 'server_random',
                                                            'offset' => '104',
                                                            'type' => '9263'
                                                          },
                                                  '11' => {
                                                            'name' => 'session_id',
                                                            'offset' => '136',
                                                            'type' => '9263'
                                                          },
                                                  '12' => {
                                                            'name' => 'session_id_size',
                                                            'offset' => '168',
                                                            'type' => '805'
                                                          },
                                                  '13' => {
                                                            'name' => 'timestamp',
                                                            'offset' => '176',
                                                            'type' => '715'
                                                          },
                                                  '14' => {
                                                            'name' => 'max_record_send_size',
                                                            'offset' => '184',
                                                            'type' => '816'
                                                          },
                                                  '15' => {
                                                            'name' => 'max_record_recv_size',
                                                            'offset' => '186',
                                                            'type' => '816'
                                                          },
                                                  '16' => {
                                                            'name' => 'cert_type',
                                                            'offset' => '188',
                                                            'type' => '2720'
                                                          },
                                                  '17' => {
                                                            'name' => 'ecc_curve',
                                                            'offset' => '192',
                                                            'type' => '3016'
                                                          },
                                                  '18' => {
                                                            'name' => 'server_sign_algo',
                                                            'offset' => '196',
                                                            'type' => '2954'
                                                          },
                                                  '19' => {
                                                            'name' => 'client_sign_algo',
                                                            'offset' => '200',
                                                            'type' => '2954'
                                                          },
                                                  '2' => {
                                                           'name' => 'epoch_read',
                                                           'offset' => '8',
                                                           'type' => '816'
                                                         },
                                                  '20' => {
                                                            'name' => 'ext_master_secret',
                                                            'offset' => '204',
                                                            'type' => '805'
                                                          },
                                                  '21' => {
                                                            'name' => 'etm',
                                                            'offset' => '205',
                                                            'type' => '805'
                                                          },
                                                  '22' => {
                                                            'name' => 'do_recv_supplemental',
                                                            'offset' => '208',
                                                            'type' => '98'
                                                          },
                                                  '23' => {
                                                            'name' => 'do_send_supplemental',
                                                            'offset' => '212',
                                                            'type' => '98'
                                                          },
                                                  '24' => {
                                                            'name' => 'pversion',
                                                            'offset' => '216',
                                                            'type' => '9279'
                                                          },
                                                  '3' => {
                                                           'name' => 'epoch_write',
                                                           'offset' => '10',
                                                           'type' => '816'
                                                         },
                                                  '4' => {
                                                           'name' => 'epoch_next',
                                                           'offset' => '12',
                                                           'type' => '816'
                                                         },
                                                  '5' => {
                                                           'name' => 'epoch_min',
                                                           'offset' => '14',
                                                           'type' => '816'
                                                         },
                                                  '6' => {
                                                           'name' => 'cipher_suite',
                                                           'offset' => '16',
                                                           'type' => '7879'
                                                         },
                                                  '7' => {
                                                           'name' => 'compression_method',
                                                           'offset' => '20',
                                                           'type' => '2449'
                                                         },
                                                  '8' => {
                                                           'name' => 'master_secret',
                                                           'offset' => '24',
                                                           'type' => '9247'
                                                         },
                                                  '9' => {
                                                           'name' => 'client_random',
                                                           'offset' => '72',
                                                           'type' => '9263'
                                                         }
                                                },
                                      'Name' => 'struct security_parameters_st',
                                      'Size' => '224',
                                      'Type' => 'Struct'
                                    },
                          '9302' => {
                                      'BaseType' => '838',
                                      'Name' => 'uint64_t[64]',
                                      'Size' => '512',
                                      'Type' => 'Array'
                                    },
                          '9354' => {
                                      'BaseType' => '77',
                                      'Name' => 'unsigned int[32]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '9370' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '638',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'priority',
                                                           'offset' => '0',
                                                           'type' => '9354'
                                                         },
                                                  '1' => {
                                                           'name' => 'algorithms',
                                                           'offset' => '128',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct priority_st',
                                      'Size' => '132',
                                      'Type' => 'Struct'
                                    },
                          '9420' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '645',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'SR_DISABLED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'SR_UNSAFE',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'SR_PARTIAL',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'SR_SAFE',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum safe_renegotiation_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '9468' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '707',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'dh_params',
                                                           'offset' => '0',
                                                           'type' => '3213'
                                                         },
                                                  '1' => {
                                                           'name' => 'free_dh_params',
                                                           'offset' => '8',
                                                           'type' => '98'
                                                         }
                                                },
                                      'Name' => 'struct internal_params_st',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '9698' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '751',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cookie',
                                                           'offset' => '0',
                                                           'type' => '9263'
                                                         },
                                                  '1' => {
                                                           'name' => 'cookie_len',
                                                           'offset' => '32',
                                                           'type' => '805'
                                                         },
                                                  '10' => {
                                                            'name' => 'blocking',
                                                            'offset' => '56',
                                                            'type' => '8202'
                                                          },
                                                  '11' => {
                                                            'name' => 'handshake_start_time',
                                                            'offset' => '64',
                                                            'type' => '737'
                                                          },
                                                  '12' => {
                                                            'name' => 'actual_retrans_timeout_ms',
                                                            'offset' => '80',
                                                            'type' => '77'
                                                          },
                                                  '13' => {
                                                            'name' => 'async_term',
                                                            'offset' => '88',
                                                            'type' => '715'
                                                          },
                                                  '14' => {
                                                            'name' => 'last_retransmit',
                                                            'offset' => '96',
                                                            'type' => '737'
                                                          },
                                                  '15' => {
                                                            'name' => 'packets_dropped',
                                                            'offset' => '112',
                                                            'type' => '77'
                                                          },
                                                  '2' => {
                                                           'name' => 'hsk_write_seq',
                                                           'offset' => '34',
                                                           'type' => '816'
                                                         },
                                                  '3' => {
                                                           'name' => 'hsk_read_seq',
                                                           'offset' => '36',
                                                           'type' => '77'
                                                         },
                                                  '4' => {
                                                           'name' => 'mtu',
                                                           'offset' => '40',
                                                           'type' => '816'
                                                         },
                                                  '5' => {
                                                           'name' => 'flight_init',
                                                           'offset' => '42',
                                                           'type' => '8202'
                                                         },
                                                  '6' => {
                                                           'name' => 'last_flight',
                                                           'offset' => '43',
                                                           'type' => '8202'
                                                         },
                                                  '7' => {
                                                           'name' => 'retrans_timeout_ms',
                                                           'offset' => '44',
                                                           'type' => '77'
                                                         },
                                                  '8' => {
                                                           'name' => 'total_timeout_ms',
                                                           'offset' => '48',
                                                           'type' => '77'
                                                         },
                                                  '9' => {
                                                           'name' => 'hsk_hello_verify_requests',
                                                           'offset' => '52',
                                                           'type' => '77'
                                                         }
                                                },
                                      'Name' => 'struct dtls_st',
                                      'Size' => '120',
                                      'Type' => 'Struct'
                                    },
                          '9710' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '948',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '816'
                                                         },
                                                  '1' => {
                                                           'name' => 'priv',
                                                           'offset' => '8',
                                                           'type' => '4510'
                                                         },
                                                  '2' => {
                                                           'name' => 'set',
                                                           'offset' => '16',
                                                           'type' => '8202'
                                                         }
                                                },
                                      'Name' => 'anon-struct-gnutls_int.h-948',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '9759' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '954',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '816'
                                                         },
                                                  '1' => {
                                                           'name' => 'priv',
                                                           'offset' => '8',
                                                           'type' => '4510'
                                                         },
                                                  '2' => {
                                                           'name' => 'set',
                                                           'offset' => '16',
                                                           'type' => '8202'
                                                         }
                                                },
                                      'Name' => 'anon-struct-gnutls_int.h-954',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '98' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libgnutls-dane.so.0.4.1' => {
                                                                 '_ITM_deregisterTMCloneTable' => 0,
                                                                 '_ITM_registerTMCloneTable' => 0,
                                                                 '_Jv_RegisterClasses' => 0,
                                                                 '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                 '__errno_location@GLIBC_2.2.5' => 0,
                                                                 '__fxstat@GLIBC_2.2.5' => 0,
                                                                 '__gmon_start__' => 0,
                                                                 '_gnutls_buffer_append_str@GNUTLS_PRIVATE' => 0,
                                                                 '_gnutls_buffer_init@GNUTLS_PRIVATE' => 0,
                                                                 '_gnutls_buffer_to_datum@GNUTLS_PRIVATE' => 0,
                                                                 'abort@GLIBC_2.2.5' => 0,
                                                                 'calloc@GLIBC_2.2.5' => 0,
                                                                 'dcgettext@GLIBC_2.2.5' => 0,
                                                                 'fclose@GLIBC_2.2.5' => 0,
                                                                 'ferror@GLIBC_2.2.5' => 0,
                                                                 'fileno@GLIBC_2.2.5' => 0,
                                                                 'fopen@GLIBC_2.2.5' => 0,
                                                                 'fread@GLIBC_2.2.5' => 0,
                                                                 'free@GLIBC_2.2.5' => 0,
                                                                 'ftello@GLIBC_2.2.5' => 0,
                                                                 'gnutls_calloc@GNUTLS_3_4' => 0,
                                                                 'gnutls_certificate_get_issuer@GNUTLS_3_4' => 0,
                                                                 'gnutls_certificate_get_peers@GNUTLS_3_4' => 0,
                                                                 'gnutls_certificate_type_get@GNUTLS_3_4' => 0,
                                                                 'gnutls_credentials_get@GNUTLS_3_4' => 0,
                                                                 'gnutls_free@GNUTLS_3_4' => 0,
                                                                 'gnutls_hash_fast@GNUTLS_3_4' => 0,
                                                                 'gnutls_pubkey_deinit@GNUTLS_3_4' => 0,
                                                                 'gnutls_pubkey_export2@GNUTLS_3_4' => 0,
                                                                 'gnutls_pubkey_import_x509@GNUTLS_3_4' => 0,
                                                                 'gnutls_pubkey_init@GNUTLS_3_4' => 0,
                                                                 'gnutls_x509_crt_check_issuer@GNUTLS_3_4' => 0,
                                                                 'gnutls_x509_crt_deinit@GNUTLS_3_4' => 0,
                                                                 'gnutls_x509_crt_export2@GNUTLS_3_4' => 0,
                                                                 'gnutls_x509_crt_import@GNUTLS_3_4' => 0,
                                                                 'gnutls_x509_crt_init@GNUTLS_3_4' => 0,
                                                                 'gnutls_x509_crt_verify@GNUTLS_3_4' => 0,
                                                                 'malloc@GLIBC_2.2.5' => 0,
                                                                 'memchr@GLIBC_2.2.5' => 0,
                                                                 'memcmp@GLIBC_2.2.5' => 0,
                                                                 'memcpy@GLIBC_2.14' => 0,
                                                                 'realloc@GLIBC_2.2.5' => 0,
                                                                 'snprintf@GLIBC_2.2.5' => 0,
                                                                 'stderr@GLIBC_2.2.5' => 0,
                                                                 'ub_ctx_add_ta_file' => 0,
                                                                 'ub_ctx_create' => 0,
                                                                 'ub_ctx_debugout' => 0,
                                                                 'ub_ctx_delete' => 0,
                                                                 'ub_ctx_hosts' => 0,
                                                                 'ub_ctx_resolvconf' => 0,
                                                                 'ub_ctx_set_option' => 0,
