$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.14',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '5.3.1',
          'Headers' => {
                         'abstract.h' => 1,
                         'abstract_int.h' => 1,
                         'algorithms.h' => 1,
                         'alpn.h' => 1,
                         'anon.h' => 1,
                         'cert.h' => 1,
                         'context.h' => 1,
                         'crypto-backend.h' => 1,
                         'crypto.h' => 1,
                         'dtls.h' => 1,
                         'ecc.h' => 1,
                         'etm.h' => 1,
                         'ext_master_secret.h' => 1,
                         'filters.h' => 1,
                         'fips.h' => 1,
                         'gnutls.h' => 1,
                         'gnutls_auth.h' => 1,
                         'gnutls_cipher_int.h' => 1,
                         'gnutls_compress.h' => 1,
                         'gnutls_errors.h' => 1,
                         'gnutls_extensions.h' => 1,
                         'gnutls_global.h' => 1,
                         'gnutls_hash_int.h' => 1,
                         'gnutls_int.h' => 1,
                         'gnutls_mpi.h' => 1,
                         'gnutls_pk.h' => 1,
                         'gnutls_str.h' => 1,
                         'gnutls_str_array.h' => 1,

                                                    'gnutls_x509_privkey_init@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_sec_param@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_set_pin_function@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_sign_data@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_sign_hash@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_verify_params@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_rdn_get@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_rdn_get_by_oid@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_rdn_get_oid@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_cas@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_crls@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_named_crt@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_system_trust@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_trust_dir@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_trust_file@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_trust_mem@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_deinit@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_get_issuer@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_get_issuer_by_dn@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_init@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_iter_deinit@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_iter_get_ca@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_remove_cas@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_remove_trust_file@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_remove_trust_mem@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_verify_crt2@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_verify_crt@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_verify_named_crt@@GNUTLS_3_4' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1017946' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '619',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_FULL',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_ONELINE',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_UNSIGNED_FULL',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_COMPACT',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_CRT_PRINT_FULL_NUMBERS',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_certificate_print_formats',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1017994' => {
                                         'BaseType' => '1017946',
                                         'Header' => 'gnutls.h',
                                         'Line' => '625',
                                         'Name' => 'gnutls_certificate_print_formats_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1018880' => {
                                         'BaseType' => '1018892',
                                         'Header' => 'x509.h',
                                         'Line' => '264',
                                         'Name' => 'gnutls_x509_name_constraints_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1018892' => {
                                         'BaseType' => '1018898',
                                         'Name' => 'struct gnutls_name_constraints_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1018898' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '434',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'permitted',
                                                              'offset' => '0',
                                                              'type' => '1240667'
                                                            },
                                                     '1' => {
                                                              'name' => 'excluded',
                                                              'offset' => '8',
                                                              'type' => '1240667'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_name_constraints_st',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1018938' => {
                                         'Header' => 'x509.h',
                                         'Line' => '438',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_X509_QUALIFIER_UNKNOWN',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_X509_QUALIFIER_URI',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_X509_QUALIFIER_NOTICE',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_x509_qualifier_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1018974' => {
                                         'BaseType' => '1018938',
                                         'Header' => 'x509.h',
                                         'Line' => '441',
                                         'Name' => 'gnutls_x509_qualifier_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1018986' => {
                                         'Header' => 'x509.h',
                                         'Line' => '446',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '1018974'
                                                            },
                                                     '1' => {
                                                              'name' => 'data',
                                                              'offset' => '8',
                                                              'type' => '208'
                                                            },
                                                     '2' => {
                                                              'name' => 'size',
                                                              'offset' => '16',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-x509.h-446',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1019035' => {
                                         'Header' => 'x509.h',
                                         'Line' => '443',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'oid',
                                                              'offset' => '0',
                                                              'type' => '208'
                                                            },
                                                     '1' => {
                                                              'name' => 'qualifiers',
                                                              'offset' => '8',
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'name' => 'qualifier',
                                                              'offset' => '16',
                                                              'type' => '1019088'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_policy_st',
                                         'Size' => '208',
                                         'Type' => 'Struct'
                                       },
                          '1019088' => {
                                         'BaseType' => '1018986',
                                         'Name' => 'anon-struct-x509.h-446[8]',
                                         'Size' => '192',
                                         'Type' => 'Array'
                                       },
                          '1020465' => {
                                         'BaseType' => '1020476',
                                         'Header' => 'x509-ext.h',
                                         'Line' => '60',
                                         'Name' => 'gnutls_x509_crl_dist_points_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1020476' => {
                                         'BaseType' => '1020482',
                                         'Name' => 'struct gnutls_x509_crl_dist_points_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1020482' => {
                                         'Line' => '2126',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'points',
                                                              'offset' => '0',
                                                              'type' => '1271569'
                                                            },
                                                     '1' => {
                                                              'name' => 'size',
                                                              'offset' => '8',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_crl_dist_points_st',
                                         'Size' => '16',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1020487' => {
                                         'BaseType' => '1020498',
                                         'Header' => 'x509-ext.h',
                                         'Line' => '83',
                                         'Name' => 'gnutls_x509_aia_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1020498' => {
                                         'BaseType' => '1020504',
                                         'Name' => 'struct gnutls_x509_aia_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1020504' => {
                                         'Line' => '2480',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'aia',
                                                              'offset' => '0',
                                                              'type' => '1271624'
                                                            },
                                                     '1' => {
                                                              'name' => 'size',
                                                              'offset' => '8',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_aia_st',
                                         'Size' => '16',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1020531' => {
                                         'BaseType' => '1020542',
                                         'Header' => 'x509-ext.h',
                                         'Line' => '146',
                                         'Name' => 'gnutls_x509_key_purposes_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1020542' => {
                                         'BaseType' => '1020548',
                                         'Name' => 'struct gnutls_x509_key_purposes_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1020548' => {
                                         'Line' => '2803',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'oid',
                                                              'offset' => '0',
                                                              'type' => '1271630'
                                                            },
                                                     '1' => {
                                                              'name' => 'size',
                                                              'offset' => '1024',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_key_purposes_st',
                                         'Size' => '1032',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1020553' => {
                                         'BaseType' => '1020564',
                                         'Header' => 'x509-ext.h',
                                         'Line' => '172',
                                         'Name' => 'gnutls_x509_policies_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1020564' => {
                                         'BaseType' => '1020570',
                                         'Name' => 'struct gnutls_x509_policies_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1020570' => {
                                         'Line' => '1639',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'policy',
                                                              'offset' => '0',
                                                              'type' => '1271500'
                                                            },
                                                     '1' => {
                                                              'name' => 'size',
                                                              'offset' => '13312',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_policies_st',
                                         'Size' => '13320',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1020575' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '439',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '1' => {
                                                              'name' => 'name',
                                                              'offset' => '8',
                                                              'type' => '3192'
                                                            },
                                                     '2' => {
                                                              'name' => 'next',
                                                              'offset' => '24',
                                                              'type' => '1240667'
                                                            }
                                                   },
                                         'Name' => 'struct name_constraints_node_st',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '10246' => {
                                       'BaseType' => '6068',
                                       'Name' => 'handshake_buffer_st[6]',
                                       'Size' => '432',
                                       'Type' => 'Array'
                                     },
                          '10262' => {
                                       'Header' => 'gnutls_auth.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '105'
                                                          },
                                                   '1' => {
                                                            'name' => 'gnutls_generate_server_certificate',
                                                            'offset' => '8',
                                                            'type' => '10561'
                                                          },
                                                   '10' => {
                                                             'name' => 'gnutls_process_client_kx',
                                                             'offset' => '80',
                                                             'type' => '10592'
                                                           },
                                                   '11' => {
                                                             'name' => 'gnutls_process_client_crt_vrfy',
                                                             'offset' => '88',
                                                             'type' => '10592'
                                                           },
                                                   '12' => {
                                                             'name' => 'gnutls_process_server_crt_request',
                                                             'offset' => '96',
                                                             'type' => '10592'
                                                           },
                                                   '2' => {
                                                            'name' => 'gnutls_generate_client_certificate',
                                                            'offset' => '16',
                                                            'type' => '10561'
                                                          },
                                                   '3' => {
                                                            'name' => 'gnutls_generate_server_kx',
                                                            'offset' => '24',
                                                            'type' => '10561'
                                                          },
                                                   '4' => {
                                                            'name' => 'gnutls_generate_client_kx',
                                                            'offset' => '32',
                                                            'type' => '10561'
                                                          },
                                                   '5' => {
                                                            'name' => 'gnutls_generate_client_crt_vrfy',
                                                            'offset' => '40',
                                                            'type' => '10561'
                                                          },
                                                   '6' => {
                                                            'name' => 'gnutls_generate_server_crt_request',
                                                            'offset' => '48',
                                                            'type' => '10561'
                                                          },
                                                   '7' => {
                                                            'name' => 'gnutls_process_server_certificate',
                                                            'offset' => '56',
                                                            'type' => '10592'
                                                          },
                                                   '8' => {
                                                            'name' => 'gnutls_process_client_certificate',
                                                            'offset' => '64',
                                                            'type' => '10592'
                                                          },
                                                   '9' => {
                                                            'name' => 'gnutls_process_server_kx',
                                                            'offset' => '72',
                                                            'type' => '10592'
                                                          }
                                                 },
                                       'Name' => 'struct mod_auth_st_int',
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '10431' => {
                                       'BaseType' => '10262',
                                       'Name' => 'struct mod_auth_st_int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10437' => {
                                       'BaseType' => '799',
                                       'Name' => 'uint16_t[32]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '10453' => {
                                       'BaseType' => '8865',
                                       'Name' => 'anon-struct-gnutls_int.h-948[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '10469' => {
                                       'BaseType' => '8914',
                                       'Name' => 'anon-struct-gnutls_int.h-954[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '1047674' => {
                                         'BaseType' => '111797',
                                         'Name' => 'gnutls_x509_crt_t const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '10485' => {
                                       'BaseType' => '123',
                                       'Name' => 'unsigned char[36]',
                                       'Size' => '36',
                                       'Type' => 'Array'
                                     },
                          '105' => {
                                     'BaseType' => '118',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '10501' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '1002',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_buffer',
                                                            'offset' => '0',
                                                            'type' => '6164'
                                                          },
                                                   '1' => {
                                                            'name' => 'handshake_hash_buffer_prev_len',
                                                            'offset' => '32',
                                                            'type' => '70'
                                                          },
                                                   '10' => {
                                                             'name' => 'may_not_write',
                                                             'offset' => '86',
                                                             'type' => '7357'
                                                           },
                                                   '11' => {
                                                             'name' => 'read_eof',
                                                             'offset' => '87',
                                                             'type' => '7357'
                                                           },
                                                   '12' => {
                                                             'name' => 'last_alert',
                                                             'offset' => '88',
                                                             'type' => '70'
                                                           },
                                                   '13' => {
                                                             'name' => 'last_handshake_in',
                                                             'offset' => '92',
                                                             'type' => '70'
                                                           },
                                                   '14' => {
                                                             'name' => 'last_handshake_out',
                                                             'offset' => '96',
                                                             'type' => '70'
                                                           },
                                                   '15' => {
                                                             'name' => 'priorities',
                                                             'offset' => '100',
                                                             'type' => '2817'
                                                           },
                                                   '16' => {
                                                             'name' => 'resumed',
                                                             'offset' => '1188',
                                                             'type' => '7357'
                                                           },
                                                   '17' => {
                                                             'name' => 'resumption_requested',
                                                             'offset' => '1189',
                                                             'type' => '7357'
                                                           },
                                                   '18' => {
                                                             'name' => 'resumed_security_parameters',
                                                             'offset' => '1192',
                                                             'type' => '8445'
                                                           },
                                                   '19' => {
                                                             'name' => 'handshake_send_buffer',
                                                             'offset' => '1416',
                                                             'type' => '6164'
                                                           },
                                                   '2' => {
                                                            'name' => 'handshake_hash_buffer_client_kx_len',
                                                            'offset' => '36',
                                                            'type' => '130'
                                                          },
                                                   '20' => {
                                                             'name' => 'handshake_recv_buffer',
                                                             'offset' => '1448',
                                                             'type' => '10246'
                                                           },
                                                   '21' => {
                                                             'name' => 'handshake_recv_buffer_size',
                                                             'offset' => '1880',
                                                             'type' => '70'
                                                           },
                                                   '22' => {
                                                             'name' => 'record_recv_buffer',
                                                             'offset' => '1888',
                                                             'type' => '6164'
                                                           },
                                                   '23' => {
                                                             'name' => 'record_send_buffer',
                                                             'offset' => '1920',
                                                             'type' => '6164'
                                                           },
                                                   '24' => {
                                                             'name' => 'record_send_buffer_user_size',
                                                             'offset' => '1952',
                                                             'type' => '52'
                                                           },
                                                   '25' => {
                                                             'name' => 'record_flush_mode',
                                                             'offset' => '1960',
                                                             'type' => '4441'
                                                           },
                                                   '26' => {
                                                             'name' => 'record_presend_buffer',
                                                             'offset' => '1968',
                                                             'type' => '5823'
                                                           },
                                                   '27' => {
                                                             'name' => 'expire_time',
                                                             'offset' => '2000',
                                                             'type' => '130'
                                                           },
                                                   '28' => {
                                                             'name' => 'auth_struct',
                                                             'offset' => '2008',
                                                             'type' => '10431'
                                                           },
                                                   '29' => {
                                                             'name' => 'adv_version_major',
                                                             'offset' => '2016',
                                                             'type' => '788'
                                                           },
                                                   '3' => {
                                                            'name' => 'handshake_hash_buffer',
                                                            'offset' => '40',
                                                            'type' => '5823'
                                                          },
                                                   '30' => {
                                                             'name' => 'adv_version_minor',
                                                             'offset' => '2017',
                                                             'type' => '788'
                                                           },
                                                   '31' => {
                                                             'name' => 'send_cert_req',
                                                             'offset' => '2020',
                                                             'type' => '130'
                                                           },
                                                   '32' => {
                                                             'name' => 'max_handshake_data_buffer_size',
                                                             'offset' => '2024',
                                                             'type' => '52'
                                                           },
                                                   '33' => {
                                                             'name' => 'pull_timeout_func',
                                                             'offset' => '2032',
                                                             'type' => '3834'
                                                           },
                                                   '34' => {
                                                             'name' => 'pull_func',
                                                             'offset' => '2040',
                                                             'type' => '3748'
                                                           },
                                                   '35' => {
                                                             'name' => 'push_func',
                                                             'offset' => '2048',
                                                             'type' => '3791'
                                                           },
                                                   '36' => {
                                                             'name' => 'vec_push_func',
                                                             'offset' => '2056',
                                                             'type' => '3872'
                                                           },
                                                   '37' => {
                                                             'name' => 'errno_func',
                                                             'offset' => '2064',
                                                             'type' => '3926'
                                                           },
                                                   '38' => {
                                                             'name' => 'transport_recv_ptr',
                                                             'offset' => '2072',
                                                             'type' => '2660'
                                                           },
                                                   '39' => {
                                                             'name' => 'transport_send_ptr',
                                                             'offset' => '2080',
                                                             'type' => '2660'
                                                           },
                                                   '4' => {
                                                            'name' => 'resumable',
                                                            'offset' => '72',
                                                            'type' => '7357'
                                                          },
                                                   '40' => {
                                                             'name' => 'db_store_func',
                                                             'offset' => '2088',
                                                             'type' => '3415'
                                                           },
                                                   '41' => {
                                                             'name' => 'db_retrieve_func',
                                                             'offset' => '2096',
                                                             'type' => '3496'
                                                           },
                                                   '42' => {
                                                             'name' => 'db_remove_func',
                                                             'offset' => '2104',
                                                             'type' => '3458'
                                                           },
                                                   '43' => {
                                                             'name' => 'db_ptr',
                                                             'offset' => '2112',
                                                             'type' => '184'
                                                           },
                                                   '44' => {
                                                             'name' => 'user_hello_func',
                                                             'offset' => '2120',
                                                             'type' => '3598'
                                                           },
                                                   '45' => {
                                                             'name' => 'h_hook',
                                                             'offset' => '2128',
                                                             'type' => '3534'
                                                           },
                                                   '46' => {
                                                             'name' => 'h_type',
                                                             'offset' => '2136',
                                                             'type' => '130'
                                                           },
                                                   '47' => {
                                                             'name' => 'h_post',
                                                             'offset' => '2140',
                                                             'type' => '236'
                                                           },
                                                   '48' => {
                                                             'name' => 'selected_cert_list',
                                                             'offset' => '2144',
                                                             'type' => '4156'
                                                           },
                                                   '49' => {
                                                             'name' => 'selected_cert_list_length',
                                                             'offset' => '2152',
                                                             'type' => '236'
                                                           },
                                                   '5' => {
                                                            'name' => 'ticket_sent',
                                                            'offset' => '73',
                                                            'type' => '7357'
                                                          },
                                                   '50' => {
                                                             'name' => 'selected_key',
                                                             'offset' => '2160',
                                                             'type' => '3654'
                                                           },
                                                   '51' => {
                                                             'name' => 'selected_need_free',
                                                             'offset' => '2168',
                                                             'type' => '7357'
                                                           },
                                                   '52' => {
                                                             'name' => 'extensions_sent',
                                                             'offset' => '2170',
                                                             'type' => '10437'
                                                           },
                                                   '53' => {
                                                             'name' => 'extensions_sent_size',
                                                             'offset' => '2234',
                                                             'type' => '799'
                                                           },
                                                   '54' => {
                                                             'name' => 'pgp_fingerprint',
                                                             'offset' => '2236',
                                                             'type' => '7357'
                                                           },
                                                   '55' => {
                                                             'name' => 'default_record_version',
                                                             'offset' => '2237',
                                                             'type' => '7034'
                                                           },
                                                   '56' => {
                                                             'name' => 'default_hello_version',
                                                             'offset' => '2239',
                                                             'type' => '7034'
                                                           },
                                                   '57' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '2248',
                                                             'type' => '184'
                                                           },
                                                   '58' => {
                                                             'name' => 'enable_private',
                                                             'offset' => '2256',
                                                             'type' => '7357'
                                                           },
                                                   '59' => {
                                                             'name' => 'direction',
                                                             'offset' => '2257',
                                                             'type' => '7357'
                                                           },
                                                   '6' => {
                                                            'name' => 'handshake_final_state',
                                                            'offset' => '76',
                                                            'type' => '5720'
                                                          },
                                                   '60' => {
                                                             'name' => 'openpgp_recv_key_func',
                                                             'offset' => '2264',
                                                             'type' => '4043'
                                                           },
                                                   '61' => {
                                                             'name' => 'ignore_rdn_sequence',
                                                             'offset' => '2272',
                                                             'type' => '7357'
                                                           },
                                                   '62' => {
                                                             'name' => 'rsa_pms_version',
                                                             'offset' => '2273',
                                                             'type' => '7034'
                                                           },
                                                   '63' => {
                                                             'name' => 'params',
                                                             'offset' => '2280',
                                                             'type' => '8623'
                                                           },
                                                   '64' => {
                                                             'name' => 'errnum',
                                                             'offset' => '2296',
                                                             'type' => '70'
                                                           },
                                                   '65' => {
                                                             'name' => 'srp_prime_bits',
                                                             'offset' => '2300',
                                                             'type' => '799'
                                                           },
                                                   '66' => {
                                                             'name' => 'initial_negotiation_completed',
                                                             'offset' => '2302',
                                                             'type' => '7357'
                                                           },
                                                   '67' => {
                                                             'name' => 'extension_int_data',
                                                             'offset' => '2304',
                                                             'type' => '10453'
                                                           },
                                                   '68' => {
                                                             'name' => 'resumed_extension_int_data',
                                                             'offset' => '3072',
                                                             'type' => '10469'
                                                           },
                                                   '69' => {
                                                             'name' => 'transport',
                                                             'offset' => '3840',
                                                             'type' => '4401'
                                                           },
                                                   '7' => {
                                                            'name' => 'handshake_state',
                                                            'offset' => '80',
                                                            'type' => '5720'
                                                          },
                                                   '70' => {
                                                             'name' => 'dtls',
                                                             'offset' => '3848',
                                                             'type' => '8853'
                                                           },
                                                   '71' => {
                                                             'name' => 'handshake_large_loops',
                                                             'offset' => '3968',
                                                             'type' => '130'
                                                           },
                                                   '72' => {
                                                             'name' => 'handshake_in_progress',
                                                             'offset' => '3972',
                                                             'type' => '7357'
                                                           },
                                                   '73' => {
                                                             'name' => 'premaster_set',
                                                             'offset' => '3973',
                                                             'type' => '7357'
                                                           },
                                                   '74' => {
                                                             'name' => 'cb_tls_unique_len',
                                                             'offset' => '3976',
                                                             'type' => '130'
                                                           },
                                                   '75' => {
                                                             'name' => 'cb_tls_unique',
                                                             'offset' => '3980',
                                                             'type' => '10485'
                                                           },
                                                   '76' => {
                                                             'name' => 'handshake_endtime',
                                                             'offset' => '4016',
                                                             'type' => '225'
                                                           },
                                                   '77' => {
                                                             'name' => 'handshake_timeout_ms',
                                                             'offset' => '4024',
                                                             'type' => '130'
                                                           },
                                                   '78' => {
                                                             'name' => 'record_timeout_ms',
                                                             'offset' => '4028',
                                                             'type' => '130'
                                                           },
                                                   '79' => {
                                                             'name' => 'hb_local_data',
                                                             'offset' => '4032',
                                                             'type' => '5823'
                                                           },
                                                   '8' => {
                                                            'name' => 'invalid_connection',
                                                            'offset' => '84',
                                                            'type' => '7357'
                                                          },
                                                   '80' => {
                                                             'name' => 'hb_remote_data',
                                                             'offset' => '4064',
                                                             'type' => '5823'
                                                           },
                                                   '81' => {
                                                             'name' => 'hb_ping_start',
                                                             'offset' => '4096',
                                                             'type' => '247'
                                                           },
                                                   '82' => {
                                                             'name' => 'hb_ping_sent',
                                                             'offset' => '4112',
                                                             'type' => '247'
                                                           },
                                                   '83' => {
                                                             'name' => 'hb_actual_retrans_timeout_ms',
                                                             'offset' => '4128',
                                                             'type' => '130'
                                                           },
                                                   '84' => {
                                                             'name' => 'hb_retrans_timeout_ms',
                                                             'offset' => '4132',
                                                             'type' => '130'
                                                           },
                                                   '85' => {
                                                             'name' => 'hb_total_timeout_ms',
                                                             'offset' => '4136',
                                                             'type' => '130'
                                                           },
                                                   '86' => {
                                                             'name' => 'ocsp_check_ok',
                                                             'offset' => '4140',
                                                             'type' => '7357'
                                                           },
                                                   '87' => {
                                                             'name' => 'hb_state',
                                                             'offset' => '4144',
                                                             'type' => '5766'
                                                           },
                                                   '88' => {
                                                             'name' => 'recv_state',
                                                             'offset' => '4148',
                                                             'type' => '5806'
                                                           },
                                                   '89' => {
                                                             'name' => 'sc_random_set',
                                                             'offset' => '4152',
                                                             'type' => '7357'
                                                           },
                                                   '9' => {
                                                            'name' => 'may_not_read',
                                                            'offset' => '85',
                                                            'type' => '7357'
                                                          },
                                                   '90' => {
                                                             'name' => 'no_replay_protection',
                                                             'offset' => '4153',
                                                             'type' => '7357'
                                                           },
                                                   '91' => {
                                                             'name' => 'try_ext_master_secret',
                                                             'offset' => '4154',
                                                             'type' => '7357'
                                                           }
                                                 },
                                       'Name' => 'struct internals_st',
                                       'Size' => '4160',
                                       'Type' => 'Struct'
                                     },
                          '10513' => {
                                       'BaseType' => '10529',
                                       'Name' => 'record_parameters_st*[16]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '10529' => {
                                       'BaseType' => '6690',
                                       'Name' => 'record_parameters_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10555' => {
                                       'BaseType' => '5823',
                                       'Name' => 'gnutls_buffer_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10561' => {
                                       'Name' => 'int(*)(gnutls_session_t, gnutls_buffer_st*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2672'
                                                           },
                                                    '1' => {
                                                             'type' => '10555'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10592' => {
                                       'Name' => 'int(*)(gnutls_session_t, uint8_t*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2672'
                                                           },
                                                    '1' => {
                                                             'type' => '5817'
                                                           },
                                                    '2' => {
                                                             'type' => '52'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1062767' => {
                                         'BaseType' => '1062778',
                                         'Header' => 'pkcs12.h',
                                         'Line' => '40',
                                         'Name' => 'gnutls_pkcs12_bag_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1062778' => {
                                         'BaseType' => '1062784',
                                         'Name' => 'struct gnutls_pkcs12_bag_int*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1062784' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '326',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'element',
                                                              'offset' => '0',
                                                              'type' => '1062968'
                                                            },
                                                     '1' => {
                                                              'name' => 'bag_elements',
                                                              'offset' => '1536',
                                                              'type' => '70'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_pkcs12_bag_int',
                                         'Size' => '1544',
                                         'Type' => 'Struct'
                                       },
                          '1062826' => {
                                         'Header' => 'pkcs12.h',
                                         'Line' => '97',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_BAG_EMPTY',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_BAG_PKCS8_ENCRYPTED_KEY',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_BAG_PKCS8_KEY',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_BAG_CERTIFICATE',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_BAG_CRL',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'GNUTLS_BAG_SECRET',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'GNUTLS_BAG_ENCRYPTED',
                                                              'value' => '10'
                                                            },
                                                     '7' => {
                                                              'name' => 'GNUTLS_BAG_UNKNOWN',
                                                              'value' => '20'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs12_bag_type_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1062891' => {
                                         'BaseType' => '1062826',
                                         'Header' => 'pkcs12.h',
                                         'Line' => '110',
                                         'Name' => 'gnutls_pkcs12_bag_type_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1062902' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '319',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'data',
                                                              'offset' => '0',
                                                              'type' => '3192'
                                                            },
                                                     '1' => {
                                                              'name' => 'type',
                                                              'offset' => '16',
                                                              'type' => '1062891'
                                                            },
                                                     '2' => {
                                                              'name' => 'local_key_id',
                                                              'offset' => '24',
                                                              'type' => '3192'
                                                            },
                                                     '3' => {
                                                              'name' => 'friendly_name',
                                                              'offset' => '40',
                                                              'type' => '208'
                                                            }
                                                   },
                                         'Name' => 'struct bag_element',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1062968' => {
                                         'BaseType' => '1062902',
                                         'Name' => 'struct bag_element[32]',
                                         'Size' => '1536',
                                         'Type' => 'Array'
                                       },
                          '1064648' => {
                                         'BaseType' => '554659',
                                         'Name' => 'gnutls_pkcs12_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '107847' => {
                                        'BaseType' => '111',
                                        'Name' => 'char[32]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '1081968' => {
                                         'BaseType' => '1062767',
                                         'Name' => 'gnutls_pkcs12_bag_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1094060' => {
                                         'BaseType' => '1094072',
                                         'Header' => 'x509.h',
                                         'Line' => '757',
                                         'Name' => 'gnutls_pkcs7_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1094072' => {
                                         'BaseType' => '1094078',
                                         'Name' => 'struct gnutls_pkcs7_int*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1094078' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '83',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'pkcs7',
                                                              'offset' => '0',
                                                              'type' => '117419'
                                                            },
                                                     '1' => {
                                                              'name' => 'expanded',
                                                              'offset' => '8',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_pkcs7_int',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '109429' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '205',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_PARAMS_RSA_EXPORT',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_PARAMS_DH',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'GNUTLS_PARAMS_ECDH',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_params_type_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '10964' => {
                                       'BaseType' => '3240',
                                       'Name' => 'gnutls_range_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '109671' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '293',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_DIG_UNKNOWN',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_DIG_NULL',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'GNUTLS_DIG_MD5',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'GNUTLS_DIG_SHA1',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'GNUTLS_DIG_RMD160',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'GNUTLS_DIG_MD2',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'GNUTLS_DIG_SHA256',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'GNUTLS_DIG_SHA384',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'GNUTLS_DIG_SHA512',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'GNUTLS_DIG_SHA224',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_digest_algorithm_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '1096973' => {
                                         'BaseType' => '1094060',
                                         'Name' => 'gnutls_pkcs7_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '110737' => {
                                        'BaseType' => '110749',
                                        'Header' => 'gnutls.h',
                                        'Line' => '779',
                                        'Name' => 'gnutls_rsa_params_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '110749' => {
                                        'BaseType' => '110755',
                                        'Name' => 'struct gnutls_x509_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110755' => {
                                        'Header' => 'x509_int.h',
                                        'Line' => '95',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'params',
                                                             'offset' => '0',
                                                             'type' => '5512'
                                                           },
                                                    '1' => {
                                                             'name' => 'pk_algorithm',
                                                             'offset' => '144',
                                                             'type' => '2348'
                                                           },
                                                    '2' => {
                                                             'name' => 'expanded',
                                                             'offset' => '148',
                                                             'type' => '130'
                                                           },
                                                    '3' => {
                                                             'name' => 'key',
                                                             'offset' => '152',
                                                             'type' => '117419'
                                                           },
                                                    '4' => {
                                                             'name' => 'pin',
                                                             'offset' => '160',
                                                             'type' => '116316'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_privkey_int',
                                        'Size' => '176',
                                        'Type' => 'Struct'
                                      },
                          '111' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '111215' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '792',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dh',
                                                             'offset' => '0',
                                                             'type' => '2759'
                                                           },
                                                    '1' => {
                                                             'name' => 'rsa_export',
                                                             'offset' => '0',
                                                             'type' => '110737'
                                                           }
                                                  },
                                        'Name' => 'union params',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '111252' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '790',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '109429'
                                                           },
                                                    '1' => {
                                                             'name' => 'params',
                                                             'offset' => '8',
                                                             'type' => '111215'
                                                           },
                                                    '2' => {
                                                             'name' => 'deinit',
                                                             'offset' => '16',
                                                             'type' => '70'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_params_st',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '111305' => {
                                        'BaseType' => '111252',
                                        'Header' => 'gnutls.h',
                                        'Line' => '797',
                                        'Name' => 'gnutls_params_st',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '111317' => {
                                        'BaseType' => '111329',
                                        'Header' => 'gnutls.h',
                                        'Line' => '799',
                                        'Name' => 'gnutls_params_function',
                                        'Type' => 'Typedef'
                                      },
                          '111329' => {
                                        'Name' => 'int()(gnutls_session_t, gnutls_params_type_t, gnutls_params_st*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2672'
                                                            },
                                                     '1' => {
                                                              'type' => '109429'
                                                            },
                                                     '2' => {
                                                              'type' => '111354'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Type' => 'Func'
                                      },
                          '111354' => {
                                        'BaseType' => '111305',
                                        'Name' => 'gnutls_params_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111724' => {
                                        'Name' => 'int()(gnutls_session_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2672'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Type' => 'Func'
                                      },
                          '111762' => {
                                        'BaseType' => '3654',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1307',
                                        'Name' => 'gnutls_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '111785' => {
                                        'BaseType' => '110749',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1310',
                                        'Name' => 'gnutls_x509_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '111797' => {
                                        'BaseType' => '111809',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1316',
                                        'Name' => 'gnutls_x509_crt_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '111809' => {
                                        'BaseType' => '111815',
                                        'Name' => 'struct gnutls_x509_crt_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111815' => {
                                        'Header' => 'x509_int.h',
                                        'Line' => '64',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cert',
                                                             'offset' => '0',
                                                             'type' => '117419'
                                                           },
                                                    '1' => {
                                                             'name' => 'use_extensions',
                                                             'offset' => '8',
                                                             'type' => '70'
                                                           },
                                                    '2' => {
                                                             'name' => 'expanded',
                                                             'offset' => '12',
                                                             'type' => '70'
                                                           },
                                                    '3' => {
                                                             'name' => 'raw_dn',
                                                             'offset' => '16',
                                                             'type' => '3192'
                                                           },
                                                    '4' => {
                                                             'name' => 'raw_issuer_dn',
                                                             'offset' => '32',
                                                             'type' => '3192'
                                                           },
                                                    '5' => {
                                                             'name' => 'raw_spki',
                                                             'offset' => '48',
                                                             'type' => '3192'
                                                           },
                                                    '6' => {
                                                             'name' => 'der',
                                                             'offset' => '64',
                                                             'type' => '3192'
                                                           },
                                                    '7' => {
                                                             'name' => 'pin',
                                                             'offset' => '80',
                                                             'type' => '116316'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_crt_int',
                                        'Size' => '96',
                                        'Type' => 'Struct'
                                      },
                          '111924' => {
                                        'BaseType' => '111936',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1322',
                                        'Name' => 'gnutls_openpgp_keyring_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '111936' => {
                                        'BaseType' => '111942',
                                        'Name' => 'struct gnutls_openpgp_keyring_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111942' => {
                                        'Header' => 'openpgp_int.h',
                                        'Line' => '54',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'db',
                                                             'offset' => '0',
                                                             'type' => '120421'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_openpgp_keyring_int',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '111966' => {
                                        'BaseType' => '111978',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1329',
                                        'Name' => 'gnutls_certificate_credentials_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '111978' => {
                                        'BaseType' => '111984',
                                        'Name' => 'struct gnutls_certificate_credentials_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '111984' => {
                                        'Header' => 'cert.h',
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dh_params',
                                                             'offset' => '0',
                                                             'type' => '2759'
                                                           },
                                                    '1' => {
                                                             'name' => 'params_func',
                                                             'offset' => '8',
                                                             'type' => '120581'
                                                           },
                                                    '10' => {
                                                              'name' => 'get_cert_callback',
                                                              'offset' => '72',
                                                              'type' => '120593'
                                                            },
                                                    '11' => {
                                                              'name' => 'get_cert_callback2',
                                                              'offset' => '80',
                                                              'type' => '120599'
                                                            },
                                                    '12' => {
                                                              'name' => 'verify_callback',
                                                              'offset' => '88',
                                                              'type' => '120605'
                                                            },
                                                    '13' => {
                                                              'name' => 'pin',
                                                              'offset' => '96',
                                                              'type' => '116316'
                                                            },
                                                    '14' => {
                                                              'name' => 'pin_tmp',
                                                              'offset' => '112',
                                                              'type' => '107847'
                                                            },
                                                    '15' => {
                                                              'name' => 'ocsp_func',
                                                              'offset' => '144',
                                                              'type' => '112213'
                                                            },
                                                    '16' => {
                                                              'name' => 'ocsp_func_ptr',
                                                              'offset' => '152',
                                                              'type' => '184'
                                                            },
                                                    '17' => {
                                                              'name' => 'ocsp_response_file',
                                                              'offset' => '160',
                                                              'type' => '208'
                                                            },
                                                    '2' => {
                                                             'name' => 'certs',
                                                             'offset' => '16',
                                                             'type' => '120587'
                                                           },
                                                    '3' => {
                                                             'name' => 'ncerts',
                                                             'offset' => '24',
                                                             'type' => '130'
                                                           },
                                                    '4' => {
                                                             'name' => 'pkey',
                                                             'offset' => '32',
                                                             'type' => '113534'
                                                           },
                                                    '5' => {
                                                             'name' => 'keyring',
                                                             'offset' => '40',
                                                             'type' => '111924'
                                                           },
                                                    '6' => {
                                                             'name' => 'tlist',
                                                             'offset' => '48',
                                                             'type' => '113318'
                                                           },
                                                    '7' => {
                                                             'name' => 'verify_flags',
                                                             'offset' => '56',
                                                             'type' => '130'
                                                           },
                                                    '8' => {
                                                             'name' => 'verify_depth',
                                                             'offset' => '60',
                                                             'type' => '130'
                                                           },
                                                    '9' => {
                                                             'name' => 'verify_bits',
                                                             'offset' => '64',
                                                             'type' => '130'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_certificate_credentials_st',
                                        'Size' => '168',
                                        'Type' => 'Struct'
                                      },
                          '112213' => {
                                        'BaseType' => '112225',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1494',
                                        'Name' => 'gnutls_status_request_ocsp_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '112225' => {
                                        'Name' => 'int(*)(gnutls_session_t, void*, gnutls_datum_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2672'
                                                            },
                                                     '1' => {
                                                              'type' => '184'
                                                            },
                                                     '2' => {
                                                              'type' => '3665'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '112649' => {
                                        'BaseType' => '112661',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1890',
                                        'Name' => 'gnutls_openpgp_crt_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '112661' => {
                                        'BaseType' => '112667',
                                        'Name' => 'struct gnutls_openpgp_crt_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112667' => {
                                        'Header' => 'openpgp_int.h',
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'knode',
                                                             'offset' => '0',
                                                             'type' => '120399'
                                                           },
                                                    '1' => {
                                                             'name' => 'preferred_keyid',
                                                             'offset' => '8',
                                                             'type' => '120443'
                                                           },
                                                    '2' => {
                                                             'name' => 'preferred_set',
                                                             'offset' => '16',
                                                             'type' => '70'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_openpgp_crt_int',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '112716' => {
                                        'BaseType' => '112728',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1893',
                                        'Name' => 'gnutls_openpgp_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '112728' => {
                                        'BaseType' => '112734',
                                        'Name' => 'struct gnutls_openpgp_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112734' => {
                                        'Header' => 'openpgp_int.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'knode',
                                                             'offset' => '0',
                                                             'type' => '120399'
                                                           },
                                                    '1' => {
                                                             'name' => 'preferred_keyid',
                                                             'offset' => '8',
                                                             'type' => '120443'
                                                           },
                                                    '2' => {
                                                             'name' => 'preferred_set',
                                                             'offset' => '16',
                                                             'type' => '70'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_openpgp_privkey_int',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '112783' => {
                                        'BaseType' => '112795',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1896',
                                        'Name' => 'gnutls_pkcs11_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '112795' => {
                                        'BaseType' => '112801',
                                        'Name' => 'struct gnutls_pkcs11_privkey_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112801' => {
                                        'Line' => '64',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pk_algorithm',
                                                             'offset' => '0',
                                                             'type' => '2348'
                                                           },
                                                    '1' => {
                                                             'name' => 'flags',
                                                             'offset' => '4',
                                                             'type' => '130'
                                                           },
                                                    '2' => {
                                                             'name' => 'uinfo',
                                                             'offset' => '8',
                                                             'type' => '637806'
                                                           },
                                                    '3' => {
                                                             'name' => 'url',
                                                             'offset' => '16',
                                                             'type' => '208'
                                                           },
                                                    '4' => {
                                                             'name' => 'sinfo',
                                                             'offset' => '24',
                                                             'type' => '761053'
                                                           },
                                                    '5' => {
                                                             'name' => 'ref',
                                                             'offset' => '376',
                                                             'type' => '757625'
                                                           },
                                                    '6' => {
                                                             'name' => 'reauth',
                                                             'offset' => '384',
                                                             'type' => '130'
                                                           },
                                                    '7' => {
                                                             'name' => 'pin',
                                                             'offset' => '392',
                                                             'type' => '116316'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_pkcs11_privkey_st',
                                        'Size' => '408',
                                        'Source' => 'pkcs11_privkey.c',
                                        'Type' => 'Struct'
                                      },
                          '112844' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '1912',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_PRIVKEY_X509',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_PRIVKEY_OPENPGP',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'GNUTLS_PRIVKEY_PKCS11',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'GNUTLS_PRIVKEY_EXT',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_privkey_type_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '112856' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '1918',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x509',
                                                             'offset' => '0',
                                                             'type' => '112890'
                                                           },
                                                    '1' => {
                                                             'name' => 'pgp',
                                                             'offset' => '0',
                                                             'type' => '112649'
                                                           }
                                                  },
                                        'Name' => 'anon-union-gnutls.h-1918',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '112890' => {
                                        'BaseType' => '111797',
                                        'Name' => 'gnutls_x509_crt_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112896' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '1924',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x509',
                                                             'offset' => '0',
                                                             'type' => '111785'
                                                           },
                                                    '1' => {
                                                             'name' => 'pgp',
                                                             'offset' => '0',
                                                             'type' => '112716'
                                                           },
                                                    '2' => {
                                                             'name' => 'pkcs11',
                                                             'offset' => '0',
                                                             'type' => '112783'
                                                           }
                                                  },
                                        'Name' => 'anon-union-gnutls.h-1924',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '1129064' => {
                                         'BaseType' => '1695',
                                         'Name' => 'gnutls_cipher_algorithm_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '112942' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '1914',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cert_type',
                                                             'offset' => '0',
                                                             'type' => '2292'
                                                           },
                                                    '1' => {
                                                             'name' => 'key_type',
                                                             'offset' => '4',
                                                             'type' => '112844'
                                                           },
                                                    '2' => {
                                                             'name' => 'cert',
                                                             'offset' => '8',
                                                             'type' => '112856'
                                                           },
                                                    '3' => {
                                                             'name' => 'ncerts',
                                                             'offset' => '16',
                                                             'type' => '130'
                                                           },
                                                    '4' => {
                                                             'name' => 'key',
                                                             'offset' => '24',
                                                             'type' => '112896'
                                                           },
                                                    '5' => {
                                                             'name' => 'deinit_all',
                                                             'offset' => '32',
                                                             'type' => '130'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_retr2_st',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '113034' => {
                                        'BaseType' => '112942',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1931',
                                        'Name' => 'gnutls_retr2_st',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '113046' => {
                                        'BaseType' => '113058',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1965',
                                        'Name' => 'gnutls_certificate_retrieve_function',
                                        'Type' => 'Typedef'
                                      },
                          '113058' => {
                                        'Name' => 'int()(gnutls_session_t, gnutls_datum_t const*, int, gnutls_pk_algorithm_t const*, int, gnutls_retr2_st*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2672'
                                                            },
                                                     '1' => {
                                                              'type' => '3587'
                                                            },
                                                     '2' => {
                                                              'type' => '70'
                                                            },
                                                     '3' => {
                                                              'type' => '113098'
                                                            },
                                                     '4' => {
                                                              'type' => '70'
                                                            },
                                                     '5' => {
                                                              'type' => '113109'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Type' => 'Func'
                                      },
                          '113098' => {
                                        'BaseType' => '113104',
                                        'Name' => 'gnutls_pk_algorithm_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '113104' => {
                                        'BaseType' => '2348',
                                        'Name' => 'gnutls_pk_algorithm_t const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '113109' => {
                                        'BaseType' => '113034',
                                        'Name' => 'gnutls_retr2_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '113115' => {
                                        'BaseType' => '111724',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1984',
                                        'Name' => 'gnutls_certificate_verify_function',
                                        'Type' => 'Typedef'
                                      },
                          '113127' => {
                                        'BaseType' => '113139',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2223',
                                        'Name' => 'gnutls_pin_callback_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '113139' => {
                                        'Name' => 'int(*)(void*, int, char const*, char const*, unsigned int, char*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '184'
                                                            },
                                                     '1' => {
                                                              'type' => '70'
                                                            },
                                                     '2' => {
                                                              'type' => '105'
                                                            },
                                                     '3' => {
                                                              'type' => '105'
                                                            },
                                                     '4' => {
                                                              'type' => '130'
                                                            },
                                                     '5' => {
                                                              'type' => '208'
                                                            },
                                                     '6' => {
                                                              'type' => '52'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '113318' => {
                                        'BaseType' => '113330',
                                        'Header' => 'x509.h',
                                        'Line' => '1255',
                                        'Name' => 'gnutls_x509_trust_list_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '113330' => {
                                        'BaseType' => '113336',
                                        'Name' => 'struct gnutls_x509_trust_list_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '113336' => {
                                        'Header' => 'verify-high.h',
                                        'Line' => '26',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'size',
                                                             'offset' => '0',
                                                             'type' => '130'
                                                           },
                                                    '1' => {
                                                             'name' => 'node',
                                                             'offset' => '8',
                                                             'type' => '378710'
                                                           },
                                                    '2' => {
                                                             'name' => 'x509_rdn_sequence',
                                                             'offset' => '16',
                                                             'type' => '3192'
                                                           },
                                                    '3' => {
                                                             'name' => 'blacklisted',
                                                             'offset' => '32',
                                                             'type' => '112890'
                                                           },
                                                    '4' => {
                                                             'name' => 'blacklisted_size',
                                                             'offset' => '40',
                                                             'type' => '130'
                                                           },
                                                    '5' => {
                                                             'name' => 'keep_certs',
                                                             'offset' => '48',
                                                             'type' => '112890'
                                                           },
                                                    '6' => {
                                                             'name' => 'keep_certs_size',
                                                             'offset' => '56',
                                                             'type' => '130'
                                                           },
                                                    '7' => {
                                                             'name' => 'pkcs11_token',
                                                             'offset' => '64',
                                                             'type' => '208'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_trust_list_st',
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '1133750' => {
                                         'BaseType' => '123',
                                         'Name' => 'unsigned char[2]',
                                         'Size' => '2',
                                         'Type' => 'Array'
                                       },
                          '113454' => {
                                        'BaseType' => '113466',
                                        'Header' => 'abstract.h',
                                        'Line' => '504',
                                        'Name' => 'gnutls_certificate_retrieve_function2',
                                        'Type' => 'Typedef'
                                      },
                          '113466' => {
                                        'Name' => 'int()(gnutls_session_t, gnutls_datum_t const*, int, gnutls_pk_algorithm_t const*, int, gnutls_pcert_st**, unsigned int*, gnutls_privkey_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2672'
                                                            },
                                                     '1' => {
                                                              'type' => '3587'
                                                            },
                                                     '2' => {
                                                              'type' => '70'
                                                            },
                                                     '3' => {
                                                              'type' => '113098'
                                                            },
                                                     '4' => {
                                                              'type' => '70'
                                                            },
                                                     '5' => {
                                                              'type' => '113516'
                                                            },
                                                     '6' => {
                                                              'type' => '17947'
                                                            },
                                                     '7' => {
                                                              'type' => '113534'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Type' => 'Func'
                                      },
                          '113516' => {
                                        'BaseType' => '4156',
                                        'Name' => 'gnutls_pcert_st**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '113534' => {
                                        'BaseType' => '111762',
                                        'Name' => 'gnutls_privkey_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '116316' => {
                                        'Header' => 'gnutls_int.h',
                                        'Line' => '424',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cb',
                                                             'offset' => '0',
                                                             'type' => '113127'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '184'
                                                           }
                                                  },
                                        'Name' => 'struct pin_info_st',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '1165937' => {
                                         'BaseType' => '1165949',
                                         'Header' => 'x509.h',
                                         'Line' => '1312',
                                         'Name' => 'gnutls_verify_output_function',
                                         'Type' => 'Typedef'
                                       },
                          '1165949' => {
                                         'Name' => 'int()(gnutls_x509_crt_t, gnutls_x509_crt_t, gnutls_x509_crl_t, unsigned int)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '111797'
                                                             },
                                                      '1' => {
                                                               'type' => '111797'
                                                             },
                                                      '2' => {
                                                               'type' => '545129'
                                                             },
                                                      '3' => {
                                                               'type' => '130'
                                                             }
                                                    },
                                         'Return' => '70',
                                         'Type' => 'Func'
                                       },
                          '1170871' => {
                                         'BaseType' => '1047674',
                                         'Name' => 'gnutls_x509_crt_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '117403' => {
                                        'BaseType' => '117414',
                                        'Header' => 'libtasn1.h',
                                        'Line' => '128',
                                        'Name' => 'asn1_node_st',
                                        'Type' => 'Typedef'
                                      },
                          '117414' => {
                                        'Name' => 'struct asn1_node_st',
                                        'Type' => 'Struct'
                                      },
                          '117419' => {
                                        'BaseType' => '117430',
                                        'Header' => 'libtasn1.h',
                                        'Line' => '130',
                                        'Name' => 'asn1_node',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '117430' => {
                                        'BaseType' => '117403',
                                        'Name' => 'asn1_node_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1178041' => {
                                         'BaseType' => '1165937',
                                         'Name' => 'gnutls_verify_output_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '118' => {
                                     'BaseType' => '111',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1180076' => {
                                         'BaseType' => '942559',
                                         'Name' => 'gnutls_x509_crl_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1185429' => {
                                         'Header' => 'x509.h',
                                         'Line' => '600',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'oid',
                                                              'offset' => '0',
                                                              'type' => '3192'
                                                            },
                                                     '1' => {
                                                              'name' => 'value',
                                                              'offset' => '16',
                                                              'type' => '3192'
                                                            },
                                                     '2' => {
                                                              'name' => 'value_tag',
                                                              'offset' => '32',
                                                              'type' => '63'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_ava_st',
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '1185482' => {
                                         'BaseType' => '1185429',
                                         'Header' => 'x509.h',
                                         'Line' => '604',
                                         'Name' => 'gnutls_x509_ava_st',
                                         'Size' => '40',
                                         'Type' => 'Typedef'
                                       },
                          '1201578' => {
                                         'BaseType' => '1019035',
                                         'Name' => 'struct gnutls_x509_policy_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '120399' => {
                                        'BaseType' => '120410',
                                        'Header' => 'opencdk.h',
                                        'Line' => '76',
                                        'Name' => 'cdk_kbnode_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '120410' => {
                                        'BaseType' => '120416',
                                        'Name' => 'struct cdk_kbnode_s*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120416' => {
                                        'Header' => 'packet.h',
                                        'Line' => '26',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '120410'
                                                           },
                                                    '1' => {
                                                             'name' => 'pkt',
                                                             'offset' => '8',
                                                             'type' => '1980536'
                                                           },
                                                    '2' => {
                                                             'bitfield' => '1',
                                                             'name' => 'is_deleted',
                                                             'offset' => '16',
                                                             'type' => '130'
                                                           },
                                                    '3' => {
                                                             'bitfield' => '1',
                                                             'name' => 'is_cloned',
                                                             'offset' => '16',
                                                             'type' => '130'
                                                           }
                                                  },
                                        'Name' => 'struct cdk_kbnode_s',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '120421' => {
                                        'BaseType' => '120432',
                                        'Header' => 'opencdk.h',
                                        'Line' => '80',
                                        'Name' => 'cdk_keydb_hd_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '120432' => {
                                        'BaseType' => '120438',
                                        'Name' => 'struct cdk_keydb_hd_s*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120438' => {
                                        'Header' => 'keydb.h',
                                        'Line' => '56',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '70'
                                                           },
                                                    '1' => {
                                                             'name' => 'fp_ref',
                                                             'offset' => '4',
                                                             'type' => '70'
                                                           },
                                                    '2' => {
                                                             'name' => 'fp',
                                                             'offset' => '8',
                                                             'type' => '1978031'
                                                           },
                                                    '3' => {
                                                             'name' => 'name',
                                                             'offset' => '16',
                                                             'type' => '208'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '1',
                                                             'name' => 'secret',
                                                             'offset' => '24',
                                                             'type' => '130'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '1',
                                                             'name' => 'isopen',
                                                             'offset' => '24',
                                                             'type' => '130'
                                                           },
                                                    '6' => {
                                                             'name' => 'stats',
                                                             'offset' => '32',
                                                             'type' => '2109482'
                                                           }
                                                  },
                                        'Name' => 'struct cdk_keydb_hd_s',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '120443' => {
                                        'BaseType' => '788',
                                        'Name' => 'uint8_t[8]',
                                        'Size' => '8',
                                        'Type' => 'Array'
                                      },
                          '120459' => {
                                        'Header' => 'gnutls_str_array.h',
                                        'Line' => '33',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'str',
                                                             'offset' => '0',
                                                             'type' => '208'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '130'
                                                           },
                                                    '2' => {
                                                             'name' => 'next',
                                                             'offset' => '16',
                                                             'type' => '120508'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_str_array_st',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '120508' => {
                                        'BaseType' => '120459',
                                        'Name' => 'struct gnutls_str_array_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120514' => {
                                        'BaseType' => '120508',
                                        'Header' => 'gnutls_str_array.h',
                                        'Line' => '37',
                                        'Name' => 'gnutls_str_array_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '1205392' => {
                                         'BaseType' => '1185482',
                                         'Name' => 'gnutls_x509_ava_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '120570' => {
                                        'Header' => 'cert.h',
                                        'Line' => '37',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cert_list',
                                                             'offset' => '0',
                                                             'type' => '4156'
                                                           },
                                                    '1' => {
                                                             'name' => 'cert_list_length',
                                                             'offset' => '8',
                                                             'type' => '130'
                                                           },
                                                    '2' => {
                                                             'name' => 'names',
                                                             'offset' => '16',
                                                             'type' => '120514'
                                                           }
                                                  },
                                        'Name' => 'struct certs_st',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '120581' => {
                                        'BaseType' => '111317',
                                        'Name' => 'gnutls_params_function*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120587' => {
                                        'BaseType' => '120570',
                                        'Name' => 'certs_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120593' => {
                                        'BaseType' => '113046',
                                        'Name' => 'gnutls_certificate_retrieve_function*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120599' => {
                                        'BaseType' => '113454',
                                        'Name' => 'gnutls_certificate_retrieve_function2*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120605' => {
                                        'BaseType' => '113115',
                                        'Name' => 'gnutls_certificate_verify_function*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1207297' => {
                                         'BaseType' => '109671',
                                         'Name' => 'gnutls_digest_algorithm_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '123' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1236541' => {
                                         'BaseType' => '1236547',
                                         'Name' => 'struct gnutls_x509_policy_st const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1236547' => {
                                         'BaseType' => '1019035',
                                         'Name' => 'struct gnutls_x509_policy_st const',
                                         'Size' => '208',
                                         'Type' => 'Const'
                                       },
                          '1240096' => {
                                         'BaseType' => '1020575',
                                         'Header' => 'x509_int.h',
                                         'Line' => '443',
                                         'Name' => 'name_constraints_node_st',
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1240667' => {
                                         'BaseType' => '1240096',
                                         'Name' => 'name_constraints_node_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1242914' => {
                                         'BaseType' => '1018880',
                                         'Name' => 'gnutls_x509_name_constraints_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '12472' => {
                                       'BaseType' => '12478',
                                       'Name' => 'gnutls_range_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12478' => {
                                       'BaseType' => '3240',
                                       'Name' => 'gnutls_range_st const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '1249853' => {
                                         'BaseType' => '1249865',
                                         'Header' => 'x509.h',
                                         'Line' => '1256',
                                         'Name' => 'gnutls_x509_trust_list_iter_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1249865' => {
                                         'BaseType' => '1249871',
                                         'Name' => 'struct gnutls_x509_trust_list_iter*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1249871' => {
                                         'Line' => '57',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'node_index',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '1' => {
                                                              'name' => 'ca_index',
                                                              'offset' => '4',
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'name' => 'pkcs11_list',
                                                              'offset' => '8',
                                                              'type' => '761498'
                                                            },
                                                     '3' => {
                                                              'name' => 'pkcs11_index',
                                                              'offset' => '16',
                                                              'type' => '130'
                                                            },
                                                     '4' => {
                                                              'name' => 'pkcs11_size',
                                                              'offset' => '20',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_trust_list_iter',
                                         'Size' => '24',
                                         'Source' => 'verify-high.c',
                                         'Type' => 'Struct'
                                       },
                          '1251426' => {
                                         'Line' => '37',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'cert',
                                                              'offset' => '0',
                                                              'type' => '111797'
                                                            },
                                                     '1' => {
                                                              'name' => 'name',
                                                              'offset' => '8',
                                                              'type' => '158178'
                                                            },
                                                     '2' => {
                                                              'name' => 'name_size',
                                                              'offset' => '136',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct named_cert_st',
                                         'Size' => '144',
                                         'Source' => 'verify-high.c',
                                         'Type' => 'Struct'
                                       },
                          '1251491' => {
                                         'BaseType' => '1251426',
                                         'Name' => 'struct named_cert_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1254865' => {
                                         'BaseType' => '1249853',
                                         'Name' => 'gnutls_x509_trust_list_iter_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1271445' => {
                                         'Line' => '34',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '1' => {
                                                              'name' => 'san',
                                                              'offset' => '8',
                                                              'type' => '3192'
                                                            },
                                                     '2' => {
                                                              'name' => 'othername_oid',
                                                              'offset' => '24',
                                                              'type' => '3192'
                                                            }
                                                   },
                                         'Name' => 'struct name_st',
                                         'Size' => '40',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1271494' => {
                                         'BaseType' => '1271445',
                                         'Name' => 'struct name_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1271500' => {
                                         'BaseType' => '1019035',
                                         'Name' => 'struct gnutls_x509_policy_st[64]',
                                         'Size' => '13312',
                                         'Type' => 'Array'
                                       },
                          '1271516' => {
                                         'Line' => '2120',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '1' => {
                                                              'name' => 'san',
                                                              'offset' => '8',
                                                              'type' => '3192'
                                                            },
                                                     '2' => {
                                                              'name' => 'reasons',
                                                              'offset' => '24',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct crl_dist_point_st',
                                         'Size' => '32',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1271569' => {
                                         'BaseType' => '1271516',
                                         'Name' => 'struct crl_dist_point_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1271575' => {
                                         'Line' => '2481',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'oid',
                                                              'offset' => '0',
                                                              'type' => '3192'
                                                            },
                                                     '1' => {
                                                              'name' => 'san_type',
                                                              'offset' => '16',
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'name' => 'san',
                                                              'offset' => '24',
                                                              'type' => '3192'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-x509_ext.c-2481',
                                         'Size' => '40',
                                         'Source' => 'x509_ext.c',
                                         'Type' => 'Struct'
                                       },
                          '1271624' => {
                                         'BaseType' => '1271575',
                                         'Name' => 'anon-struct-x509_ext.c-2481*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1271630' => {
                                         'BaseType' => '3192',
                                         'Name' => 'gnutls_datum_t[64]',
                                         'Size' => '1024',
                                         'Type' => 'Array'
                                       },
                          '1272629' => {
                                         'BaseType' => '999716',
                                         'Name' => 'gnutls_subject_alt_names_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1277421' => {
                                         'BaseType' => '999738',
                                         'Name' => 'gnutls_x509_aki_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1284640' => {
                                         'BaseType' => '1020553',
                                         'Name' => 'gnutls_x509_policies_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1289333' => {
                                         'BaseType' => '1020465',
                                         'Name' => 'gnutls_x509_crl_dist_points_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1291928' => {
                                         'BaseType' => '1020487',
                                         'Name' => 'gnutls_x509_aia_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1294616' => {
                                         'BaseType' => '1020531',
                                         'Name' => 'gnutls_x509_key_purposes_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '130' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1306782' => {
                                         'BaseType' => '1306793',
                                         'Header' => 'ocsp.h',
                                         'Line' => '141',
                                         'Name' => 'gnutls_ocsp_req_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1306793' => {
                                         'BaseType' => '1306799',
                                         'Name' => 'struct gnutls_ocsp_req_int*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1306799' => {
                                         'Line' => '36',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'req',
                                                              'offset' => '0',
                                                              'type' => '117419'
                                                            },
                                                     '1' => {
                                                              'name' => 'init',
                                                              'offset' => '8',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_ocsp_req_int',
                                         'Size' => '16',
                                         'Source' => 'ocsp.c',
                                         'Type' => 'Struct'
                                       },
                          '1308543' => {
                                         'BaseType' => '1306782',
                                         'Name' => 'gnutls_ocsp_req_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1308976' => {
                                         'BaseType' => '555052',
                                         'Name' => 'gnutls_ocsp_resp_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1328047' => {
                                         'Header' => 'ocsp.h',
                                         'Line' => '47',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_OCSP_PRINT_FULL',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_OCSP_PRINT_COMPACT',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_ocsp_print_formats_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1328076' => {
                                         'BaseType' => '1328047',
                                         'Header' => 'ocsp.h',
                                         'Line' => '50',
                                         'Name' => 'gnutls_ocsp_print_formats_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1365156' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '1030',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_NAME_DNS',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_server_name_type_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '137' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '13711' => {
                                       'BaseType' => '70',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '144' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1453' => {
                                      'BaseType' => '123',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '1469' => {
                                      'Header' => 'gnutls_int.h',
                                      'Line' => '91',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'i',
                                                           'offset' => '0',
                                                           'type' => '1453'
                                                         }
                                                },
                                      'Name' => 'struct uint64',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1480' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '114',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_CIPHER_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_CIPHER_NULL',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_128_GCM',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_256_GCM',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_CIPHER_CAMELLIA_192_CBC',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'GNUTLS_CIPHER_SALSA20_256',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'GNUTLS_CIPHER_ESTREAM_SALSA20_256',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'GNUTLS_CIPHER_CAMELLIA_128_GCM',
                                                            'value' => '15'
                                                          },
                                                  '16' => {
                                                            'name' => 'GNUTLS_CIPHER_CAMELLIA_256_GCM',
                                                            'value' => '16'
                                                          },
                                                  '17' => {
                                                            'name' => 'GNUTLS_CIPHER_RC2_40_CBC',
                                                            'value' => '17'
                                                          },
                                                  '18' => {
                                                            'name' => 'GNUTLS_CIPHER_DES_CBC',
                                                            'value' => '18'
                                                          },
                                                  '19' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_128_CCM',
                                                            'value' => '19'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_CIPHER_ARCFOUR_128',
                                                           'value' => '2'
                                                         },
                                                  '20' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_256_CCM',
                                                            'value' => '20'
                                                          },
                                                  '21' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_128_CCM_8',
                                                            'value' => '21'
                                                          },
                                                  '22' => {
                                                            'name' => 'GNUTLS_CIPHER_AES_256_CCM_8',
                                                            'value' => '22'
                                                          },
                                                  '23' => {
                                                            'name' => 'GNUTLS_CIPHER_CHACHA20_POLY1305',
                                                            'value' => '23'
                                                          },
                                                  '24' => {
                                                            'name' => 'GNUTLS_CIPHER_IDEA_PGP_CFB',
                                                            'value' => '200'
                                                          },
                                                  '25' => {
                                                            'name' => 'GNUTLS_CIPHER_3DES_PGP_CFB',
                                                            'value' => '201'
                                                          },
                                                  '26' => {
                                                            'name' => 'GNUTLS_CIPHER_CAST5_PGP_CFB',
                                                            'value' => '202'
                                                          },
                                                  '27' => {
                                                            'name' => 'GNUTLS_CIPHER_BLOWFISH_PGP_CFB',
                                                            'value' => '203'
                                                          },
                                                  '28' => {
                                                            'name' => 'GNUTLS_CIPHER_SAFER_SK128_PGP_CFB',
                                                            'value' => '204'
                                                          },
                                                  '29' => {
                                                            'name' => 'GNUTLS_CIPHER_AES128_PGP_CFB',
                                                            'value' => '205'
                                                          },
                                                  '3' => {
                                                           'name' => 'GNUTLS_CIPHER_3DES_CBC',
                                                           'value' => '3'
                                                         },
                                                  '30' => {
                                                            'name' => 'GNUTLS_CIPHER_AES192_PGP_CFB',
                                                            'value' => '206'
                                                          },
                                                  '31' => {
                                                            'name' => 'GNUTLS_CIPHER_AES256_PGP_CFB',
                                                            'value' => '207'
                                                          },
                                                  '32' => {
                                                            'name' => 'GNUTLS_CIPHER_TWOFISH_PGP_CFB',
                                                            'value' => '208'
                                                          },
                                                  '4' => {
                                                           'name' => 'GNUTLS_CIPHER_AES_128_CBC',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_CIPHER_AES_256_CBC',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_CIPHER_ARCFOUR_40',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_CIPHER_CAMELLIA_128_CBC',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_CIPHER_CAMELLIA_256_CBC',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_CIPHER_AES_192_CBC',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_cipher_algorithm',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '151' => {
                                     'BaseType' => '45',
                                     'Header' => 'types.h',
                                     'Line' => '131',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1542727' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '1094',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_SRTP_AES128_CM_HMAC_SHA1_80',
                                                              'value' => '1'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_SRTP_AES128_CM_HMAC_SHA1_32',
                                                              'value' => '2'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_SRTP_NULL_HMAC_SHA1_80',
                                                              'value' => '5'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_SRTP_NULL_HMAC_SHA1_32',
                                                              'value' => '6'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_srtp_profile_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1550923' => {
                                         'BaseType' => '1542727',
                                         'Name' => 'gnutls_srtp_profile_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '158178' => {
                                        'BaseType' => '788',
                                        'Name' => 'uint8_t[128]',
                                        'Size' => '128',
                                        'Type' => 'Array'
                                      },
                          '15899' => {
                                       'Header' => 'gnutls.h',
                                       'Line' => '548',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'GNUTLS_SHUT_RDWR',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'GNUTLS_SHUT_WR',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum gnutls_close_request_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '162' => {
                                     'BaseType' => '45',
                                     'Header' => 'types.h',
                                     'Line' => '132',
                                     'Name' => '__off64_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '165689' => {
                                        'BaseType' => '165701',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1568',
                                        'Name' => 'gnutls_log_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '165701' => {
                                        'Name' => 'void(*)(int, char const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '70'
                                                            },
                                                     '1' => {
                                                              'type' => '105'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '165723' => {
                                        'BaseType' => '165735',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1569',
                                        'Name' => 'gnutls_audit_log_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '165735' => {
                                        'Name' => 'void(*)(gnutls_session_t, char const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2672'
                                                            },
                                                     '1' => {
                                                              'type' => '105'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '1695' => {
                                      'BaseType' => '1480',
                                      'Header' => 'gnutls.h',
                                      'Line' => '151',
                                      'Name' => 'gnutls_cipher_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '16959' => {
                                       'BaseType' => '6158',
                                       'Header' => 'gnutls.h',
                                       'Line' => '974',
                                       'Name' => 'gnutls_packet_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '173' => {
                                     'BaseType' => '45',
                                     'Header' => 'types.h',
                                     'Line' => '139',
                                     'Name' => '__time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '17390' => {
                                       'BaseType' => '17402',
                                       'Header' => 'gnutls.h',
                                       'Line' => '1534',
                                       'Name' => 'gnutls_time_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '17402' => {
                                       'Name' => 'time_t(*)(time_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17423'
                                                           }
                                                  },
                                       'Return' => '225',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17423' => {
                                       'BaseType' => '225',
                                       'Name' => 'time_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '17429' => {
                                       'Name' => 'int(*)(void**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '17450'
                                                           }
                                                  },
                                       'Return' => '70',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '17450' => {
                                       'BaseType' => '184',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '177145' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '607',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_X509_FMT_DER',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_X509_FMT_PEM',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_x509_crt_fmt_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '1788252' => {
                                         'BaseType' => '1788258',
                                         'Name' => 'gnutls_certificate_type_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1788258' => {
                                         'BaseType' => '2292',
                                         'Name' => 'gnutls_certificate_type_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '178968' => {
                                        'BaseType' => '178980',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1547',
                                        'Name' => 'gnutls_calloc_function',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '178980' => {
                                        'Name' => 'void*(*)(size_t, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '52'
                                                            },
                                                     '1' => {
                                                              'type' => '52'
                                                            }
                                                   },
                                        'Return' => '184',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '17947' => {
                                       'BaseType' => '130',
                                       'Name' => 'unsigned int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '179585' => {
                                        'BaseType' => '179596',
                                        'Header' => 'abstract.h',
                                        'Line' => '57',
                                        'Name' => 'gnutls_privkey_sign_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '179596' => {
                                        'Name' => 'int(*)(gnutls_privkey_t, void*, gnutls_datum_t const*, gnutls_datum_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '111762'
                                                            },
                                                     '1' => {
                                                              'type' => '184'
                                                            },
                                                     '2' => {
                                                              'type' => '3587'
                                                            },
                                                     '3' => {
                                                              'type' => '3665'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '179632' => {
                                        'BaseType' => '179596',
                                        'Header' => 'abstract.h',
                                        'Line' => '62',
                                        'Name' => 'gnutls_privkey_decrypt_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '179643' => {
                                        'BaseType' => '179654',
                                        'Header' => 'abstract.h',
                                        'Line' => '68',
                                        'Name' => 'gnutls_privkey_deinit_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '179654' => {
                                        'Name' => 'void(*)(gnutls_privkey_t, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '111762'
                                                            },
                                                     '1' => {
                                                              'type' => '184'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '179676' => {
                                        'BaseType' => '179687',
                                        'Header' => 'abstract.h',
                                        'Line' => '77',
                                        'Name' => 'gnutls_privkey_info_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '179687' => {
                                        'Name' => 'int(*)(gnutls_privkey_t, unsigned int, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '111762'
                                                            },
                                                     '1' => {
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'type' => '184'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '1800684' => {
                                         'BaseType' => '1800690',
                                         'Name' => 'gnutls_cipher_algorithm_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1800690' => {
                                         'BaseType' => '1695',
                                         'Name' => 'gnutls_cipher_algorithm_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '181182' => {
                                        'Header' => 'crypto-backend.h',
                                        'Line' => '295',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_IMPORT',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_EXPORT',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_direction_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '181194' => {
                                        'Header' => 'crypto-backend.h',
                                        'Line' => '298',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'encrypt',
                                                             'offset' => '0',
                                                             'type' => '181392'
                                                           },
                                                    '1' => {
                                                             'name' => 'decrypt',
                                                             'offset' => '8',
                                                             'type' => '181392'
                                                           },
                                                    '10' => {
                                                              'name' => 'curve_exists',
                                                              'offset' => '80',
                                                              'type' => '181579'
                                                            },
                                                    '2' => {
                                                             'name' => 'sign',
                                                             'offset' => '16',
                                                             'type' => '181392'
                                                           },
                                                    '3' => {
                                                             'name' => 'verify',
                                                             'offset' => '24',
                                                             'type' => '181428'
                                                           },
                                                    '4' => {
                                                             'name' => 'verify_priv_params',
                                                             'offset' => '32',
                                                             'type' => '181454'
                                                           },
                                                    '5' => {
                                                             'name' => 'verify_pub_params',
                                                             'offset' => '40',
                                                             'type' => '181454'
                                                           },
                                                    '6' => {
                                                             'name' => 'generate_keys',
                                                             'offset' => '48',
                                                             'type' => '181491'
                                                           },
                                                    '7' => {
                                                             'name' => 'generate_params',
                                                             'offset' => '56',
                                                             'type' => '181491'
                                                           },
                                                    '8' => {
                                                             'name' => 'pk_fixup_private_params',
                                                             'offset' => '64',
                                                             'type' => '181522'
                                                           },
                                                    '9' => {
                                                             'name' => 'derive',
                                                             'offset' => '72',
                                                             'type' => '181558'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_crypto_pk',
                                        'Size' => '88',
                                        'Type' => 'Struct'
                                      },
                          '181381' => {
                                        'BaseType' => '181387',
                                        'Name' => 'gnutls_pk_params_st const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '181387' => {
                                        'BaseType' => '5512',
                                        'Name' => 'gnutls_pk_params_st const',
                                        'Size' => '144',
                                        'Type' => 'Const'
                                      },
                          '181392' => {
                                        'Name' => 'int(*)(gnutls_pk_algorithm_t, gnutls_datum_t*, gnutls_datum_t const*, gnutls_pk_params_st const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2348'
                                                            },
                                                     '1' => {
                                                              'type' => '3665'
                                                            },
                                                     '2' => {
                                                              'type' => '3587'
                                                            },
                                                     '3' => {
                                                              'type' => '181381'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '181428' => {
                                        'Name' => 'int(*)(gnutls_pk_algorithm_t, gnutls_datum_t const*, gnutls_datum_t const*, gnutls_pk_params_st const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2348'
                                                            },
                                                     '1' => {
                                                              'type' => '3587'
                                                            },
                                                     '2' => {
                                                              'type' => '3587'
                                                            },
                                                     '3' => {
                                                              'type' => '181381'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '181454' => {
                                        'Name' => 'int(*)(gnutls_pk_algorithm_t, gnutls_pk_params_st const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2348'
                                                            },
                                                     '1' => {
                                                              'type' => '181381'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '181485' => {
                                        'BaseType' => '5512',
                                        'Name' => 'gnutls_pk_params_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '181491' => {
                                        'Name' => 'int(*)(gnutls_pk_algorithm_t, unsigned int, gnutls_pk_params_st*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2348'
                                                            },
                                                     '1' => {
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'type' => '181485'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '1815' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '191',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_KX_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_KX_RSA',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_KX_DHE_PSK',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_KX_ANON_ECDH',
                                                            'value' => '11'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_KX_ECDHE_RSA',
                                                            'value' => '12'
                                                          },
                                                  '13' => {
                                                            'name' => 'GNUTLS_KX_ECDHE_ECDSA',
                                                            'value' => '13'
                                                          },
                                                  '14' => {
                                                            'name' => 'GNUTLS_KX_ECDHE_PSK',
                                                            'value' => '14'
                                                          },
                                                  '15' => {
                                                            'name' => 'GNUTLS_KX_RSA_PSK',
                                                            'value' => '15'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_KX_DHE_DSS',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_KX_DHE_RSA',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_KX_ANON_DH',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_KX_SRP',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_KX_RSA_EXPORT',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_KX_SRP_RSA',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_KX_SRP_DSS',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_KX_PSK',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_kx_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '181522' => {
                                        'Name' => 'int(*)(gnutls_pk_algorithm_t, gnutls_direction_t, gnutls_pk_params_st*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2348'
                                                            },
                                                     '1' => {
                                                              'type' => '181182'
                                                            },
                                                     '2' => {
                                                              'type' => '181485'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '181558' => {
                                        'Name' => 'int(*)(gnutls_pk_algorithm_t, gnutls_datum_t*, gnutls_pk_params_st const*, gnutls_pk_params_st const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2348'
                                                            },
                                                     '1' => {
                                                              'type' => '3665'
                                                            },
                                                     '2' => {
                                                              'type' => '181381'
                                                            },
                                                     '3' => {
                                                              'type' => '181381'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '181579' => {
                                        'Name' => 'int(*)(gnutls_ecc_curve_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2562'
                                                            }
                                                   },
                                        'Return' => '70',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '181585' => {
                                        'BaseType' => '181194',
                                        'Header' => 'crypto-backend.h',
                                        'Line' => '334',
                                        'Name' => 'gnutls_crypto_pk_st',
                                        'Size' => '88',
                                        'Type' => 'Typedef'
                                      },
                          '1816957' => {
                                         'BaseType' => '1971',
                                         'Name' => 'gnutls_mac_algorithm_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1816963' => {
                                         'BaseType' => '2242',
                                         'Name' => 'gnutls_protocol_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1821395' => {
                                         'BaseType' => '1821401',
                                         'Name' => 'gnutls_ecc_curve_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1821401' => {
                                         'BaseType' => '2562',
                                         'Name' => 'gnutls_ecc_curve_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1834264' => {
                                         'BaseType' => '1834270',
                                         'Name' => 'gnutls_kx_algorithm_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1834270' => {
                                         'BaseType' => '1815',
                                         'Name' => 'gnutls_kx_algorithm_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '184' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1847341' => {
                                         'BaseType' => '1847347',
                                         'Name' => 'gnutls_mac_algorithm_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1847347' => {
                                         'BaseType' => '1971',
                                         'Name' => 'gnutls_mac_algorithm_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1847468' => {
                                         'BaseType' => '1207297',
                                         'Name' => 'gnutls_digest_algorithm_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1859263' => {
                                         'BaseType' => '2242',
                                         'Name' => 'gnutls_protocol_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1859862' => {
                                         'BaseType' => '1859263',
                                         'Name' => 'gnutls_protocol_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '186' => {
                                     'BaseType' => '45',
                                     'Header' => 'types.h',
                                     'Line' => '172',
                                     'Name' => '__ssize_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '186744' => {
                                        'Header' => 'abstract_int.h',
                                        'Line' => '40',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sign_func',
                                                             'offset' => '0',
                                                             'type' => '179585'
                                                           },
                                                    '1' => {
                                                             'name' => 'decrypt_func',
                                                             'offset' => '8',
                                                             'type' => '179632'
                                                           },
                                                    '2' => {
                                                             'name' => 'deinit_func',
                                                             'offset' => '16',
                                                             'type' => '179643'
                                                           },
                                                    '3' => {
                                                             'name' => 'info_func',
                                                             'offset' => '24',
                                                             'type' => '179676'
                                                           },
                                                    '4' => {
                                                             'name' => 'userdata',
                                                             'offset' => '32',
                                                             'type' => '184'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-abstract_int.h-40',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '186813' => {
                                        'Header' => 'abstract_int.h',
                                        'Line' => '32',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'x509',
                                                             'offset' => '0',
                                                             'type' => '111785'
                                                           },
                                                    '1' => {
                                                             'name' => 'pkcs11',
                                                             'offset' => '0',
                                                             'type' => '112783'
                                                           },
                                                    '2' => {
                                                             'name' => 'openpgp',
                                                             'offset' => '0',
                                                             'type' => '112716'
                                                           },
                                                    '3' => {
                                                             'name' => 'ext',
                                                             'offset' => '0',
                                                             'type' => '186744'
                                                           }
                                                  },
                                        'Name' => 'anon-union-abstract_int.h-32',
                                        'Size' => '40',
                                        'Type' => 'Union'
                                      },
                          '186882' => {
                                        'BaseType' => '788',
                                        'Name' => 'uint8_t[20]',
                                        'Size' => '20',
                                        'Type' => 'Array'
                                      },
                          '1869' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '223',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_CRD_CERTIFICATE',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_CRD_ANON',
                                                           'value' => '2'
                                                         },
                                                  '2' => {
                                                           'name' => 'GNUTLS_CRD_SRP',
                                                           'value' => '3'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_CRD_PSK',
                                                           'value' => '4'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_CRD_IA',
                                                           'value' => '5'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_credentials_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1871038' => {
                                         'BaseType' => '1871044',
                                         'Name' => 'gnutls_sign_algorithm_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1871044' => {
                                         'BaseType' => '2500',
                                         'Name' => 'gnutls_sign_algorithm_t const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '187702' => {
                                        'BaseType' => '2759',
                                        'Name' => 'gnutls_dh_params_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '197' => {
                                     'BaseType' => '45',
                                     'Header' => 'types.h',
                                     'Line' => '175',
                                     'Name' => '__syscall_slong_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1971' => {
                                      'Header' => 'gnutls.h',
                                      'Line' => '263',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'GNUTLS_MAC_UNKNOWN',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'GNUTLS_MAC_NULL',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'GNUTLS_MAC_AEAD',
                                                            'value' => '200'
                                                          },
                                                  '11' => {
                                                            'name' => 'GNUTLS_MAC_UMAC_96',
                                                            'value' => '201'
                                                          },
                                                  '12' => {
                                                            'name' => 'GNUTLS_MAC_UMAC_128',
                                                            'value' => '202'
                                                          },
                                                  '2' => {
                                                           'name' => 'GNUTLS_MAC_MD5',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'GNUTLS_MAC_SHA1',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'GNUTLS_MAC_RMD160',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'GNUTLS_MAC_MD2',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'GNUTLS_MAC_SHA256',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'GNUTLS_MAC_SHA384',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'GNUTLS_MAC_SHA512',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'GNUTLS_MAC_SHA224',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum gnutls_mac_algorithm_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1978009' => {
                                         'BaseType' => '1978020',
                                         'Header' => 'opencdk.h',
                                         'Line' => '64',
                                         'Name' => 'cdk_s2k_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1978020' => {
                                         'BaseType' => '1978026',
                                         'Name' => 'struct cdk_s2k_s*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1978026' => {
                                         'Header' => 'context.h',
                                         'Line' => '41',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'mode',
                                                              'offset' => '0',
                                                              'type' => '70'
                                                            },
                                                     '1' => {
                                                              'name' => 'hash_algo',
                                                              'offset' => '4',
                                                              'type' => '2074760'
                                                            },
                                                     '2' => {
                                                              'name' => 'salt',
                                                              'offset' => '5',
                                                              'type' => '2084668'
                                                            },
                                                     '3' => {
                                                              'name' => 'count',
                                                              'offset' => '16',
                                                              'type' => '2074771'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_s2k_s',
                                         'Size' => '20',
                                         'Type' => 'Struct'
                                       },
                          '1978031' => {
                                         'BaseType' => '1978042',
                                         'Header' => 'opencdk.h',
                                         'Line' => '68',
                                         'Name' => 'cdk_stream_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1978042' => {
                                         'BaseType' => '1978048',
                                         'Name' => 'struct cdk_stream_s*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1978048' => {
                                         'Header' => 'stream.h',
                                         'Line' => '68',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'filters',
                                                              'offset' => '0',
                                                              'type' => '2109202'
                                                            },
                                                     '1' => {
                                                              'name' => 'fmode',
                                                              'offset' => '8',
                                                              'type' => '70'
                                                            },
                                                     '10' => {
                                                               'name' => 'cbs_hd',
                                                               'offset' => '128',
                                                               'type' => '184'
                                                             },
                                                     '2' => {
                                                              'name' => 'error',
                                                              'offset' => '12',
                                                              'type' => '70'
                                                            },
                                                     '3' => {
                                                              'name' => 'blkmode',
                                                              'offset' => '16',
                                                              'type' => '52'
                                                            },
                                                     '4' => {
                                                              'name' => 'flags',
                                                              'offset' => '24',
                                                              'type' => '2109208'
                                                            },
                                                     '5' => {
                                                              'name' => 'cache',
                                                              'offset' => '32',
                                                              'type' => '2109322'
                                                            },
                                                     '6' => {
                                                              'name' => 'fname',
                                                              'offset' => '64',
                                                              'type' => '208'
                                                            },
                                                     '7' => {
                                                              'name' => 'fp',
                                                              'offset' => '72',
                                                              'type' => '219162'
                                                            },
                                                     '8' => {
                                                              'bitfield' => '1',
                                                              'name' => 'fp_ref',
                                                              'offset' => '80',
                                                              'type' => '130'
                                                            },
                                                     '9' => {
                                                              'name' => 'cbs',
                                                              'offset' => '88',
                                                              'type' => '2108128'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_stream_s',
                                         'Size' => '136',
                                         'Type' => 'Struct'
                                       },
                          '1978053' => {
                                         'BaseType' => '1978064',
                                         'Header' => 'opencdk.h',
                                         'Line' => '72',
                                         'Name' => 'cdk_prefitem_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1978064' => {
                                         'BaseType' => '1978070',
                                         'Name' => 'struct cdk_prefitem_s*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1978070' => {
                                         'Header' => 'context.h',
                                         'Line' => '82',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '2074760'
                                                            },
                                                     '1' => {
                                                              'name' => 'value',
                                                              'offset' => '1',
                                                              'type' => '2074760'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_prefitem_s',
                                         'Size' => '2',
                                         'Type' => 'Struct'
                                       },
                          '1978097' => {
                                         'BaseType' => '1978108',
                                         'Header' => 'opencdk.h',
                                         'Line' => '91',
                                         'Name' => 'cdk_subpkt_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1978108' => {
                                         'BaseType' => '1978114',
                                         'Name' => 'struct cdk_subpkt_s*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1978114' => {
                                         'Header' => 'context.h',
                                         'Line' => '94',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'next',
                                                              'offset' => '0',
                                                              'type' => '1978108'
                                                            },
                                                     '1' => {
                                                              'name' => 'size',
                                                              'offset' => '8',
                                                              'type' => '2074771'
                                                            },
                                                     '2' => {
                                                              'name' => 'type',
                                                              'offset' => '12',
                                                              'type' => '2074760'
                                                            },
                                                     '3' => {
                                                              'name' => 'd',
                                                              'offset' => '16',
                                                              'type' => '2084700'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_subpkt_s',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1978119' => {
                                         'BaseType' => '1978130',
                                         'Header' => 'opencdk.h',
                                         'Line' => '99',
                                         'Name' => 'cdk_desig_revoker_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1978130' => {
                                         'BaseType' => '1978136',
                                         'Name' => 'struct cdk_desig_revoker_s*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1978136' => {
                                         'Header' => 'context.h',
                                         'Line' => '87',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'next',
                                                              'offset' => '0',
                                                              'type' => '1978130'
                                                            },
                                                     '1' => {
                                                              'name' => 'r_class',
                                                              'offset' => '8',
                                                              'type' => '2074760'
                                                            },
                                                     '2' => {
                                                              'name' => 'algid',
                                                              'offset' => '9',
                                                              'type' => '2074760'
                                                            },
                                                     '3' => {
                                                              'name' => 'fpr',
                                                              'offset' => '10',
                                                              'type' => '2084684'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_desig_revoker_s',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1978598' => {
                                         'Header' => 'opencdk.h',
                                         'Line' => '353',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'CDK_PKT_RESERVED',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'CDK_PKT_PUBKEY_ENC',
                                                              'value' => '1'
                                                            },
                                                     '10' => {
                                                               'name' => 'CDK_PKT_RING_TRUST',
                                                               'value' => '12'
                                                             },
                                                     '11' => {
                                                               'name' => 'CDK_PKT_USER_ID',
                                                               'value' => '13'
                                                             },
                                                     '12' => {
                                                               'name' => 'CDK_PKT_PUBLIC_SUBKEY',
                                                               'value' => '14'
                                                             },
                                                     '13' => {
                                                               'name' => 'CDK_PKT_OLD_COMMENT',
                                                               'value' => '16'
                                                             },
                                                     '14' => {
                                                               'name' => 'CDK_PKT_ATTRIBUTE',
                                                               'value' => '17'
                                                             },
                                                     '15' => {
                                                               'name' => 'CDK_PKT_MDC',
                                                               'value' => '19'
                                                             },
                                                     '2' => {
                                                              'name' => 'CDK_PKT_SIGNATURE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'CDK_PKT_ONEPASS_SIG',
                                                              'value' => '4'
                                                            },
                                                     '4' => {
                                                              'name' => 'CDK_PKT_SECRET_KEY',
                                                              'value' => '5'
                                                            },
                                                     '5' => {
                                                              'name' => 'CDK_PKT_PUBLIC_KEY',
                                                              'value' => '6'
                                                            },
                                                     '6' => {
                                                              'name' => 'CDK_PKT_SECRET_SUBKEY',
                                                              'value' => '7'
                                                            },
                                                     '7' => {
                                                              'name' => 'CDK_PKT_COMPRESSED',
                                                              'value' => '8'
                                                            },
                                                     '8' => {
                                                              'name' => 'CDK_PKT_MARKER',
                                                              'value' => '10'
                                                            },
                                                     '9' => {
                                                              'name' => 'CDK_PKT_LITERAL',
                                                              'value' => '11'
                                                            }
                                                   },
                                         'Name' => 'enum cdk_packet_type_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1978610' => {
                                         'Header' => 'opencdk.h',
                                         'Line' => '385',
                                         'Memb' => {
                                                     '0' => {
                                                              'bitfield' => '1',
                                                              'name' => 'exportable',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '1' => {
                                                              'bitfield' => '1',
                                                              'name' => 'revocable',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'bitfield' => '1',
                                                              'name' => 'policy_url',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '3' => {
                                                              'bitfield' => '1',
                                                              'name' => 'notation',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '4' => {
                                                              'bitfield' => '1',
                                                              'name' => 'expired',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '5' => {
                                                              'bitfield' => '1',
                                                              'name' => 'checked',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '6' => {
                                                              'bitfield' => '1',
                                                              'name' => 'valid',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '7' => {
                                                              'bitfield' => '1',
                                                              'name' => 'missing_key',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'anon-struct-opencdk.h-385',
                                         'Size' => '4',
                                         'Type' => 'Struct'
                                       },
                          '1978748' => {
                                         'Header' => 'opencdk.h',
                                         'Line' => '370',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'version',
                                                              'offset' => '0',
                                                              'type' => '123'
                                                            },
                                                     '1' => {
                                                              'name' => 'sig_class',
                                                              'offset' => '1',
                                                              'type' => '123'
                                                            },
                                                     '10' => {
                                                               'name' => 'unhashed_size',
                                                               'offset' => '40',
                                                               'type' => '98'
                                                             },
                                                     '11' => {
                                                               'name' => 'unhashed',
                                                               'offset' => '48',
                                                               'type' => '1978097'
                                                             },
                                                     '12' => {
                                                               'name' => 'mpi',
                                                               'offset' => '56',
                                                               'type' => '6553'
                                                             },
                                                     '13' => {
                                                               'name' => 'revkeys',
                                                               'offset' => '72',
                                                               'type' => '1978119'
                                                             },
                                                     '14' => {
                                                               'name' => 'flags',
                                                               'offset' => '80',
                                                               'type' => '1978610'
                                                             },
                                                     '15' => {
                                                               'name' => 'key',
                                                               'offset' => '84',
                                                               'type' => '1978970'
                                                             },
                                                     '2' => {
                                                              'name' => 'timestamp',
                                                              'offset' => '4',
                                                              'type' => '130'
                                                            },
                                                     '3' => {
                                                              'name' => 'expiredate',
                                                              'offset' => '8',
                                                              'type' => '130'
                                                            },
                                                     '4' => {
                                                              'name' => 'keyid',
                                                              'offset' => '12',
                                                              'type' => '1978970'
                                                            },
                                                     '5' => {
                                                              'name' => 'pubkey_algo',
                                                              'offset' => '20',
                                                              'type' => '123'
                                                            },
                                                     '6' => {
                                                              'name' => 'digest_algo',
                                                              'offset' => '21',
                                                              'type' => '123'
                                                            },
                                                     '7' => {
                                                              'name' => 'digest_start',
                                                              'offset' => '22',
                                                              'type' => '1133750'
                                                            },
                                                     '8' => {
                                                              'name' => 'hashed_size',
                                                              'offset' => '24',
                                                              'type' => '98'
                                                            },
                                                     '9' => {
                                                              'name' => 'hashed',
                                                              'offset' => '32',
                                                              'type' => '1978097'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_pkt_signature_s',
                                         'Size' => '96',
                                         'Type' => 'Struct'
                                       },
                          '1978970' => {
                                         'BaseType' => '130',
                                         'Name' => 'unsigned int[2]',
                                         'Size' => '8',
                                         'Type' => 'Array'
                                       },
                          '1979002' => {
                                         'BaseType' => '1979014',
                                         'Header' => 'opencdk.h',
                                         'Line' => '397',
                                         'Name' => 'cdk_pkt_signature_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1979014' => {
                                         'BaseType' => '1978748',
                                         'Name' => 'struct cdk_pkt_signature_s*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1979020' => {
                                         'Header' => 'opencdk.h',
                                         'Line' => '400',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'len',
                                                              'offset' => '0',
                                                              'type' => '130'
                                                            },
                                                     '1' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_primary',
                                                              'offset' => '4',
                                                              'type' => '130'
                                                            },
                                                     '2' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_revoked',
                                                              'offset' => '4',
                                                              'type' => '130'
                                                            },
                                                     '3' => {
                                                              'bitfield' => '1',
                                                              'name' => 'mdc_feature',
                                                              'offset' => '4',
                                                              'type' => '130'
                                                            },
                                                     '4' => {
                                                              'name' => 'prefs',
                                                              'offset' => '8',
                                                              'type' => '1978053'
                                                            },
                                                     '5' => {
                                                              'name' => 'prefs_size',
                                                              'offset' => '16',
                                                              'type' => '52'
                                                            },
                                                     '6' => {
                                                              'name' => 'attrib_img',
                                                              'offset' => '24',
                                                              'type' => '3186'
                                                            },
                                                     '7' => {
                                                              'name' => 'attrib_len',
                                                              'offset' => '32',
                                                              'type' => '52'
                                                            },
                                                     '8' => {
                                                              'name' => 'selfsig',
                                                              'offset' => '40',
                                                              'type' => '1979002'
                                                            },
                                                     '9' => {
                                                              'name' => 'name',
                                                              'offset' => '48',
                                                              'type' => '208'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_pkt_userid_s',
                                         'Size' => '56',
                                         'Type' => 'Struct'
                                       },
                          '1979173' => {
                                         'BaseType' => '1979185',
                                         'Header' => 'opencdk.h',
                                         'Line' => '412',
                                         'Name' => 'cdk_pkt_userid_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1979185' => {
                                         'BaseType' => '1979020',
                                         'Name' => 'struct cdk_pkt_userid_s*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1979191' => {
                                         'Header' => 'opencdk.h',
                                         'Line' => '415',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'version',
                                                              'offset' => '0',
                                                              'type' => '123'
                                                            },
                                                     '1' => {
                                                              'name' => 'pubkey_algo',
                                                              'offset' => '1',
                                                              'type' => '123'
                                                            },
                                                     '10' => {
                                                               'bitfield' => '1',
                                                               'name' => 'has_expired',
                                                               'offset' => '80',
                                                               'type' => '130'
                                                             },
                                                     '11' => {
                                                               'name' => 'pubkey_usage',
                                                               'offset' => '84',
                                                               'type' => '70'
                                                             },
                                                     '12' => {
                                                               'name' => 'uid',
                                                               'offset' => '88',
                                                               'type' => '1979173'
                                                             },
                                                     '13' => {
                                                               'name' => 'prefs',
                                                               'offset' => '96',
                                                               'type' => '1978053'
                                                             },
                                                     '14' => {
                                                               'name' => 'prefs_size',
                                                               'offset' => '104',
                                                               'type' => '52'
                                                             },
                                                     '15' => {
                                                               'name' => 'revkeys',
                                                               'offset' => '112',
                                                               'type' => '1978119'
                                                             },
                                                     '2' => {
                                                              'name' => 'fpr',
                                                              'offset' => '2',
                                                              'type' => '733604'
                                                            },
                                                     '3' => {
                                                              'name' => 'keyid',
                                                              'offset' => '24',
                                                              'type' => '1978970'
                                                            },
                                                     '4' => {
                                                              'name' => 'main_keyid',
                                                              'offset' => '32',
                                                              'type' => '1978970'
                                                            },
                                                     '5' => {
                                                              'name' => 'timestamp',
                                                              'offset' => '40',
                                                              'type' => '130'
                                                            },
                                                     '6' => {
                                                              'name' => 'expiredate',
                                                              'offset' => '44',
                                                              'type' => '130'
                                                            },
                                                     '7' => {
                                                              'name' => 'mpi',
                                                              'offset' => '48',
                                                              'type' => '1979438'
                                                            },
                                                     '8' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_revoked',
                                                              'offset' => '80',
                                                              'type' => '130'
                                                            },
                                                     '9' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_invalid',
                                                              'offset' => '80',
                                                              'type' => '130'
                                                            }
                                                   },
                                         'Name' => 'struct cdk_pkt_pubkey_s',
                                         'Size' => '120',
                                         'Type' => 'Struct'
                                       },
                          '1979438' => {
                                         'BaseType' => '4648',
                                         'Name' => 'bigint_t[4]',
                                         'Size' => '32',
                                         'Type' => 'Array'
                                       },
