$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.16',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '6.2.1',
          'Headers' => {
                         'abstract.h' => 1,
                         'crypto.h' => 1,
                         'dtls.h' => 1,
                         'gnutls.h' => 1,
                         'ocsp.h' => 1,
                         'openpgp.h' => 1,
                         'pkcs11.h' => 1,
                         'pkcs12.h' => 1,
                         'pkcs7.h' => 1,
                         'socket.h' => 1,
                         'system-keys.h' => 1,
                         'tpm.h' => 1,
                         'urls.h' => 1,
                         'x509-ext.h' => 1,
                         'x509.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libgnutls.so.30.13.1',
          'LibraryVersion' => '3.5.8',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libdl.so.2' => 1,
                        'libgmp.so.10' => 1,
                        'libhogweed.so.4' => 1,
                        'libidn.so.11' => 1,
                        'libnettle.so.6' => 1,
                        'libp11-kit.so.0' => 1,
                        'libtasn1.so.6' => 1,
                        'libunistring.so.0' => 1,
                        'libz.so.1' => 1
                      },

                                                     'gnutls_x509_rdn_get_by_oid@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_rdn_get_oid@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_add@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_check_crt@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_deinit@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_get@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_tlsfeatures_init@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_cas@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_crls@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_named_crt@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_system_trust@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_trust_dir@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_trust_file@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_add_trust_mem@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_deinit@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_get_issuer@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_get_issuer_by_dn@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_get_issuer_by_subject_key_id@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_init@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_iter_deinit@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_iter_get_ca@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_remove_cas@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_remove_trust_file@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_remove_trust_mem@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_verify_crt2@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_verify_crt@@GNUTLS_3_4' => 1,
                                                     'gnutls_x509_trust_list_verify_named_crt@@GNUTLS_3_4' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10015' => {
                                       'BaseType' => '5971',
                                       'Header' => 'hash_int.h',
                                       'Line' => '39',
                                       'Name' => 'hash_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10026' => {
                                       'BaseType' => '5971',
                                       'Header' => 'hash_int.h',
                                       'Line' => '40',
                                       'Name' => 'nonce_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10037' => {
                                       'BaseType' => '6305',
                                       'Header' => 'hash_int.h',
                                       'Line' => '41',
                                       'Name' => 'output_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10048' => {
                                       'BaseType' => '4665',
                                       'Header' => 'hash_int.h',
                                       'Line' => '43',
                                       'Name' => 'hash_deinit_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1006' => {
                                      'BaseType' => '246',
                                      'Header' => 'unistd.h',
                                      'Line' => '277',
                                      'Name' => 'socklen_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1011939' => {
                                         'BaseType' => '158215',
                                         'Name' => 'gnutls_openpgp_privkey_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1013259' => {
                                         'BaseType' => '998534',
                                         'Name' => 'gnutls_keygen_data_st const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10150' => {
                                       'BaseType' => '9771',
                                       'Name' => 'mac_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1015419' => {
                                         'BaseType' => '158282',
                                         'Name' => 'gnutls_pkcs11_privkey_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10156' => {
                                       'Header' => 'hash_int.h',
                                       'Line' => '55',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'e',
                                                            'offset' => '0',
                                                            'type' => '10150'
                                                          },
                                                   '1' => {
                                                            'name' => 'hash',
                                                            'offset' => '8',
                                                            'type' => '10015'
                                                          },
                                                   '2' => {
                                                            'name' => 'output',
                                                            'offset' => '16',
                                                            'type' => '10037'
                                                          },
                                                   '3' => {
                                                            'name' => 'deinit',
                                                            'offset' => '24',
                                                            'type' => '10048'
                                                          },
                                                   '4' => {
                                                            'name' => 'key',
                                                            'offset' => '32',
                                                            'type' => '334'
                                                          },
                                                   '5' => {
                                                            'name' => 'keysize',
                                                            'offset' => '40',
                                                            'type' => '75'
                                                          },
                                                   '6' => {
                                                            'name' => 'handle',
                                                            'offset' => '48',
                                                            'type' => '216'
                                                          }
                                                 },
                                       'Name' => 'struct digest_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10258' => {
                                       'Header' => 'hash_int.h',
                                       'Line' => '67',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'e',
                                                            'offset' => '0',
                                                            'type' => '10150'
                                                          },
                                                   '1' => {
                                                            'name' => 'mac_len',
                                                            'offset' => '8',
                                                            'type' => '75'
                                                          },
                                                   '2' => {
                                                            'name' => 'hash',
                                                            'offset' => '16',
                                                            'type' => '10015'
                                                          },
                                                   '3' => {
                                                            'name' => 'setnonce',
                                                            'offset' => '24',
                                                            'type' => '10026'
                                                          },
                                                   '4' => {
                                                            'name' => 'output',
                                                            'offset' => '32',
                                                            'type' => '10037'
                                                          },
                                                   '5' => {
                                                            'name' => 'deinit',
                                                            'offset' => '40',
                                                            'type' => '10048'
                                                          },
                                                   '6' => {
                                                            'name' => 'handle',
                                                            'offset' => '48',
                                                            'type' => '216'
                                                          }
                                                 },
                                       'Name' => 'struct mac_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '10291' => {
                                       'BaseType' => '6024',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '33',
                                       'Name' => 'cipher_encrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '103' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1030' => {
                                      'BaseType' => '240',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '10302' => {
                                       'BaseType' => '6024',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '35',
                                       'Name' => 'cipher_decrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10313' => {
                                       'BaseType' => '6136',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '37',
                                       'Name' => 'aead_cipher_encrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10324' => {
                                       'BaseType' => '6136',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '43',
                                       'Name' => 'aead_cipher_decrypt_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10335' => {
                                       'BaseType' => '4665',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '49',
                                       'Name' => 'cipher_deinit_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10346' => {
                                       'BaseType' => '5971',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '51',
                                       'Name' => 'cipher_auth_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10357' => {
                                       'BaseType' => '5971',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '52',
                                       'Name' => 'cipher_setiv_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10368' => {
                                       'BaseType' => '6098',
                                       'Header' => 'cipher_int.h',
                                       'Line' => '54',
                                       'Name' => 'cipher_tag_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1036973' => {
                                         'BaseType' => '158148',
                                         'Name' => 'gnutls_openpgp_crt_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1046529' => {
                                         'BaseType' => '1046541',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1572',
                                         'Name' => 'gnutls_x509_crq_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1046541' => {
                                         'BaseType' => '1046547',
                                         'Name' => 'struct gnutls_x509_crq_int*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1046547' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '96',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'crq',
                                                              'offset' => '0',
                                                              'type' => '8286'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_crq_int',
                                         'PrivateABI' => 1,
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1048015' => {
                                         'BaseType' => '1048026',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '63',
                                         'Name' => 'gnutls_pkcs11_obj_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1048026' => {
                                         'BaseType' => '1048032',
                                         'Name' => 'struct gnutls_pkcs11_obj_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1048032' => {
                                         'Header' => 'pkcs11_int.h',
                                         'Line' => '47',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'raw',
                                                              'offset' => '0',
                                                              'type' => '3887'
                                                            },
                                                     '1' => {
                                                              'name' => 'type',
                                                              'offset' => '16',
                                                              'type' => '1048221'
                                                            },
                                                     '2' => {
                                                              'name' => 'class',
                                                              'offset' => '24',
                                                              'type' => '1057223'
                                                            },
                                                     '3' => {
                                                              'name' => 'flags',
                                                              'offset' => '32',
                                                              'type' => '145'
                                                            },
                                                     '4' => {
                                                              'name' => 'info',
                                                              'offset' => '40',
                                                              'type' => '1057251'
                                                            },
                                                     '5' => {
                                                              'name' => 'pubkey',
                                                              'offset' => '48',
                                                              'type' => '1057257'
                                                            },
                                                     '6' => {
                                                              'name' => 'pubkey_size',
                                                              'offset' => '112',
                                                              'type' => '145'
                                                            },
                                                     '7' => {
                                                              'name' => 'pk_algorithm',
                                                              'offset' => '116',
                                                              'type' => '2916'
                                                            },
                                                     '8' => {
                                                              'name' => 'key_usage',
                                                              'offset' => '120',
                                                              'type' => '145'
                                                            },
                                                     '9' => {
                                                              'name' => 'pin',
                                                              'offset' => '128',
                                                              'type' => '163164'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_pkcs11_obj_st',
                                         'PrivateABI' => 1,
                                         'Size' => '144',
                                         'Type' => 'Struct'
                                       },
                          '1048221' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '349',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_UNKNOWN',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_X509_CRT',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_PUBKEY',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_PRIVKEY',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_SECRET_KEY',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_DATA',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_X509_CRT_EXTENSION',
                                                              'value' => '6'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_obj_type_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '10506' => {
                                       'BaseType' => '9611',
                                       'Name' => 'cipher_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10512' => {
                                       'Header' => 'cipher_int.h',
                                       'Line' => '67',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'handle',
                                                            'offset' => '0',
                                                            'type' => '216'
                                                          },
                                                   '1' => {
                                                            'name' => 'e',
                                                            'offset' => '8',
                                                            'type' => '10506'
                                                          },
                                                   '2' => {
                                                            'name' => 'encrypt',
                                                            'offset' => '16',
                                                            'type' => '10291'
                                                          },
                                                   '3' => {
                                                            'name' => 'decrypt',
                                                            'offset' => '24',
                                                            'type' => '10302'
                                                          },
                                                   '4' => {
                                                            'name' => 'aead_encrypt',
                                                            'offset' => '32',
                                                            'type' => '10313'
                                                          },
                                                   '5' => {
                                                            'name' => 'aead_decrypt',
                                                            'offset' => '40',
                                                            'type' => '10324'
                                                          },
                                                   '6' => {
                                                            'name' => 'auth',
                                                            'offset' => '48',
                                                            'type' => '10346'
                                                          },
                                                   '7' => {
                                                            'name' => 'tag',
                                                            'offset' => '56',
                                                            'type' => '10368'
                                                          },
                                                   '8' => {
                                                            'name' => 'setiv',
                                                            'offset' => '64',
                                                            'type' => '10357'
                                                          },
                                                   '9' => {
                                                            'name' => 'deinit',
                                                            'offset' => '72',
                                                            'type' => '10335'
                                                          }
                                                 },
                                       'Name' => 'struct cipher_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '10523' => {
                                       'Header' => 'cipher_int.h',
                                       'Line' => '191',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dig',
                                                            'offset' => '0',
                                                            'type' => '10156'
                                                          },
                                                   '1' => {
                                                            'name' => 'mac',
                                                            'offset' => '0',
                                                            'type' => '10258'
                                                          }
                                                 },
                                       'Name' => 'anon-union-cipher_int.h-191',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Union'
                                     },
                          '1057223' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '311',
                                         'Name' => 'ck_object_class_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1057246' => {
                                         'Name' => 'struct p11_kit_uri',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1057251' => {
                                         'BaseType' => '1057246',
                                         'Name' => 'struct p11_kit_uri*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1057257' => {
                                         'BaseType' => '3887',
                                         'Name' => 'gnutls_datum_t[4]',
                                         'Size' => '64',
                                         'Type' => 'Array'
                                       },
                          '10659' => {
                                       'Header' => 'cipher_int.h',
                                       'Line' => '202',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cipher',
                                                            'offset' => '0',
                                                            'type' => '10512'
                                                          },
                                                   '1' => {
                                                            'name' => 'mac',
                                                            'offset' => '80',
                                                            'type' => '10523'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'is_mac',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ssl_hmac',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'non_null',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'etm',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '6' => {
                                                            'name' => 'tag_size',
                                                            'offset' => '144',
                                                            'type' => '52'
                                                          }
                                                 },
                                       'Name' => 'struct auth_cipher_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '10670' => {
                                       'Header' => 'compress.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'handle',
                                                            'offset' => '0',
                                                            'type' => '216'
                                                          },
                                                   '1' => {
                                                            'name' => 'algo',
                                                            'offset' => '8',
                                                            'type' => '2583'
                                                          }
                                                 },
                                       'Name' => 'struct comp_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10707' => {
                                       'BaseType' => '10670',
                                       'Header' => 'compress.h',
                                       'Line' => '41',
                                       'Name' => 'comp_hd_st',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '1072048' => {
                                         'BaseType' => '4454',
                                         'Name' => 'gnutls_pubkey_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1095473' => {
                                         'Header' => 'dtls.h',
                                         'Line' => '67',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'record_seq',
                                                              'offset' => '0',
                                                              'type' => '145'
                                                            },
                                                     '1' => {
                                                              'name' => 'hsk_read_seq',
                                                              'offset' => '4',
                                                              'type' => '145'
                                                            },
                                                     '2' => {
                                                              'name' => 'hsk_write_seq',
                                                              'offset' => '8',
                                                              'type' => '145'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_dtls_prestate_st',
                                         'Size' => '12',
                                         'Type' => 'Struct'
                                       },
                          '110' => {
                                     'BaseType' => '128',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1103881' => {
                                         'BaseType' => '1095473',
                                         'Name' => 'gnutls_dtls_prestate_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '11053' => {
                                       'BaseType' => '962',
                                       'Name' => 'uint8_t[2]',
                                       'Size' => '2',
                                       'Type' => 'Array'
                                     },
                          '11069' => {
                                       'BaseType' => '962',
                                       'Name' => 'uint8_t[48]',
                                       'Size' => '48',
                                       'Type' => 'Array'
                                     },
                          '11085' => {
                                       'BaseType' => '962',
                                       'Name' => 'uint8_t[32]',
                                       'Size' => '32',
                                       'Type' => 'Array'
                                     },
                          '11101' => {
                                       'BaseType' => '9966',
                                       'Name' => 'version_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11107' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '599',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '145'
                                                          },
                                                   '1' => {
                                                            'name' => 'kx_algorithm',
                                                            'offset' => '4',
                                                            'type' => '2242'
                                                          },
                                                   '10' => {
                                                             'name' => 'server_random',
                                                             'offset' => '104',
                                                             'type' => '11085'
                                                           },
                                                   '11' => {
                                                             'name' => 'session_id',
                                                             'offset' => '136',
                                                             'type' => '11085'
                                                           },
                                                   '12' => {
                                                             'name' => 'session_id_size',
                                                             'offset' => '168',
                                                             'type' => '962'
                                                           },
                                                   '13' => {
                                                             'name' => 'timestamp',
                                                             'offset' => '176',
                                                             'type' => '268'
                                                           },
                                                   '14' => {
                                                             'name' => 'max_record_send_size',
                                                             'offset' => '184',
                                                             'type' => '973'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_record_recv_size',
                                                             'offset' => '186',
                                                             'type' => '973'
                                                           },
                                                   '16' => {
                                                             'name' => 'cert_type',
                                                             'offset' => '188',
                                                             'type' => '2854'
                                                           },
                                                   '17' => {
                                                             'name' => 'ecc_curve',
                                                             'offset' => '192',
                                                             'type' => '3208'
                                                           },
                                                   '18' => {
                                                             'name' => 'server_sign_algo',
                                                             'offset' => '196',
                                                             'type' => '3140'
                                                           },
                                                   '19' => {
                                                             'name' => 'client_sign_algo',
                                                             'offset' => '200',
                                                             'type' => '3140'
                                                           },
                                                   '2' => {
                                                            'name' => 'epoch_read',
                                                            'offset' => '8',
                                                            'type' => '973'
                                                          },
                                                   '20' => {
                                                             'name' => 'ext_master_secret',
                                                             'offset' => '204',
                                                             'type' => '962'
                                                           },
                                                   '21' => {
                                                             'name' => 'etm',
                                                             'offset' => '205',
                                                             'type' => '962'
                                                           },
                                                   '22' => {
                                                             'name' => 'do_recv_supplemental',
                                                             'offset' => '208',
                                                             'type' => '75'
                                                           },
                                                   '23' => {
                                                             'name' => 'do_send_supplemental',
                                                             'offset' => '212',
                                                             'type' => '75'
                                                           },
                                                   '24' => {
                                                             'name' => 'pversion',
                                                             'offset' => '216',
                                                             'type' => '11101'
                                                           },
                                                   '3' => {
                                                            'name' => 'epoch_write',
                                                            'offset' => '10',
                                                            'type' => '973'
                                                          },
                                                   '4' => {
                                                            'name' => 'epoch_next',
                                                            'offset' => '12',
                                                            'type' => '973'
                                                          },
                                                   '5' => {
                                                            'name' => 'epoch_min',
                                                            'offset' => '14',
                                                            'type' => '973'
                                                          },
                                                   '6' => {
                                                            'name' => 'cipher_suite',
                                                            'offset' => '16',
                                                            'type' => '11053'
                                                          },
                                                   '7' => {
                                                            'name' => 'compression_method',
                                                            'offset' => '20',
                                                            'type' => '2583'
                                                          },
                                                   '8' => {
                                                            'name' => 'master_secret',
                                                            'offset' => '24',
                                                            'type' => '11069'
                                                          },
                                                   '9' => {
                                                            'name' => 'client_random',
                                                            'offset' => '72',
                                                            'type' => '11085'
                                                          }
                                                 },
                                       'Name' => 'struct security_parameters_st',
                                       'PrivateABI' => 1,
                                       'Size' => '224',
                                       'Type' => 'Struct'
                                     },
                          '11157' => {
                                       'BaseType' => '145',
                                       'Name' => 'unsigned int[64]',
                                       'Size' => '256',
                                       'Type' => 'Array'
                                     },
                          '11173' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '647',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'priority',
                                                            'offset' => '0',
                                                            'type' => '11157'
                                                          },
                                                   '1' => {
                                                            'name' => 'algorithms',
                                                            'offset' => '256',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct priority_st',
                                       'PrivateABI' => 1,
                                       'Size' => '260',
                                       'Type' => 'Struct'
                                     },
                          '11223' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '654',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SR_DISABLED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SR_UNSAFE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SR_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SR_SAFE',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum safe_renegotiation_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '11235' => {
                                       'BaseType' => '6954',
                                       'Name' => 'bigint_t[2]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '11287' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '722',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dh_params',
                                                            'offset' => '0',
                                                            'type' => '3411'
                                                          },
                                                   '1' => {
                                                            'name' => 'free_dh_params',
                                                            'offset' => '8',
                                                            'type' => '75'
                                                          }
                                                 },
                                       'Name' => 'struct internal_params_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '11478' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '759',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cookie',
                                                            'offset' => '0',
                                                            'type' => '11085'
                                                          },
                                                   '1' => {
                                                            'name' => 'cookie_len',
                                                            'offset' => '32',
                                                            'type' => '962'
                                                          },
                                                   '10' => {
                                                             'name' => 'async_term',
                                                             'offset' => '56',
                                                             'type' => '268'
                                                           },
                                                   '11' => {
                                                             'name' => 'last_retransmit',
                                                             'offset' => '64',
                                                             'type' => '290'
                                                           },
                                                   '12' => {
                                                             'name' => 'packets_dropped',
                                                             'offset' => '80',
                                                             'type' => '145'
                                                           },
                                                   '2' => {
                                                            'name' => 'hsk_write_seq',
                                                            'offset' => '34',
                                                            'type' => '973'
                                                          },
                                                   '3' => {
                                                            'name' => 'hsk_read_seq',
                                                            'offset' => '36',
                                                            'type' => '145'
                                                          },
                                                   '4' => {
                                                            'name' => 'mtu',
                                                            'offset' => '40',
                                                            'type' => '973'
                                                          },
                                                   '5' => {
                                                            'name' => 'flight_init',
                                                            'offset' => '42',
                                                            'type' => '9592'
                                                          },
                                                   '6' => {
                                                            'name' => 'last_flight',
                                                            'offset' => '43',
                                                            'type' => '9592'
                                                          },
                                                   '7' => {
                                                            'name' => 'retrans_timeout_ms',
                                                            'offset' => '44',
                                                            'type' => '145'
                                                          },
                                                   '8' => {
                                                            'name' => 'hsk_hello_verify_requests',
                                                            'offset' => '48',
                                                            'type' => '145'
                                                          },
                                                   '9' => {
                                                            'name' => 'actual_retrans_timeout_ms',
                                                            'offset' => '52',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct dtls_st',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '11490' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '761',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '75'
                                                          },
                                                   '1' => {
                                                            'name' => 'flags',
                                                            'offset' => '4',
                                                            'type' => '75'
                                                          },
                                                   '2' => {
                                                            'name' => 'connect_only',
                                                            'offset' => '8',
                                                            'type' => '9592'
                                                          },
                                                   '3' => {
                                                            'name' => 'connect_addr',
                                                            'offset' => '16',
                                                            'type' => '1261'
                                                          },
                                                   '4' => {
                                                            'name' => 'connect_addrlen',
                                                            'offset' => '144',
                                                            'type' => '1006'
                                                          }
                                                 },
                                       'Name' => 'struct tfo_st',
                                       'PrivateABI' => 1,
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '1152108' => {
                                         'BaseType' => '1152120',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2382',
                                         'Name' => 'gnutls_tdb_store_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1152120' => {
                                         'Name' => 'int(*)(char const*, char const*, char const*, time_t, gnutls_datum_t const*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '110'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '110'
                                                             },
                                                      '3' => {
                                                               'type' => '268'
                                                             },
                                                      '4' => {
                                                               'type' => '4430'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1152161' => {
                                         'BaseType' => '1152173',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2388',
                                         'Name' => 'gnutls_tdb_store_commitment_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1152173' => {
                                         'Name' => 'int(*)(char const*, char const*, char const*, time_t, gnutls_digest_algorithm_t, gnutls_datum_t const*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '110'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '110'
                                                             },
                                                      '3' => {
                                                               'type' => '268'
                                                             },
                                                      '4' => {
                                                               'type' => '2533'
                                                             },
                                                      '5' => {
                                                               'type' => '4430'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1152219' => {
                                         'BaseType' => '1152231',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2399',
                                         'Name' => 'gnutls_tdb_verify_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1152231' => {
                                         'Name' => 'int(*)(char const*, char const*, char const*, gnutls_datum_t const*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '110'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '110'
                                                             },
                                                      '3' => {
                                                               'type' => '4430'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1152267' => {
                                         'BaseType' => '1152279',
                                         'Header' => 'gnutls.h',
                                         'Line' => '2406',
                                         'Name' => 'gnutls_tdb_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1152279' => {
                                         'BaseType' => '1152285',
                                         'Name' => 'struct gnutls_tdb_int*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1152285' => {
                                         'Line' => '38',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'store',
                                                              'offset' => '0',
                                                              'type' => '1152108'
                                                            },
                                                     '1' => {
                                                              'name' => 'cstore',
                                                              'offset' => '8',
                                                              'type' => '1152161'
                                                            },
                                                     '2' => {
                                                              'name' => 'verify',
                                                              'offset' => '16',
                                                              'type' => '1152219'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_tdb_int',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Source' => 'verify-tofu.c',
                                         'Type' => 'Struct'
                                       },
                          '11568' => {
                                       'BaseType' => '11490',
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '767',
                                       'Name' => 'tfo_st',
                                       'Size' => '152',
                                       'Type' => 'Typedef'
                                     },
                          '11580' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '968',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '973'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '5453'
                                                          },
                                                   '2' => {
                                                            'name' => 'set',
                                                            'offset' => '16',
                                                            'type' => '9592'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-gnutls_int.h-968',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '116' => {
                                     'BaseType' => '110',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '1161543' => {
                                         'BaseType' => '1152267',
                                         'Name' => 'gnutls_tdb_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '11629' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '974',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '973'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '5453'
                                                          },
                                                   '2' => {
                                                            'name' => 'set',
                                                            'offset' => '16',
                                                            'type' => '9592'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-gnutls_int.h-974',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '1186648' => {
                                         'BaseType' => '169',
                                         'Header' => 'types.h',
                                         'Line' => '194',
                                         'Name' => 'int8_t',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '1191078' => {
                                         'BaseType' => '1191089',
                                         'Header' => 'tpm.h',
                                         'Line' => '36',
                                         'Name' => 'gnutls_tpm_key_list_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1191089' => {
                                         'BaseType' => '1191095',
                                         'Name' => 'struct tpm_key_list_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1191095' => {
                                         'Line' => '186',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'size',
                                                              'offset' => '0',
                                                              'type' => '1201507'
                                                            },
                                                     '1' => {
                                                              'name' => 'ki',
                                                              'offset' => '8',
                                                              'type' => '1203117'
                                                            },
                                                     '2' => {
                                                              'name' => 'tpm_ctx',
                                                              'offset' => '16',
                                                              'type' => '1201568'
                                                            }
                                                   },
                                         'Name' => 'struct tpm_key_list_st',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Source' => 'tpm.c',
                                         'Type' => 'Struct'
                                       },
                          '1191174' => {
                                         'Header' => 'tpm.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_RAW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_DER',
                                                              'value' => '0'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_CTK_PEM',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_tpmkey_fmt_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1192' => {
                                      'BaseType' => '103',
                                      'Header' => 'sockaddr.h',
                                      'Line' => '28',
                                      'Name' => 'sa_family_t',
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1201474' => {
                                         'BaseType' => '962',
                                         'Header' => 'platform.h',
                                         'Line' => '17',
                                         'Name' => 'BYTE',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '1201485' => {
                                         'BaseType' => '1186648',
                                         'Header' => 'platform.h',
                                         'Line' => '18',
                                         'Name' => 'TSS_BOOL',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '1201496' => {
                                         'BaseType' => '973',
                                         'Header' => 'platform.h',
                                         'Line' => '19',
                                         'Name' => 'UINT16',
                                         'Size' => '2',
                                         'Type' => 'Typedef'
                                       },
                          '1201507' => {
                                         'BaseType' => '984',
                                         'Header' => 'platform.h',
                                         'Line' => '20',
                                         'Name' => 'UINT32',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1201529' => {
                                         'BaseType' => '1201474',
                                         'Name' => 'BYTE*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1201535' => {
                                         'BaseType' => '1201507',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '17',
                                         'Name' => 'TSS_FLAG',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1201557' => {
                                         'BaseType' => '1201507',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '20',
                                         'Name' => 'TSS_HOBJECT',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1201568' => {
                                         'BaseType' => '1201557',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '21',
                                         'Name' => 'TSS_HCONTEXT',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1201634' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '14',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'bMajor',
                                                              'offset' => '0',
                                                              'type' => '1201474'
                                                            },
                                                     '1' => {
                                                              'name' => 'bMinor',
                                                              'offset' => '1',
                                                              'type' => '1201474'
                                                            },
                                                     '2' => {
                                                              'name' => 'bRevMajor',
                                                              'offset' => '2',
                                                              'type' => '1201474'
                                                            },
                                                     '3' => {
                                                              'name' => 'bRevMinor',
                                                              'offset' => '3',
                                                              'type' => '1201474'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_VERSION',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Struct'
                                       },
                          '1201695' => {
                                         'BaseType' => '1201634',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '20',
                                         'Name' => 'TSS_VERSION',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1201706' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '62',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ulTimeLow',
                                                              'offset' => '0',
                                                              'type' => '1201507'
                                                            },
                                                     '1' => {
                                                              'name' => 'usTimeMid',
                                                              'offset' => '4',
                                                              'type' => '1201496'
                                                            },
                                                     '2' => {
                                                              'name' => 'usTimeHigh',
                                                              'offset' => '6',
                                                              'type' => '1201496'
                                                            },
                                                     '3' => {
                                                              'name' => 'bClockSeqHigh',
                                                              'offset' => '8',
                                                              'type' => '1201474'
                                                            },
                                                     '4' => {
                                                              'name' => 'bClockSeqLow',
                                                              'offset' => '9',
                                                              'type' => '1201474'
                                                            },
                                                     '5' => {
                                                              'name' => 'rgbNode',
                                                              'offset' => '10',
                                                              'type' => '1201791'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_UUID',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1201791' => {
                                         'BaseType' => '1201474',
                                         'Name' => 'BYTE[6]',
                                         'Size' => '6',
                                         'Type' => 'Array'
                                       },
                          '1201807' => {
                                         'BaseType' => '1201706',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '70',
                                         'Name' => 'TSS_UUID',
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '1201823' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '87',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'versionInfo',
                                                              'offset' => '0',
                                                              'type' => '1201695'
                                                            },
                                                     '1' => {
                                                              'name' => 'keyUUID',
                                                              'offset' => '4',
                                                              'type' => '1201807'
                                                            },
                                                     '2' => {
                                                              'name' => 'parentKeyUUID',
                                                              'offset' => '20',
                                                              'type' => '1201807'
                                                            },
                                                     '3' => {
                                                              'name' => 'bAuthDataUsage',
                                                              'offset' => '36',
                                                              'type' => '1201474'
                                                            },
                                                     '4' => {
                                                              'name' => 'persistentStorageType',
                                                              'offset' => '40',
                                                              'type' => '1201535'
                                                            },
                                                     '5' => {
                                                              'name' => 'persistentStorageTypeParent',
                                                              'offset' => '44',
                                                              'type' => '1201535'
                                                            },
                                                     '6' => {
                                                              'name' => 'fIsLoaded',
                                                              'offset' => '48',
                                                              'type' => '1201485'
                                                            },
                                                     '7' => {
                                                              'name' => 'ulVendorDataLength',
                                                              'offset' => '52',
                                                              'type' => '1201507'
                                                            },
                                                     '8' => {
                                                              'name' => 'rgbVendorData',
                                                              'offset' => '56',
                                                              'type' => '1201529'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_KM_KEYINFO2',
                                         'PrivateABI' => 1,
                                         'Size' => '64',
                                         'Type' => 'Struct'
                                       },
                          '1201944' => {
                                         'BaseType' => '1201823',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '101',
                                         'Name' => 'TSS_KM_KEYINFO2',
                                         'Size' => '64',
                                         'Type' => 'Typedef'
                                       },
                          '1203' => {
                                      'Header' => 'socket.h',
                                      'Line' => '170',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa_family',
                                                           'offset' => '0',
                                                           'type' => '1192'
                                                         },
                                                  '1' => {
                                                           'name' => 'sa_data',
                                                           'offset' => '2',
                                                           'type' => '1245'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1203117' => {
                                         'BaseType' => '1201944',
                                         'Name' => 'TSS_KM_KEYINFO2*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1205247' => {
                                         'BaseType' => '1191078',
                                         'Name' => 'gnutls_tpm_key_list_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '121' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1245' => {
                                      'BaseType' => '121',
                                      'Name' => 'char[14]',
                                      'Size' => '14',
                                      'Type' => 'Array'
                                    },
                          '1261' => {
                                      'Header' => 'socket.h',
                                      'Line' => '183',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ss_family',
                                                           'offset' => '0',
                                                           'type' => '1192'
                                                         },
                                                  '1' => {
                                                           'name' => '__ss_padding',
                                                           'offset' => '2',
                                                           'type' => '1310'
                                                         },
                                                  '2' => {
                                                           'name' => '__ss_align',
                                                           'offset' => '120',
                                                           'type' => '68'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_storage',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '128' => {
                                     'BaseType' => '121',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1283908' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '1965',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_RANDOM_ART_OPENSSH',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_random_art',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1283932' => {
                                         'BaseType' => '1283908',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1967',
                                         'Name' => 'gnutls_random_art_t',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1306913' => {
                                         'BaseType' => '904559',
                                         'Name' => 'gnutls_custom_url_st const',
                                         'Size' => '64',
                                         'Type' => 'Const'
                                       },
                          '1307508' => {
                                         'BaseType' => '1306913',
                                         'Name' => 'gnutls_custom_url_st const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1310' => {
                                      'BaseType' => '121',
                                      'Name' => 'char[118]',
                                      'Size' => '118',
                                      'Type' => 'Array'
                                    },
                          '13240' => {
                                       'BaseType' => '8654',
                                       'Name' => 'handshake_buffer_st[6]',
                                       'Size' => '432',
                                       'Type' => 'Array'
                                     },
                          '13256' => {
                                       'Header' => 'auth.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'gnutls_generate_server_certificate',
                                                            'offset' => '8',
                                                            'type' => '13605'
                                                          },
                                                   '10' => {
                                                             'name' => 'gnutls_process_client_kx',
                                                             'offset' => '80',
                                                             'type' => '13636'
                                                           },
                                                   '11' => {
                                                             'name' => 'gnutls_process_client_crt_vrfy',
                                                             'offset' => '88',
                                                             'type' => '13636'
                                                           },
                                                   '12' => {
                                                             'name' => 'gnutls_process_server_crt_request',
                                                             'offset' => '96',
                                                             'type' => '13636'
                                                           },
                                                   '2' => {
                                                            'name' => 'gnutls_generate_client_certificate',
                                                            'offset' => '16',
                                                            'type' => '13605'
                                                          },
                                                   '3' => {
                                                            'name' => 'gnutls_generate_server_kx',
                                                            'offset' => '24',
                                                            'type' => '13605'
                                                          },
                                                   '4' => {
                                                            'name' => 'gnutls_generate_client_kx',
                                                            'offset' => '32',
                                                            'type' => '13605'
                                                          },
                                                   '5' => {
                                                            'name' => 'gnutls_generate_client_crt_vrfy',
                                                            'offset' => '40',
                                                            'type' => '13605'
                                                          },
                                                   '6' => {
                                                            'name' => 'gnutls_generate_server_crt_request',
                                                            'offset' => '48',
                                                            'type' => '13605'
                                                          },
                                                   '7' => {
                                                            'name' => 'gnutls_process_server_certificate',
                                                            'offset' => '56',
                                                            'type' => '13636'
                                                          },
                                                   '8' => {
                                                            'name' => 'gnutls_process_client_certificate',
                                                            'offset' => '64',
                                                            'type' => '13636'
                                                          },
                                                   '9' => {
                                                            'name' => 'gnutls_process_server_kx',
                                                            'offset' => '72',
                                                            'type' => '13636'
                                                          }
                                                 },
                                       'Name' => 'struct mod_auth_st_int',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '1326' => {
                                      'BaseType' => '1203',
                                      'Name' => 'struct sockaddr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '13425' => {
                                       'BaseType' => '13256',
                                       'Name' => 'struct mod_auth_st_int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13431' => {
                                       'BaseType' => '973',
                                       'Name' => 'uint16_t[32]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '13447' => {
                                       'BaseType' => '11580',
                                       'Name' => 'anon-struct-gnutls_int.h-968[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '13463' => {
                                       'BaseType' => '11629',
                                       'Name' => 'anon-struct-gnutls_int.h-974[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '13479' => {
                                       'BaseType' => '157',
                                       'Name' => 'unsigned char[36]',
                                       'Size' => '36',
                                       'Type' => 'Array'
                                     },
                          '13495' => {
                                       'BaseType' => '4120',
                                       'Name' => 'gnutls_certificate_verify_function*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13501' => {
                                       'BaseType' => '4246',
                                       'Name' => 'gnutls_typed_vdata_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13507' => {
                                       'BaseType' => '121',
                                       'Name' => 'char[129]',
                                       'Size' => '129',
                                       'Type' => 'Array'
                                     },
                          '13523' => {
                                       'Line' => '52',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '240'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '941681'
                                                          },
                                                   '2' => {
                                                            'name' => 'supp_recv_func',
                                                            'offset' => '16',
                                                            'type' => '943119'
                                                          },
                                                   '3' => {
                                                            'name' => 'supp_send_func',
                                                            'offset' => '24',
                                                            'type' => '943131'
                                                          }
                                                 },
                                       'Name' => 'struct gnutls_supplemental_entry_st',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'supplemental.c',
                                       'Type' => 'Struct'
                                     },
                          '13534' => {
                                       'Header' => 'extensions.h',
                                       'Line' => '63',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'free_struct',
                                                            'offset' => '8',
                                                            'type' => '145'
                                                          },
                                                   '2' => {
                                                            'name' => 'type',
                                                            'offset' => '12',
                                                            'type' => '973'
                                                          },
                                                   '3' => {
                                                            'name' => 'parse_type',
                                                            'offset' => '16',
                                                            'type' => '22733'
                                                          },
                                                   '4' => {
                                                            'name' => 'recv_func',
                                                            'offset' => '24',
                                                            'type' => '22491'
                                                          },
                                                   '5' => {
                                                            'name' => 'send_func',
                                                            'offset' => '32',
                                                            'type' => '22540'
                                                          },
                                                   '6' => {
                                                            'name' => 'deinit_func',
                                                            'offset' => '40',
                                                            'type' => '22578'
                                                          },
                                                   '7' => {
                                                            'name' => 'pack_func',
                                                            'offset' => '48',
                                                            'type' => '22607'
                                                          },
                                                   '8' => {
                                                            'name' => 'unpack_func',
                                                            'offset' => '56',
                                                            'type' => '22645'
                                                          }
                                                 },
                                       'Name' => 'struct extension_entry_st',
                                       'PrivateABI' => 1,
                                       'Size' => '64',
                                       'Type' => 'Struct'
                                     },
                          '13545' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '1062',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_buffer',
                                                            'offset' => '0',
                                                            'type' => '8750'
                                                          },
                                                   '1' => {
                                                            'name' => 'handshake_hash_buffer_prev_len',
                                                            'offset' => '32',
                                                            'type' => '75'
                                                          },
                                                   '10' => {
                                                             'name' => 'may_not_read',
                                                             'offset' => '89',
                                                             'type' => '9592'
                                                           },
                                                   '100' => {
                                                              'name' => 'vc_status',
                                                              'offset' => '5260',
                                                              'type' => '145'
                                                            },
                                                   '101' => {
                                                              'name' => 'additional_verify_flags',
                                                              'offset' => '5264',
                                                              'type' => '145'
                                                            },
                                                   '102' => {
                                                              'name' => 'cert_hash',
                                                              'offset' => '5268',
                                                              'type' => '11085'
                                                            },
                                                   '103' => {
                                                              'name' => 'cert_hash_set',
                                                              'offset' => '5300',
                                                              'type' => '9592'
                                                            },
                                                   '104' => {
                                                              'name' => 'saved_username',
                                                              'offset' => '5301',
                                                              'type' => '13507'
                                                            },
                                                   '105' => {
                                                              'name' => 'saved_username_set',
                                                              'offset' => '5430',
                                                              'type' => '9592'
                                                            },
                                                   '106' => {
                                                              'name' => 'false_start_used',
                                                              'offset' => '5431',
                                                              'type' => '9592'
                                                            },
                                                   '107' => {
                                                              'name' => 'tfo',
                                                              'offset' => '5432',
                                                              'type' => '11568'
                                                            },
                                                   '108' => {
                                                              'name' => 'rsup',
                                                              'offset' => '5584',
                                                              'type' => '951476'
                                                            },
                                                   '109' => {
                                                              'name' => 'rsup_size',
                                                              'offset' => '5592',
                                                              'type' => '145'
                                                            },
                                                   '11' => {
                                                             'name' => 'may_not_write',
                                                             'offset' => '90',
                                                             'type' => '9592'
                                                           },
                                                   '110' => {
                                                              'name' => 'rexts',
                                                              'offset' => '5600',
                                                              'type' => '418654'
                                                            },
                                                   '111' => {
                                                              'name' => 'rexts_size',
                                                              'offset' => '5608',
                                                              'type' => '145'
                                                            },
                                                   '12' => {
                                                             'name' => 'read_eof',
                                                             'offset' => '91',
                                                             'type' => '9592'
                                                           },
                                                   '13' => {
                                                             'name' => 'last_alert',
                                                             'offset' => '92',
                                                             'type' => '75'
                                                           },
                                                   '14' => {
                                                             'name' => 'last_handshake_in',
                                                             'offset' => '96',
                                                             'type' => '75'
                                                           },
                                                   '15' => {
                                                             'name' => 'last_handshake_out',
                                                             'offset' => '100',
                                                             'type' => '75'
                                                           },
                                                   '16' => {
                                                             'name' => 'priorities',
                                                             'offset' => '104',
                                                             'type' => '3469'
                                                           },
                                                   '17' => {
                                                             'name' => 'resumed',
                                                             'offset' => '2224',
                                                             'type' => '9592'
                                                           },
                                                   '18' => {
                                                             'name' => 'resumption_requested',
                                                             'offset' => '2225',
                                                             'type' => '9592'
                                                           },
                                                   '19' => {
                                                             'name' => 'resumed_security_parameters',
                                                             'offset' => '2232',
                                                             'type' => '11107'
                                                           },
                                                   '2' => {
                                                            'name' => 'handshake_hash_buffer_client_kx_len',
                                                            'offset' => '36',
                                                            'type' => '145'
                                                          },
                                                   '20' => {
                                                             'name' => 'resumption_data',
                                                             'offset' => '2456',
                                                             'type' => '3887'
                                                           },
                                                   '21' => {
                                                             'name' => 'handshake_send_buffer',
                                                             'offset' => '2472',
                                                             'type' => '8750'
                                                           },
                                                   '22' => {
                                                             'name' => 'handshake_recv_buffer',
                                                             'offset' => '2504',
                                                             'type' => '13240'
                                                           },
                                                   '23' => {
                                                             'name' => 'handshake_recv_buffer_size',
                                                             'offset' => '2936',
                                                             'type' => '75'
                                                           },
                                                   '24' => {
                                                             'name' => 'record_recv_buffer',
                                                             'offset' => '2944',
                                                             'type' => '8750'
                                                           },
                                                   '25' => {
                                                             'name' => 'record_send_buffer',
                                                             'offset' => '2976',
                                                             'type' => '8750'
                                                           },
                                                   '26' => {
                                                             'name' => 'record_send_buffer_user_size',
                                                             'offset' => '3008',
                                                             'type' => '52'
                                                           },
                                                   '27' => {
                                                             'name' => 'record_flush_mode',
                                                             'offset' => '3016',
                                                             'type' => '5907'
                                                           },
                                                   '28' => {
                                                             'name' => 'record_presend_buffer',
                                                             'offset' => '3024',
                                                             'type' => '8364'
                                                           },
                                                   '29' => {
                                                             'name' => 'expire_time',
                                                             'offset' => '3056',
                                                             'type' => '268'
                                                           },
                                                   '3' => {
                                                            'name' => 'handshake_hash_buffer',
                                                            'offset' => '40',
                                                            'type' => '8364'
                                                          },
                                                   '30' => {
                                                             'name' => 'auth_struct',
                                                             'offset' => '3064',
                                                             'type' => '13425'
                                                           },
                                                   '31' => {
                                                             'name' => 'adv_version_major',
                                                             'offset' => '3072',
                                                             'type' => '962'
                                                           },
                                                   '32' => {
                                                             'name' => 'adv_version_minor',
                                                             'offset' => '3073',
                                                             'type' => '962'
                                                           },
                                                   '33' => {
                                                             'name' => 'send_cert_req',
                                                             'offset' => '3076',
                                                             'type' => '145'
                                                           },
                                                   '34' => {
                                                             'name' => 'max_handshake_data_buffer_size',
                                                             'offset' => '3080',
                                                             'type' => '52'
                                                           },
                                                   '35' => {
                                                             'name' => 'pull_timeout_func',
                                                             'offset' => '3088',
                                                             'type' => '5008'
                                                           },
                                                   '36' => {
                                                             'name' => 'pull_func',
                                                             'offset' => '3096',
                                                             'type' => '4922'
                                                           },
                                                   '37' => {
                                                             'name' => 'push_func',
                                                             'offset' => '3104',
                                                             'type' => '4965'
                                                           },
                                                   '38' => {
                                                             'name' => 'vec_push_func',
                                                             'offset' => '3112',
                                                             'type' => '5046'
                                                           },
                                                   '39' => {
                                                             'name' => 'errno_func',
                                                             'offset' => '3120',
                                                             'type' => '5095'
                                                           },
                                                   '4' => {
                                                            'name' => 'resumable',
                                                            'offset' => '72',
                                                            'type' => '9592'
                                                          },
                                                   '40' => {
                                                             'name' => 'transport_recv_ptr',
                                                             'offset' => '3128',
                                                             'type' => '3312'
                                                           },
                                                   '41' => {
                                                             'name' => 'transport_send_ptr',
                                                             'offset' => '3136',
                                                             'type' => '3312'
                                                           },
                                                   '42' => {
                                                             'name' => 'db_store_func',
                                                             'offset' => '3144',
                                                             'type' => '4258'
                                                           },
                                                   '43' => {
                                                             'name' => 'db_retrieve_func',
                                                             'offset' => '3152',
                                                             'type' => '4339'
                                                           },
                                                   '44' => {
                                                             'name' => 'db_remove_func',
                                                             'offset' => '3160',
                                                             'type' => '4301'
                                                           },
                                                   '45' => {
                                                             'name' => 'db_ptr',
                                                             'offset' => '3168',
                                                             'type' => '216'
                                                           },
                                                   '46' => {
                                                             'name' => 'user_hello_func',
                                                             'offset' => '3176',
                                                             'type' => '4436'
                                                           },
                                                   '47' => {
                                                             'name' => 'h_hook',
                                                             'offset' => '3184',
                                                             'type' => '4377'
                                                           },
                                                   '48' => {
                                                             'name' => 'h_type',
                                                             'offset' => '3192',
                                                             'type' => '145'
                                                           },
                                                   '49' => {
                                                             'name' => 'h_post',
                                                             'offset' => '3196',
                                                             'type' => '279'
                                                           },
                                                   '5' => {
                                                            'name' => 'ticket_sent',
                                                            'offset' => '73',
                                                            'type' => '9592'
                                                          },
                                                   '50' => {
                                                             'name' => 'selected_cert_list',
                                                             'offset' => '3200',
                                                             'type' => '5584'
                                                           },
                                                   '51' => {
                                                             'name' => 'selected_cert_list_length',
                                                             'offset' => '3208',
                                                             'type' => '279'
                                                           },
                                                   '52' => {
                                                             'name' => 'selected_key',
                                                             'offset' => '3216',
                                                             'type' => '4477'
                                                           },
                                                   '53' => {
                                                             'name' => 'selected_need_free',
                                                             'offset' => '3224',
                                                             'type' => '9592'
                                                           },
                                                   '54' => {
                                                             'name' => 'selected_ocsp_func',
                                                             'offset' => '3232',
                                                             'type' => '4488'
                                                           },
                                                   '55' => {
                                                             'name' => 'selected_ocsp_func_ptr',
                                                             'offset' => '3240',
                                                             'type' => '216'
                                                           },
                                                   '56' => {
                                                             'name' => 'extensions_sent',
                                                             'offset' => '3248',
                                                             'type' => '13431'
                                                           },
                                                   '57' => {
                                                             'name' => 'extensions_sent_size',
                                                             'offset' => '3312',
                                                             'type' => '973'
                                                           },
                                                   '58' => {
                                                             'name' => 'pgp_fingerprint',
                                                             'offset' => '3314',
                                                             'type' => '9592'
                                                           },
                                                   '59' => {
                                                             'name' => 'default_record_version',
                                                             'offset' => '3315',
                                                             'type' => '11053'
                                                           },
                                                   '6' => {
                                                            'name' => 'bye_state',
                                                            'offset' => '76',
                                                            'type' => '8161'
                                                          },
                                                   '60' => {
                                                             'name' => 'default_hello_version',
                                                             'offset' => '3317',
                                                             'type' => '11053'
                                                           },
                                                   '61' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '3320',
                                                             'type' => '216'
                                                           },
                                                   '62' => {
                                                             'name' => 'enable_private',
                                                             'offset' => '3328',
                                                             'type' => '9592'
                                                           },
                                                   '63' => {
                                                             'name' => 'direction',
                                                             'offset' => '3329',
                                                             'type' => '9592'
                                                           },
                                                   '64' => {
                                                             'name' => 'openpgp_recv_key_func',
                                                             'offset' => '3336',
                                                             'type' => '5471'
                                                           },
                                                   '65' => {
                                                             'name' => 'ignore_rdn_sequence',
                                                             'offset' => '3344',
                                                             'type' => '9592'
                                                           },
                                                   '66' => {
                                                             'name' => 'rsa_pms_version',
                                                             'offset' => '3345',
                                                             'type' => '11053'
                                                           },
                                                   '67' => {
                                                             'name' => 'params',
                                                             'offset' => '3352',
                                                             'type' => '11287'
                                                           },
                                                   '68' => {
                                                             'name' => 'errnum',
                                                             'offset' => '3368',
                                                             'type' => '75'
                                                           },
                                                   '69' => {
                                                             'name' => 'srp_prime_bits',
                                                             'offset' => '3372',
                                                             'type' => '973'
                                                           },
                                                   '7' => {
                                                            'name' => 'handshake_final_state',
                                                            'offset' => '80',
                                                            'type' => '8115'
                                                          },
                                                   '70' => {
                                                             'name' => 'initial_negotiation_completed',
                                                             'offset' => '3374',
                                                             'type' => '9592'
                                                           },
                                                   '71' => {
                                                             'name' => 'extension_int_data',
                                                             'offset' => '3376',
                                                             'type' => '13447'
                                                           },
                                                   '72' => {
                                                             'name' => 'resumed_extension_int_data',
                                                             'offset' => '4144',
                                                             'type' => '13463'
                                                           },
                                                   '73' => {
                                                             'name' => 'transport',
                                                             'offset' => '4912',
                                                             'type' => '5867'
                                                           },
                                                   '74' => {
                                                             'name' => 'dtls',
                                                             'offset' => '4920',
                                                             'type' => '11478'
                                                           },
                                                   '75' => {
                                                             'name' => 'handshake_suspicious_loops',
                                                             'offset' => '5008',
                                                             'type' => '145'
                                                           },
                                                   '76' => {
                                                             'name' => 'handshake_in_progress',
                                                             'offset' => '5012',
                                                             'type' => '9592'
                                                           },
                                                   '77' => {
                                                             'name' => 'premaster_set',
                                                             'offset' => '5013',
                                                             'type' => '9592'
                                                           },
                                                   '78' => {
                                                             'name' => 'cb_tls_unique_len',
                                                             'offset' => '5016',
                                                             'type' => '145'
                                                           },
                                                   '79' => {
                                                             'name' => 'cb_tls_unique',
                                                             'offset' => '5020',
                                                             'type' => '13479'
                                                           },
                                                   '8' => {
                                                            'name' => 'handshake_state',
                                                            'offset' => '84',
                                                            'type' => '8115'
                                                          },
                                                   '80' => {
                                                             'name' => 'handshake_start_time',
                                                             'offset' => '5056',
                                                             'type' => '290'
                                                           },
                                                   '81' => {
                                                             'name' => 'handshake_endtime',
                                                             'offset' => '5072',
                                                             'type' => '268'
                                                           },
                                                   '82' => {
                                                             'name' => 'handshake_timeout_ms',
                                                             'offset' => '5080',
                                                             'type' => '145'
                                                           },
                                                   '83' => {
                                                             'name' => 'record_timeout_ms',
                                                             'offset' => '5084',
                                                             'type' => '145'
                                                           },
                                                   '84' => {
                                                             'name' => 'hb_local_data',
                                                             'offset' => '5088',
                                                             'type' => '8364'
                                                           },
                                                   '85' => {
                                                             'name' => 'hb_remote_data',
                                                             'offset' => '5120',
                                                             'type' => '8364'
                                                           },
                                                   '86' => {
                                                             'name' => 'hb_ping_start',
                                                             'offset' => '5152',
                                                             'type' => '290'
                                                           },
                                                   '87' => {
                                                             'name' => 'hb_ping_sent',
                                                             'offset' => '5168',
                                                             'type' => '290'
                                                           },
                                                   '88' => {
                                                             'name' => 'hb_actual_retrans_timeout_ms',
                                                             'offset' => '5184',
                                                             'type' => '145'
                                                           },
                                                   '89' => {
                                                             'name' => 'hb_retrans_timeout_ms',
                                                             'offset' => '5188',
                                                             'type' => '145'
                                                           },
                                                   '9' => {
                                                            'name' => 'invalid_connection',
                                                            'offset' => '88',
                                                            'type' => '9592'
                                                          },
                                                   '90' => {
                                                             'name' => 'hb_total_timeout_ms',
                                                             'offset' => '5192',
                                                             'type' => '145'
                                                           },
                                                   '91' => {
                                                             'name' => 'ocsp_check_ok',
                                                             'offset' => '5196',
                                                             'type' => '9592'
                                                           },
                                                   '92' => {
                                                             'name' => 'hb_state',
                                                             'offset' => '5200',
                                                             'type' => '8207'
                                                           },
                                                   '93' => {
                                                             'name' => 'recv_state',
                                                             'offset' => '5204',
                                                             'type' => '8259'
                                                           },
                                                   '94' => {
                                                             'name' => 'sc_random_set',
                                                             'offset' => '5208',
                                                             'type' => '9592'
                                                           },
                                                   '95' => {
                                                             'name' => 'flags',
                                                             'offset' => '5212',
                                                             'type' => '145'
                                                           },
                                                   '96' => {
                                                             'name' => 'verify_callback',
                                                             'offset' => '5216',
                                                             'type' => '13495'
                                                           },
                                                   '97' => {
                                                             'name' => 'vc_data',
                                                             'offset' => '5224',
                                                             'type' => '13501'
                                                           },
                                                   '98' => {
                                                             'name' => 'vc_sdata',
                                                             'offset' => '5232',
                                                             'type' => '4246'
                                                           },
                                                   '99' => {
                                                             'name' => 'vc_elements',
                                                             'offset' => '5256',
                                                             'type' => '145'
                                                           }
                                                 },
                                       'Name' => 'struct internals_st',
                                       'PrivateABI' => 1,
                                       'Size' => '5616',
                                       'Type' => 'Struct'
                                     },
                          '13557' => {
                                       'BaseType' => '13573',
                                       'Name' => 'record_parameters_st*[16]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '13573' => {
                                       'BaseType' => '9264',
                                       'Name' => 'record_parameters_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13599' => {
                                       'BaseType' => '8364',
                                       'Name' => 'gnutls_buffer_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '13605' => {
                                       'Name' => 'int(*)(gnutls_session_t, gnutls_buffer_st*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3324'
                                                           },
                                                    '1' => {
                                                             'type' => '13599'
                                                           }
                                                  },
                                       'Return' => '75',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '13636' => {
                                       'Name' => 'int(*)(gnutls_session_t, uint8_t*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3324'
                                                           },
                                                    '1' => {
                                                             'type' => '8358'
                                                           },
                                                    '2' => {
                                                             'type' => '52'
                                                           }
                                                  },
                                       'Return' => '75',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1434286' => {
                                         'BaseType' => '1434297',
                                         'Header' => 'system-keys.h',
                                         'Line' => '41',
                                         'Name' => 'gnutls_system_key_iter_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1434297' => {
                                         'BaseType' => '1434303',
                                         'Name' => 'struct system_key_iter_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1434303' => {
                                         'Name' => 'struct system_key_iter_st',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1434724' => {
                                         'BaseType' => '1434286',
                                         'Name' => 'gnutls_system_key_iter_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1441512' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '166',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_GENERIC',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_LIB',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_LIB_VERSION',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_url_type_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1441597' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '292',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_ID_HEX',
                                                              'value' => '1'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LABEL',
                                                              'value' => '2'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_LABEL',
                                                              'value' => '3'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_SERIAL',
                                                              'value' => '4'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_MANUFACTURER',
                                                              'value' => '5'
                                                            },
                                                     '5' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_MODEL',
                                                              'value' => '6'
                                                            },
                                                     '6' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_ID',
                                                              'value' => '7'
                                                            },
                                                     '7' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_VERSION',
                                                              'value' => '8'
                                                            },
                                                     '8' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_DESCRIPTION',
                                                              'value' => '9'
                                                            },
                                                     '9' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_MANUFACTURER',
                                                              'value' => '10'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_obj_info_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1441653' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '327',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_LABEL',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_SERIAL',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MANUFACTURER',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MODEL',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MODNAME',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_token_info_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '145' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1450487' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '186',
                                         'Name' => 'ck_flags_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1450498' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '188',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'major',
                                                              'offset' => '0',
                                                              'type' => '157'
                                                            },
                                                     '1' => {
                                                              'name' => 'minor',
                                                              'offset' => '1',
                                                              'type' => '157'
                                                            }
                                                   },
                                         'Name' => 'struct ck_version',
                                         'Size' => '2',
                                         'Type' => 'Struct'
                                       },
                          '1450535' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '195',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'cryptoki_version',
                                                              'offset' => '0',
                                                              'type' => '1450498'
                                                            },
                                                     '1' => {
                                                              'name' => 'manufacturer_id',
                                                              'offset' => '2',
                                                              'type' => '1450608'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '40',
                                                              'type' => '1450487'
                                                            },
                                                     '3' => {
                                                              'name' => 'library_description',
                                                              'offset' => '48',
                                                              'type' => '1450608'
                                                            },
                                                     '4' => {
                                                              'name' => 'library_version',
                                                              'offset' => '80',
                                                              'type' => '1450498'
                                                            }
                                                   },
                                         'Name' => 'struct ck_info',
                                         'Size' => '88',
                                         'Type' => 'Struct'
                                       },
                          '1450608' => {
                                         'BaseType' => '157',
                                         'Name' => 'unsigned char[32]',
                                         'Size' => '32',
                                         'Type' => 'Array'
                                       },
                          '1450624' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '205',
                                         'Name' => 'ck_notification_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1450635' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '210',
                                         'Name' => 'ck_slot_id_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1450646' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '213',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'slot_description',
                                                              'offset' => '0',
                                                              'type' => '1450719'
                                                            },
                                                     '1' => {
                                                              'name' => 'manufacturer_id',
                                                              'offset' => '64',
                                                              'type' => '1450608'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '96',
                                                              'type' => '1450487'
                                                            },
                                                     '3' => {
                                                              'name' => 'hardware_version',
                                                              'offset' => '104',
                                                              'type' => '1450498'
                                                            },
                                                     '4' => {
                                                              'name' => 'firmware_version',
                                                              'offset' => '106',
                                                              'type' => '1450498'
                                                            }
                                                   },
                                         'Name' => 'struct ck_slot_info',
                                         'Size' => '112',
                                         'Type' => 'Struct'
                                       },
                          '1450719' => {
                                         'BaseType' => '157',
                                         'Name' => 'unsigned char[64]',
                                         'Size' => '64',
                                         'Type' => 'Array'
                                       },
                          '1450735' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '229',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'label',
                                                              'offset' => '0',
                                                              'type' => '1450608'
                                                            },
                                                     '1' => {
                                                              'name' => 'manufacturer_id',
                                                              'offset' => '32',
                                                              'type' => '1450608'
                                                            },
                                                     '10' => {
                                                               'name' => 'min_pin_len',
                                                               'offset' => '144',
                                                               'type' => '68'
                                                             },
                                                     '11' => {
                                                               'name' => 'total_public_memory',
                                                               'offset' => '152',
                                                               'type' => '68'
                                                             },
                                                     '12' => {
                                                               'name' => 'free_public_memory',
                                                               'offset' => '160',
                                                               'type' => '68'
                                                             },
                                                     '13' => {
                                                               'name' => 'total_private_memory',
                                                               'offset' => '168',
                                                               'type' => '68'
                                                             },
                                                     '14' => {
                                                               'name' => 'free_private_memory',
                                                               'offset' => '176',
                                                               'type' => '68'
                                                             },
                                                     '15' => {
                                                               'name' => 'hardware_version',
                                                               'offset' => '184',
                                                               'type' => '1450498'
                                                             },
                                                     '16' => {
                                                               'name' => 'firmware_version',
                                                               'offset' => '186',
                                                               'type' => '1450498'
                                                             },
                                                     '17' => {
                                                               'name' => 'utc_time',
                                                               'offset' => '188',
                                                               'type' => '1450964'
                                                             },
                                                     '2' => {
                                                              'name' => 'model',
                                                              'offset' => '64',
                                                              'type' => '1450964'
                                                            },
                                                     '3' => {
                                                              'name' => 'serial_number',
                                                              'offset' => '80',
                                                              'type' => '1450964'
                                                            },
                                                     '4' => {
                                                              'name' => 'flags',
                                                              'offset' => '96',
                                                              'type' => '1450487'
                                                            },
                                                     '5' => {
                                                              'name' => 'max_session_count',
                                                              'offset' => '104',
                                                              'type' => '68'
                                                            },
                                                     '6' => {
                                                              'name' => 'session_count',
                                                              'offset' => '112',
                                                              'type' => '68'
                                                            },
                                                     '7' => {
                                                              'name' => 'max_rw_session_count',
                                                              'offset' => '120',
                                                              'type' => '68'
                                                            },
                                                     '8' => {
                                                              'name' => 'rw_session_count',
                                                              'offset' => '128',
                                                              'type' => '68'
                                                            },
                                                     '9' => {
                                                              'name' => 'max_pin_len',
                                                              'offset' => '136',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_token_info',
                                         'Size' => '208',
                                         'Type' => 'Struct'
                                       },
                          '1450964' => {
                                         'BaseType' => '157',
                                         'Name' => 'unsigned char[16]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1450980' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '275',
                                         'Name' => 'ck_session_handle_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1450992' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '280',
                                         'Name' => 'ck_user_type_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451004' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '287',
                                         'Name' => 'ck_state_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451016' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '296',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'slot_id',
                                                              'offset' => '0',
                                                              'type' => '1450635'
                                                            },
                                                     '1' => {
                                                              'name' => 'state',
                                                              'offset' => '8',
                                                              'type' => '1451004'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '16',
                                                              'type' => '1450487'
                                                            },
                                                     '3' => {
                                                              'name' => 'device_error',
                                                              'offset' => '24',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_session_info',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1451082' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '308',
                                         'Name' => 'ck_object_handle_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451130' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '370',
                                         'Name' => 'ck_attribute_type_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451142' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '459',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '1451130'
                                                            },
                                                     '1' => {
                                                              'name' => 'value',
                                                              'offset' => '8',
                                                              'type' => '216'
                                                            },
                                                     '2' => {
                                                              'name' => 'value_len',
                                                              'offset' => '16',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_attribute',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1451195' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '475',
                                         'Name' => 'ck_mechanism_type_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451207' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '719',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'mechanism',
                                                              'offset' => '0',
                                                              'type' => '1451195'
                                                            },
                                                     '1' => {
                                                              'name' => 'parameter',
                                                              'offset' => '8',
                                                              'type' => '216'
                                                            },
                                                     '2' => {
                                                              'name' => 'parameter_len',
                                                              'offset' => '16',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_mechanism',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1451260' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '727',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'min_key_size',
                                                              'offset' => '0',
                                                              'type' => '68'
                                                            },
                                                     '1' => {
                                                              'name' => 'max_key_size',
                                                              'offset' => '8',
                                                              'type' => '68'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '16',
                                                              'type' => '1450487'
                                                            }
                                                   },
                                         'Name' => 'struct ck_mechanism_info',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1451313' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '754',
                                         'Name' => 'ck_rv_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451325' => {
                                         'BaseType' => '1451337',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '757',
                                         'Name' => 'ck_notify_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451337' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_notification_t, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1450624'
                                                             },
                                                      '2' => {
                                                               'type' => '216'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1451368' => {
                                         'BaseType' => '1451380',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '767',
                                         'Name' => 'CK_C_Initialize',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451380' => {
                                         'Name' => 'ck_rv_t(*)(void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '216'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1451401' => {
                                         'BaseType' => '1451380',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '768',
                                         'Name' => 'CK_C_Finalize',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451413' => {
                                         'BaseType' => '1451425',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '769',
                                         'Name' => 'CK_C_GetInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451425' => {
                                         'Name' => 'ck_rv_t(*)(struct ck_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1451446'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1451446' => {
                                         'BaseType' => '1450535',
                                         'Name' => 'struct ck_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1451452' => {
                                         'BaseType' => '1451464',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '770',
                                         'Name' => 'CK_C_GetFunctionList',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1451464' => {
                                         'Name' => 'ck_rv_t(*)(struct ck_function_list**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1451485'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1451485' => {
                                         'BaseType' => '1451491',
                                         'Name' => 'struct ck_function_list**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1451491' => {
                                         'BaseType' => '1451497',
                                         'Name' => 'struct ck_function_list*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1451497' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1044',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'version',
                                                              'offset' => '0',
                                                              'type' => '1450498'
                                                            },
                                                     '1' => {
                                                              'name' => 'C_Initialize',
                                                              'offset' => '8',
                                                              'type' => '1451368'
                                                            },
                                                     '10' => {
                                                               'name' => 'C_InitToken',
                                                               'offset' => '80',
                                                               'type' => '1452730'
                                                             },
                                                     '11' => {
                                                               'name' => 'C_InitPIN',
                                                               'offset' => '88',
                                                               'type' => '1452778'
                                                             },
                                                     '12' => {
                                                               'name' => 'C_SetPIN',
                                                               'offset' => '96',
                                                               'type' => '1452821'
                                                             },
                                                     '13' => {
                                                               'name' => 'C_OpenSession',
                                                               'offset' => '104',
                                                               'type' => '1452874'
                                                             },
                                                     '14' => {
                                                               'name' => 'C_CloseSession',
                                                               'offset' => '112',
                                                               'type' => '1452933'
                                                             },
                                                     '15' => {
                                                               'name' => 'C_CloseAllSessions',
                                                               'offset' => '120',
                                                               'type' => '1452966'
                                                             },
                                                     '16' => {
                                                               'name' => 'C_GetSessionInfo',
                                                               'offset' => '128',
                                                               'type' => '1452999'
                                                             },
                                                     '17' => {
                                                               'name' => 'C_GetOperationState',
                                                               'offset' => '136',
                                                               'type' => '1453043'
                                                             },
                                                     '18' => {
                                                               'name' => 'C_SetOperationState',
                                                               'offset' => '144',
                                                               'type' => '1453086'
                                                             },
                                                     '19' => {
                                                               'name' => 'C_Login',
                                                               'offset' => '152',
                                                               'type' => '1453139'
                                                             },
                                                     '2' => {
                                                              'name' => 'C_Finalize',
                                                              'offset' => '16',
                                                              'type' => '1451401'
                                                            },
                                                     '20' => {
                                                               'name' => 'C_Logout',
                                                               'offset' => '160',
                                                               'type' => '1453187'
                                                             },
                                                     '21' => {
                                                               'name' => 'C_CreateObject',
                                                               'offset' => '168',
                                                               'type' => '1453199'
                                                             },
                                                     '22' => {
                                                               'name' => 'C_CopyObject',
                                                               'offset' => '176',
                                                               'type' => '1453259'
                                                             },
                                                     '23' => {
                                                               'name' => 'C_DestroyObject',
                                                               'offset' => '184',
                                                               'type' => '1453312'
                                                             },
                                                     '24' => {
                                                               'name' => 'C_GetObjectSize',
                                                               'offset' => '192',
                                                               'type' => '1453350'
                                                             },
                                                     '25' => {
                                                               'name' => 'C_GetAttributeValue',
                                                               'offset' => '200',
                                                               'type' => '1453393'
                                                             },
                                                     '26' => {
                                                               'name' => 'C_SetAttributeValue',
                                                               'offset' => '208',
                                                               'type' => '1453441'
                                                             },
                                                     '27' => {
                                                               'name' => 'C_FindObjectsInit',
                                                               'offset' => '216',
                                                               'type' => '1453453'
                                                             },
                                                     '28' => {
                                                               'name' => 'C_FindObjects',
                                                               'offset' => '224',
                                                               'type' => '1453496'
                                                             },
                                                     '29' => {
                                                               'name' => 'C_FindObjectsFinal',
                                                               'offset' => '232',
                                                               'type' => '1453544'
                                                             },
                                                     '3' => {
                                                              'name' => 'C_GetInfo',
                                                              'offset' => '24',
                                                              'type' => '1451413'
                                                            },
                                                     '30' => {
                                                               'name' => 'C_EncryptInit',
                                                               'offset' => '240',
                                                               'type' => '1453556'
                                                             },
                                                     '31' => {
                                                               'name' => 'C_Encrypt',
                                                               'offset' => '248',
                                                               'type' => '1453605'
                                                             },
                                                     '32' => {
                                                               'name' => 'C_EncryptUpdate',
                                                               'offset' => '256',
                                                               'type' => '1453658'
                                                             },
                                                     '33' => {
                                                               'name' => 'C_EncryptFinal',
                                                               'offset' => '264',
                                                               'type' => '1453670'
                                                             },
                                                     '34' => {
                                                               'name' => 'C_DecryptInit',
                                                               'offset' => '272',
                                                               'type' => '1453682'
                                                             },
                                                     '35' => {
                                                               'name' => 'C_Decrypt',
                                                               'offset' => '280',
                                                               'type' => '1453694'
                                                             },
                                                     '36' => {
                                                               'name' => 'C_DecryptUpdate',
                                                               'offset' => '288',
                                                               'type' => '1453706'
                                                             },
                                                     '37' => {
                                                               'name' => 'C_DecryptFinal',
                                                               'offset' => '296',
                                                               'type' => '1453718'
                                                             },
                                                     '38' => {
                                                               'name' => 'C_DigestInit',
                                                               'offset' => '304',
                                                               'type' => '1453730'
                                                             },
                                                     '39' => {
                                                               'name' => 'C_Digest',
                                                               'offset' => '312',
                                                               'type' => '1453768'
                                                             },
                                                     '4' => {
                                                              'name' => 'C_GetFunctionList',
                                                              'offset' => '32',
                                                              'type' => '1451452'
                                                            },
                                                     '40' => {
                                                               'name' => 'C_DigestUpdate',
                                                               'offset' => '320',
                                                               'type' => '1453780'
                                                             },
                                                     '41' => {
                                                               'name' => 'C_DigestKey',
                                                               'offset' => '328',
                                                               'type' => '1453792'
                                                             },
                                                     '42' => {
                                                               'name' => 'C_DigestFinal',
                                                               'offset' => '336',
                                                               'type' => '1453804'
                                                             },
                                                     '43' => {
                                                               'name' => 'C_SignInit',
                                                               'offset' => '344',
                                                               'type' => '1453816'
                                                             },
                                                     '44' => {
                                                               'name' => 'C_Sign',
                                                               'offset' => '352',
                                                               'type' => '1453828'
                                                             },
                                                     '45' => {
                                                               'name' => 'C_SignUpdate',
                                                               'offset' => '360',
                                                               'type' => '1453840'
                                                             },
                                                     '46' => {
                                                               'name' => 'C_SignFinal',
                                                               'offset' => '368',
                                                               'type' => '1453852'
                                                             },
                                                     '47' => {
                                                               'name' => 'C_SignRecoverInit',
                                                               'offset' => '376',
                                                               'type' => '1453864'
                                                             },
                                                     '48' => {
                                                               'name' => 'C_SignRecover',
                                                               'offset' => '384',
                                                               'type' => '1453876'
                                                             },
                                                     '49' => {
                                                               'name' => 'C_VerifyInit',
                                                               'offset' => '392',
                                                               'type' => '1453888'
                                                             },
                                                     '5' => {
                                                              'name' => 'C_GetSlotList',
                                                              'offset' => '40',
                                                              'type' => '1452446'
                                                            },
                                                     '50' => {
                                                               'name' => 'C_Verify',
                                                               'offset' => '400',
                                                               'type' => '1453900'
                                                             },
                                                     '51' => {
                                                               'name' => 'C_VerifyUpdate',
                                                               'offset' => '408',
                                                               'type' => '1453912'
                                                             },
                                                     '52' => {
                                                               'name' => 'C_VerifyFinal',
                                                               'offset' => '416',
                                                               'type' => '1453924'
                                                             },
                                                     '53' => {
                                                               'name' => 'C_VerifyRecoverInit',
                                                               'offset' => '424',
                                                               'type' => '1453936'
                                                             },
                                                     '54' => {
                                                               'name' => 'C_VerifyRecover',
                                                               'offset' => '432',
                                                               'type' => '1453948'
                                                             },
                                                     '55' => {
                                                               'name' => 'C_DigestEncryptUpdate',
                                                               'offset' => '440',
                                                               'type' => '1453960'
                                                             },
                                                     '56' => {
                                                               'name' => 'C_DecryptDigestUpdate',
                                                               'offset' => '448',
                                                               'type' => '1453972'
                                                             },
                                                     '57' => {
                                                               'name' => 'C_SignEncryptUpdate',
                                                               'offset' => '456',
                                                               'type' => '1453984'
                                                             },
                                                     '58' => {
                                                               'name' => 'C_DecryptVerifyUpdate',
                                                               'offset' => '464',
                                                               'type' => '1453996'
                                                             },
                                                     '59' => {
                                                               'name' => 'C_GenerateKey',
                                                               'offset' => '472',
                                                               'type' => '1454008'
                                                             },
                                                     '6' => {
                                                              'name' => 'C_GetSlotInfo',
                                                              'offset' => '48',
                                                              'type' => '1452501'
                                                            },
                                                     '60' => {
                                                               'name' => 'C_GenerateKeyPair',
                                                               'offset' => '480',
                                                               'type' => '1454061'
                                                             },
                                                     '61' => {
                                                               'name' => 'C_WrapKey',
                                                               'offset' => '488',
                                                               'type' => '1454129'
                                                             },
                                                     '62' => {
                                                               'name' => 'C_UnwrapKey',
                                                               'offset' => '496',
                                                               'type' => '1454187'
                                                             },
                                                     '63' => {
                                                               'name' => 'C_DeriveKey',
                                                               'offset' => '504',
                                                               'type' => '1454255'
                                                             },
                                                     '64' => {
                                                               'name' => 'C_SeedRandom',
                                                               'offset' => '512',
                                                               'type' => '1454313'
                                                             },
                                                     '65' => {
                                                               'name' => 'C_GenerateRandom',
                                                               'offset' => '520',
                                                               'type' => '1454325'
                                                             },
                                                     '66' => {
                                                               'name' => 'C_GetFunctionStatus',
                                                               'offset' => '528',
                                                               'type' => '1454337'
                                                             },
                                                     '67' => {
                                                               'name' => 'C_CancelFunction',
                                                               'offset' => '536',
                                                               'type' => '1454349'
                                                             },
                                                     '68' => {
                                                               'name' => 'C_WaitForSlotEvent',
                                                               'offset' => '544',
                                                               'type' => '1452589'
                                                             },
                                                     '7' => {
                                                              'name' => 'C_GetTokenInfo',
                                                              'offset' => '56',
                                                              'type' => '1452545'
                                                            },
                                                     '8' => {
                                                              'name' => 'C_GetMechanismList',
                                                              'offset' => '64',
                                                              'type' => '1452632'
                                                            },
                                                     '9' => {
                                                              'name' => 'C_GetMechanismInfo',
                                                              'offset' => '72',
                                                              'type' => '1452681'
                                                            }
                                                   },
                                         'Name' => 'struct ck_function_list',
                                         'Size' => '552',
                                         'Type' => 'Struct'
                                       },
                          '1452446' => {
                                         'BaseType' => '1452458',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '773',
                                         'Name' => 'CK_C_GetSlotList',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452458' => {
                                         'Name' => 'ck_rv_t(*)(unsigned char, ck_slot_id_t*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '157'
                                                             },
                                                      '1' => {
                                                               'type' => '1452489'
                                                             },
                                                      '2' => {
                                                               'type' => '1452495'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452489' => {
                                         'BaseType' => '1450635',
                                         'Name' => 'ck_slot_id_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1452495' => {
                                         'BaseType' => '68',
                                         'Name' => 'unsigned long*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1452501' => {
                                         'BaseType' => '1452513',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '776',
                                         'Name' => 'CK_C_GetSlotInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452513' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, struct ck_slot_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450635'
                                                             },
                                                      '1' => {
                                                               'type' => '1452539'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452539' => {
                                         'BaseType' => '1450646',
                                         'Name' => 'struct ck_slot_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1452545' => {
                                         'BaseType' => '1452557',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '778',
                                         'Name' => 'CK_C_GetTokenInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452557' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, struct ck_token_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450635'
                                                             },
                                                      '1' => {
                                                               'type' => '1452583'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452583' => {
                                         'BaseType' => '1450735',
                                         'Name' => 'struct ck_token_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1452589' => {
                                         'BaseType' => '1452601',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '780',
                                         'Name' => 'CK_C_WaitForSlotEvent',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452601' => {
                                         'Name' => 'ck_rv_t(*)(ck_flags_t, ck_slot_id_t*, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450487'
                                                             },
                                                      '1' => {
                                                               'type' => '1452489'
                                                             },
                                                      '2' => {
                                                               'type' => '216'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452632' => {
                                         'BaseType' => '1452644',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '782',
                                         'Name' => 'CK_C_GetMechanismList',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452644' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, ck_mechanism_type_t*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450635'
                                                             },
                                                      '1' => {
                                                               'type' => '1452675'
                                                             },
                                                      '2' => {
                                                               'type' => '1452495'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452675' => {
                                         'BaseType' => '1451195',
                                         'Name' => 'ck_mechanism_type_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1452681' => {
                                         'BaseType' => '1452693',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '786',
                                         'Name' => 'CK_C_GetMechanismInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452693' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, ck_mechanism_type_t, struct ck_mechanism_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450635'
                                                             },
                                                      '1' => {
                                                               'type' => '1451195'
                                                             },
                                                      '2' => {
                                                               'type' => '1452724'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452724' => {
                                         'BaseType' => '1451260',
                                         'Name' => 'struct ck_mechanism_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1452730' => {
                                         'BaseType' => '1452742',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '789',
                                         'Name' => 'CK_C_InitToken',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452742' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, unsigned char*, unsigned long, unsigned char*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450635'
                                                             },
                                                      '1' => {
                                                               'type' => '3881'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '3881'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452778' => {
                                         'BaseType' => '1452790',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '792',
                                         'Name' => 'CK_C_InitPIN',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452790' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '3881'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452821' => {
                                         'BaseType' => '1452833',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '795',
                                         'Name' => 'CK_C_SetPIN',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452833' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long, unsigned char*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '3881'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '3881'
                                                             },
                                                      '4' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452874' => {
                                         'BaseType' => '1452886',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '800',
                                         'Name' => 'CK_C_OpenSession',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452886' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, ck_flags_t, void*, ck_notify_t, ck_session_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450635'
                                                             },
                                                      '1' => {
                                                               'type' => '1450487'
                                                             },
                                                      '2' => {
                                                               'type' => '216'
                                                             },
                                                      '3' => {
                                                               'type' => '1451325'
                                                             },
                                                      '4' => {
                                                               'type' => '1452927'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452927' => {
                                         'BaseType' => '1450980',
                                         'Name' => 'ck_session_handle_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1452933' => {
                                         'BaseType' => '1452945',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '804',
                                         'Name' => 'CK_C_CloseSession',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452945' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452966' => {
                                         'BaseType' => '1452978',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '805',
                                         'Name' => 'CK_C_CloseAllSessions',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1452978' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450635'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1452999' => {
                                         'BaseType' => '1453011',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '806',
                                         'Name' => 'CK_C_GetSessionInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453011' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_session_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453037'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453037' => {
                                         'BaseType' => '1451016',
                                         'Name' => 'struct ck_session_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1453043' => {
                                         'BaseType' => '1453055',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '809',
                                         'Name' => 'CK_C_GetOperationState',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453055' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '3881'
                                                             },
                                                      '2' => {
                                                               'type' => '1452495'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453086' => {
                                         'BaseType' => '1453098',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '813',
                                         'Name' => 'CK_C_SetOperationState',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453098' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long, ck_object_handle_t, ck_object_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '3881'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '1451082'
                                                             },
                                                      '4' => {
                                                               'type' => '1451082'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453139' => {
                                         'BaseType' => '1453151',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '819',
                                         'Name' => 'CK_C_Login',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453151' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_user_type_t, unsigned char*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1450992'
                                                             },
                                                      '2' => {
                                                               'type' => '3881'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453187' => {
                                         'BaseType' => '1452945',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '822',
                                         'Name' => 'CK_C_Logout',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453199' => {
                                         'BaseType' => '1453211',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '824',
                                         'Name' => 'CK_C_CreateObject',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453211' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453247'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '1453253'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453247' => {
                                         'BaseType' => '1451142',
                                         'Name' => 'struct ck_attribute*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1453253' => {
                                         'BaseType' => '1451082',
                                         'Name' => 'ck_object_handle_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1453259' => {
                                         'BaseType' => '1453271',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '828',
                                         'Name' => 'CK_C_CopyObject',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453271' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1451082'
                                                             },
                                                      '2' => {
                                                               'type' => '1453247'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             },
                                                      '4' => {
                                                               'type' => '1453253'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453312' => {
                                         'BaseType' => '1453324',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '832',
                                         'Name' => 'CK_C_DestroyObject',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453324' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1451082'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453350' => {
                                         'BaseType' => '1453362',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '835',
                                         'Name' => 'CK_C_GetObjectSize',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453362' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1451082'
                                                             },
                                                      '2' => {
                                                               'type' => '1452495'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453393' => {
                                         'BaseType' => '1453405',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '839',
                                         'Name' => 'CK_C_GetAttributeValue',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453405' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t, struct ck_attribute*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1451082'
                                                             },
                                                      '2' => {
                                                               'type' => '1453247'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453441' => {
                                         'BaseType' => '1453405',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '844',
                                         'Name' => 'CK_C_SetAttributeValue',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453453' => {
                                         'BaseType' => '1453465',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '849',
                                         'Name' => 'CK_C_FindObjectsInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453465' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_attribute*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453247'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453496' => {
                                         'BaseType' => '1453508',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '853',
                                         'Name' => 'CK_C_FindObjects',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453508' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t*, unsigned long, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453253'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '1452495'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453544' => {
                                         'BaseType' => '1452945',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '858',
                                         'Name' => 'CK_C_FindObjectsFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453556' => {
                                         'BaseType' => '1453568',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '861',
                                         'Name' => 'CK_C_EncryptInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453568' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, ck_object_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453599'
                                                             },
                                                      '2' => {
                                                               'type' => '1451082'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453599' => {
                                         'BaseType' => '1451207',
                                         'Name' => 'struct ck_mechanism*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1453605' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '865',
                                         'Name' => 'CK_C_Encrypt',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453617' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long, unsigned char*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '3881'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '3881'
                                                             },
                                                      '4' => {
                                                               'type' => '1452495'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453658' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '870',
                                         'Name' => 'CK_C_EncryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453670' => {
                                         'BaseType' => '1453055',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '875',
                                         'Name' => 'CK_C_EncryptFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453682' => {
                                         'BaseType' => '1453568',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '880',
                                         'Name' => 'CK_C_DecryptInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453694' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '884',
                                         'Name' => 'CK_C_Decrypt',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453706' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '889',
                                         'Name' => 'CK_C_DecryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453718' => {
                                         'BaseType' => '1453055',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '894',
                                         'Name' => 'CK_C_DecryptFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453730' => {
                                         'BaseType' => '1453742',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '899',
                                         'Name' => 'CK_C_DigestInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453742' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453599'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1453768' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '902',
                                         'Name' => 'CK_C_Digest',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453780' => {
                                         'BaseType' => '1452790',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '907',
                                         'Name' => 'CK_C_DigestUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453792' => {
                                         'BaseType' => '1453324',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '910',
                                         'Name' => 'CK_C_DigestKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453804' => {
                                         'BaseType' => '1453055',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '912',
                                         'Name' => 'CK_C_DigestFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453816' => {
                                         'BaseType' => '1453568',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '917',
                                         'Name' => 'CK_C_SignInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453828' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '921',
                                         'Name' => 'CK_C_Sign',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453840' => {
                                         'BaseType' => '1452790',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '926',
                                         'Name' => 'CK_C_SignUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453852' => {
                                         'BaseType' => '1453055',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '929',
                                         'Name' => 'CK_C_SignFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453864' => {
                                         'BaseType' => '1453568',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '933',
                                         'Name' => 'CK_C_SignRecoverInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453876' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '937',
                                         'Name' => 'CK_C_SignRecover',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453888' => {
                                         'BaseType' => '1453568',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '943',
                                         'Name' => 'CK_C_VerifyInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453900' => {
                                         'BaseType' => '1452833',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '947',
                                         'Name' => 'CK_C_Verify',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453912' => {
                                         'BaseType' => '1452790',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '952',
                                         'Name' => 'CK_C_VerifyUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453924' => {
                                         'BaseType' => '1452790',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '955',
                                         'Name' => 'CK_C_VerifyFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453936' => {
                                         'BaseType' => '1453568',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '959',
                                         'Name' => 'CK_C_VerifyRecoverInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453948' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '963',
                                         'Name' => 'CK_C_VerifyRecover',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453960' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '970',
                                         'Name' => 'CK_C_DigestEncryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453972' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '975',
                                         'Name' => 'CK_C_DecryptDigestUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453984' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '981',
                                         'Name' => 'CK_C_SignEncryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1453996' => {
                                         'BaseType' => '1453617',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '986',
                                         'Name' => 'CK_C_DecryptVerifyUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1454008' => {
                                         'BaseType' => '1454020',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '993',
                                         'Name' => 'CK_C_GenerateKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1454020' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453599'
                                                             },
                                                      '2' => {
                                                               'type' => '1453247'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             },
                                                      '4' => {
                                                               'type' => '1453253'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1454061' => {
                                         'BaseType' => '1454073',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '999',
                                         'Name' => 'CK_C_GenerateKeyPair',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1454073' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, struct ck_attribute*, unsigned long, struct ck_attribute*, unsigned long, ck_object_handle_t*, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453599'
                                                             },
                                                      '2' => {
                                                               'type' => '1453247'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             },
                                                      '4' => {
                                                               'type' => '1453247'
                                                             },
                                                      '5' => {
                                                               'type' => '68'
                                                             },
                                                      '6' => {
                                                               'type' => '1453253'
                                                             },
                                                      '7' => {
                                                               'type' => '1453253'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1454129' => {
                                         'BaseType' => '1454141',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1008',
                                         'Name' => 'CK_C_WrapKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1454141' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, ck_object_handle_t, ck_object_handle_t, unsigned char*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453599'
                                                             },
                                                      '2' => {
                                                               'type' => '1451082'
                                                             },
                                                      '3' => {
                                                               'type' => '1451082'
                                                             },
                                                      '4' => {
                                                               'type' => '3881'
                                                             },
                                                      '5' => {
                                                               'type' => '1452495'
                                                             }
                                                    },
                                         'Return' => '1451313',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1454187' => {
                                         'BaseType' => '1454199',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1015',
                                         'Name' => 'CK_C_UnwrapKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1454199' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, ck_object_handle_t, unsigned char*, unsigned long, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1450980'
                                                             },
                                                      '1' => {
                                                               'type' => '1453599'
                                                             },
                                                      '2' => {
                                                               'type' => '1451082'
                                                             },
                                                      '3' => {
                                                               'type' => '3881'
                                                             },
                                                      '4' => {
                                                               'type' => '68'
