$VAR1 = {
          'ABI_DUMPER_VERSION' => '0.99.16',
          'ABI_DUMP_VERSION' => '3.2',
          'Arch' => 'x86_64',
          'GccVersion' => '6.2.0',
          'Headers' => {
                         'abstract.h' => 1,
                         'crypto.h' => 1,
                         'dtls.h' => 1,
                         'gnutls.h' => 1,
                         'ocsp.h' => 1,
                         'openpgp.h' => 1,
                         'pkcs11.h' => 1,
                         'pkcs12.h' => 1,
                         'pkcs7.h' => 1,
                         'system-keys.h' => 1,
                         'tpm.h' => 1,
                         'urls.h' => 1,
                         'x509-ext.h' => 1,
                         'x509.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libgnutls.so.30.7.0',
          'LibraryVersion' => '3.4.17',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libgmp.so.10' => 1,
                        'libhogweed.so.4' => 1,
                        'libidn.so.11' => 1,
                        'libnettle.so.6' => 1,
                        'libp11-kit.so.0' => 1,
                        'libtasn1.so.6' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'alpn.c' => 1,
                         'auto-verify.c' => 1,

                                                    'gnutls_x509_privkey_sec_param@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_set_pin_function@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_sign_data@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_sign_hash@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_privkey_verify_params@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_rdn_get@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_rdn_get_by_oid@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_rdn_get_oid@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_cas@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_crls@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_named_crt@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_system_trust@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_trust_dir@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_trust_file@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_add_trust_mem@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_deinit@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_get_issuer@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_get_issuer_by_dn@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_get_issuer_by_subject_key_id@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_init@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_iter_deinit@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_iter_get_ca@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_remove_cas@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_remove_trust_file@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_remove_trust_mem@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_verify_crt2@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_verify_crt@@GNUTLS_3_4' => 1,
                                                    'gnutls_x509_trust_list_verify_named_crt@@GNUTLS_3_4' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1002' => {
                                      'BaseType' => '235',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '10094' => {
                                       'Header' => 'gnutls_cipher_int.h',
                                       'Line' => '200',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cipher',
                                                            'offset' => '0',
                                                            'type' => '9947'
                                                          },
                                                   '1' => {
                                                            'name' => 'mac',
                                                            'offset' => '80',
                                                            'type' => '9958'
                                                          },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'is_mac',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ssl_hmac',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'non_null',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'etm',
                                                            'offset' => '136',
                                                            'type' => '145'
                                                          },
                                                   '6' => {
                                                            'name' => 'tag_size',
                                                            'offset' => '144',
                                                            'type' => '52'
                                                          }
                                                 },
                                       'Name' => 'struct auth_cipher_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '152',
                                       'Type' => 'Struct'
                                     },
                          '10105' => {
                                       'Header' => 'gnutls_compress.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'handle',
                                                            'offset' => '0',
                                                            'type' => '211'
                                                          },
                                                   '1' => {
                                                            'name' => 'algo',
                                                            'offset' => '8',
                                                            'type' => '2441'
                                                          }
                                                 },
                                       'Name' => 'struct comp_hd_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '1011563' => {
                                         'BaseType' => '164',
                                         'Header' => 'types.h',
                                         'Line' => '194',
                                         'Name' => 'int8_t',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '10142' => {
                                       'BaseType' => '10105',
                                       'Header' => 'gnutls_compress.h',
                                       'Line' => '41',
                                       'Name' => 'comp_hd_st',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '1015619' => {
                                         'BaseType' => '1015630',
                                         'Header' => 'tpm.h',
                                         'Line' => '36',
                                         'Name' => 'gnutls_tpm_key_list_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1015630' => {
                                         'BaseType' => '1015636',
                                         'Name' => 'struct tpm_key_list_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1015636' => {
                                         'Line' => '183',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'size',
                                                              'offset' => '0',
                                                              'type' => '1025525'
                                                            },
                                                     '1' => {
                                                              'name' => 'ki',
                                                              'offset' => '8',
                                                              'type' => '1027088'
                                                            },
                                                     '2' => {
                                                              'name' => 'tpm_ctx',
                                                              'offset' => '16',
                                                              'type' => '1025586'
                                                            }
                                                   },
                                         'Name' => 'struct tpm_key_list_st',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Source' => 'tpm.c',
                                         'Type' => 'Struct'
                                       },
                          '1015715' => {
                                         'Header' => 'tpm.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_RAW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_DER',
                                                              'value' => '0'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_TPMKEY_FMT_CTK_PEM',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_tpmkey_fmt_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1025492' => {
                                         'BaseType' => '946',
                                         'Header' => 'platform.h',
                                         'Line' => '17',
                                         'Name' => 'BYTE',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '1025503' => {
                                         'BaseType' => '1011563',
                                         'Header' => 'platform.h',
                                         'Line' => '18',
                                         'Name' => 'TSS_BOOL',
                                         'Size' => '1',
                                         'Type' => 'Typedef'
                                       },
                          '1025514' => {
                                         'BaseType' => '957',
                                         'Header' => 'platform.h',
                                         'Line' => '19',
                                         'Name' => 'UINT16',
                                         'Size' => '2',
                                         'Type' => 'Typedef'
                                       },
                          '1025525' => {
                                         'BaseType' => '968',
                                         'Header' => 'platform.h',
                                         'Line' => '20',
                                         'Name' => 'UINT32',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1025547' => {
                                         'BaseType' => '1025492',
                                         'Name' => 'BYTE*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1025553' => {
                                         'BaseType' => '1025525',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '17',
                                         'Name' => 'TSS_FLAG',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1025575' => {
                                         'BaseType' => '1025525',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '20',
                                         'Name' => 'TSS_HOBJECT',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1025586' => {
                                         'BaseType' => '1025575',
                                         'Header' => 'tss_typedef.h',
                                         'Line' => '21',
                                         'Name' => 'TSS_HCONTEXT',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1025652' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '14',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'bMajor',
                                                              'offset' => '0',
                                                              'type' => '1025492'
                                                            },
                                                     '1' => {
                                                              'name' => 'bMinor',
                                                              'offset' => '1',
                                                              'type' => '1025492'
                                                            },
                                                     '2' => {
                                                              'name' => 'bRevMajor',
                                                              'offset' => '2',
                                                              'type' => '1025492'
                                                            },
                                                     '3' => {
                                                              'name' => 'bRevMinor',
                                                              'offset' => '3',
                                                              'type' => '1025492'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_VERSION',
                                         'PrivateABI' => 1,
                                         'Size' => '4',
                                         'Type' => 'Struct'
                                       },
                          '1025713' => {
                                         'BaseType' => '1025652',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '20',
                                         'Name' => 'TSS_VERSION',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1025724' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '62',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'ulTimeLow',
                                                              'offset' => '0',
                                                              'type' => '1025525'
                                                            },
                                                     '1' => {
                                                              'name' => 'usTimeMid',
                                                              'offset' => '4',
                                                              'type' => '1025514'
                                                            },
                                                     '2' => {
                                                              'name' => 'usTimeHigh',
                                                              'offset' => '6',
                                                              'type' => '1025514'
                                                            },
                                                     '3' => {
                                                              'name' => 'bClockSeqHigh',
                                                              'offset' => '8',
                                                              'type' => '1025492'
                                                            },
                                                     '4' => {
                                                              'name' => 'bClockSeqLow',
                                                              'offset' => '9',
                                                              'type' => '1025492'
                                                            },
                                                     '5' => {
                                                              'name' => 'rgbNode',
                                                              'offset' => '10',
                                                              'type' => '1025809'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_UUID',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1025809' => {
                                         'BaseType' => '1025492',
                                         'Name' => 'BYTE[6]',
                                         'Size' => '6',
                                         'Type' => 'Array'
                                       },
                          '1025825' => {
                                         'BaseType' => '1025724',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '70',
                                         'Name' => 'TSS_UUID',
                                         'Size' => '16',
                                         'Type' => 'Typedef'
                                       },
                          '1025841' => {
                                         'Header' => 'tss_structs.h',
                                         'Line' => '87',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'versionInfo',
                                                              'offset' => '0',
                                                              'type' => '1025713'
                                                            },
                                                     '1' => {
                                                              'name' => 'keyUUID',
                                                              'offset' => '4',
                                                              'type' => '1025825'
                                                            },
                                                     '2' => {
                                                              'name' => 'parentKeyUUID',
                                                              'offset' => '20',
                                                              'type' => '1025825'
                                                            },
                                                     '3' => {
                                                              'name' => 'bAuthDataUsage',
                                                              'offset' => '36',
                                                              'type' => '1025492'
                                                            },
                                                     '4' => {
                                                              'name' => 'persistentStorageType',
                                                              'offset' => '40',
                                                              'type' => '1025553'
                                                            },
                                                     '5' => {
                                                              'name' => 'persistentStorageTypeParent',
                                                              'offset' => '44',
                                                              'type' => '1025553'
                                                            },
                                                     '6' => {
                                                              'name' => 'fIsLoaded',
                                                              'offset' => '48',
                                                              'type' => '1025503'
                                                            },
                                                     '7' => {
                                                              'name' => 'ulVendorDataLength',
                                                              'offset' => '52',
                                                              'type' => '1025525'
                                                            },
                                                     '8' => {
                                                              'name' => 'rgbVendorData',
                                                              'offset' => '56',
                                                              'type' => '1025547'
                                                            }
                                                   },
                                         'Name' => 'struct tdTSS_KM_KEYINFO2',
                                         'PrivateABI' => 1,
                                         'Size' => '64',
                                         'Type' => 'Struct'
                                       },
                          '1025962' => {
                                         'BaseType' => '1025841',
                                         'Header' => 'tss_structs.h',
                                         'Line' => '101',
                                         'Name' => 'TSS_KM_KEYINFO2',
                                         'Size' => '64',
                                         'Type' => 'Typedef'
                                       },
                          '1027088' => {
                                         'BaseType' => '1025962',
                                         'Name' => 'TSS_KM_KEYINFO2*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1029014' => {
                                         'BaseType' => '1015619',
                                         'Name' => 'gnutls_tpm_key_list_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '103' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '10488' => {
                                       'BaseType' => '946',
                                       'Name' => 'uint8_t[2]',
                                       'Size' => '2',
                                       'Type' => 'Array'
                                     },
                          '10504' => {
                                       'BaseType' => '946',
                                       'Name' => 'uint8_t[48]',
                                       'Size' => '48',
                                       'Type' => 'Array'
                                     },
                          '10520' => {
                                       'BaseType' => '946',
                                       'Name' => 'uint8_t[32]',
                                       'Size' => '32',
                                       'Type' => 'Array'
                                     },
                          '10536' => {
                                       'BaseType' => '9313',
                                       'Name' => 'version_entry_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10542' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '587',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'entity',
                                                            'offset' => '0',
                                                            'type' => '145'
                                                          },
                                                   '1' => {
                                                            'name' => 'kx_algorithm',
                                                            'offset' => '4',
                                                            'type' => '2149'
                                                          },
                                                   '10' => {
                                                             'name' => 'server_random',
                                                             'offset' => '104',
                                                             'type' => '10520'
                                                           },
                                                   '11' => {
                                                             'name' => 'session_id',
                                                             'offset' => '136',
                                                             'type' => '10520'
                                                           },
                                                   '12' => {
                                                             'name' => 'session_id_size',
                                                             'offset' => '168',
                                                             'type' => '946'
                                                           },
                                                   '13' => {
                                                             'name' => 'timestamp',
                                                             'offset' => '176',
                                                             'type' => '252'
                                                           },
                                                   '14' => {
                                                             'name' => 'max_record_send_size',
                                                             'offset' => '184',
                                                             'type' => '957'
                                                           },
                                                   '15' => {
                                                             'name' => 'max_record_recv_size',
                                                             'offset' => '186',
                                                             'type' => '957'
                                                           },
                                                   '16' => {
                                                             'name' => 'cert_type',
                                                             'offset' => '188',
                                                             'type' => '2712'
                                                           },
                                                   '17' => {
                                                             'name' => 'ecc_curve',
                                                             'offset' => '192',
                                                             'type' => '2982'
                                                           },
                                                   '18' => {
                                                             'name' => 'server_sign_algo',
                                                             'offset' => '196',
                                                             'type' => '2920'
                                                           },
                                                   '19' => {
                                                             'name' => 'client_sign_algo',
                                                             'offset' => '200',
                                                             'type' => '2920'
                                                           },
                                                   '2' => {
                                                            'name' => 'epoch_read',
                                                            'offset' => '8',
                                                            'type' => '957'
                                                          },
                                                   '20' => {
                                                             'name' => 'ext_master_secret',
                                                             'offset' => '204',
                                                             'type' => '946'
                                                           },
                                                   '21' => {
                                                             'name' => 'etm',
                                                             'offset' => '205',
                                                             'type' => '946'
                                                           },
                                                   '22' => {
                                                             'name' => 'do_recv_supplemental',
                                                             'offset' => '208',
                                                             'type' => '75'
                                                           },
                                                   '23' => {
                                                             'name' => 'do_send_supplemental',
                                                             'offset' => '212',
                                                             'type' => '75'
                                                           },
                                                   '24' => {
                                                             'name' => 'pversion',
                                                             'offset' => '216',
                                                             'type' => '10536'
                                                           },
                                                   '3' => {
                                                            'name' => 'epoch_write',
                                                            'offset' => '10',
                                                            'type' => '957'
                                                          },
                                                   '4' => {
                                                            'name' => 'epoch_next',
                                                            'offset' => '12',
                                                            'type' => '957'
                                                          },
                                                   '5' => {
                                                            'name' => 'epoch_min',
                                                            'offset' => '14',
                                                            'type' => '957'
                                                          },
                                                   '6' => {
                                                            'name' => 'cipher_suite',
                                                            'offset' => '16',
                                                            'type' => '10488'
                                                          },
                                                   '7' => {
                                                            'name' => 'compression_method',
                                                            'offset' => '20',
                                                            'type' => '2441'
                                                          },
                                                   '8' => {
                                                            'name' => 'master_secret',
                                                            'offset' => '24',
                                                            'type' => '10504'
                                                          },
                                                   '9' => {
                                                            'name' => 'client_random',
                                                            'offset' => '72',
                                                            'type' => '10520'
                                                          }
                                                 },
                                       'Name' => 'struct security_parameters_st',
                                       'PrivateABI' => 1,
                                       'Size' => '224',
                                       'Type' => 'Struct'
                                     },
                          '10554' => {
                                       'BaseType' => '979',
                                       'Name' => 'uint64_t[64]',
                                       'Size' => '512',
                                       'Type' => 'Array'
                                     },
                          '10606' => {
                                       'BaseType' => '145',
                                       'Name' => 'unsigned int[32]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '10622' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '635',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'priority',
                                                            'offset' => '0',
                                                            'type' => '10606'
                                                          },
                                                   '1' => {
                                                            'name' => 'algorithms',
                                                            'offset' => '128',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct priority_st',
                                       'PrivateABI' => 1,
                                       'Size' => '132',
                                       'Type' => 'Struct'
                                     },
                          '10672' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '642',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'SR_DISABLED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'SR_UNSAFE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'SR_PARTIAL',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'SR_SAFE',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum safe_renegotiation_t',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10720' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '707',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'dh_params',
                                                            'offset' => '0',
                                                            'type' => '3185'
                                                          },
                                                   '1' => {
                                                            'name' => 'free_dh_params',
                                                            'offset' => '8',
                                                            'type' => '75'
                                                          }
                                                 },
                                       'Name' => 'struct internal_params_st',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '10911' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '744',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'cookie',
                                                            'offset' => '0',
                                                            'type' => '10520'
                                                          },
                                                   '1' => {
                                                            'name' => 'cookie_len',
                                                            'offset' => '32',
                                                            'type' => '946'
                                                          },
                                                   '10' => {
                                                             'name' => 'async_term',
                                                             'offset' => '56',
                                                             'type' => '252'
                                                           },
                                                   '11' => {
                                                             'name' => 'last_retransmit',
                                                             'offset' => '64',
                                                             'type' => '274'
                                                           },
                                                   '12' => {
                                                             'name' => 'packets_dropped',
                                                             'offset' => '80',
                                                             'type' => '145'
                                                           },
                                                   '2' => {
                                                            'name' => 'hsk_write_seq',
                                                            'offset' => '34',
                                                            'type' => '957'
                                                          },
                                                   '3' => {
                                                            'name' => 'hsk_read_seq',
                                                            'offset' => '36',
                                                            'type' => '145'
                                                          },
                                                   '4' => {
                                                            'name' => 'mtu',
                                                            'offset' => '40',
                                                            'type' => '957'
                                                          },
                                                   '5' => {
                                                            'name' => 'flight_init',
                                                            'offset' => '42',
                                                            'type' => '8952'
                                                          },
                                                   '6' => {
                                                            'name' => 'last_flight',
                                                            'offset' => '43',
                                                            'type' => '8952'
                                                          },
                                                   '7' => {
                                                            'name' => 'retrans_timeout_ms',
                                                            'offset' => '44',
                                                            'type' => '145'
                                                          },
                                                   '8' => {
                                                            'name' => 'hsk_hello_verify_requests',
                                                            'offset' => '48',
                                                            'type' => '145'
                                                          },
                                                   '9' => {
                                                            'name' => 'actual_retrans_timeout_ms',
                                                            'offset' => '52',
                                                            'type' => '145'
                                                          }
                                                 },
                                       'Name' => 'struct dtls_st',
                                       'PrivateABI' => 1,
                                       'Size' => '88',
                                       'Type' => 'Struct'
                                     },
                          '10923' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '941',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '957'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '5011'
                                                          },
                                                   '2' => {
                                                            'name' => 'set',
                                                            'offset' => '16',
                                                            'type' => '8952'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-gnutls_int.h-941',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10972' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '947',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '957'
                                                          },
                                                   '1' => {
                                                            'name' => 'priv',
                                                            'offset' => '8',
                                                            'type' => '5011'
                                                          },
                                                   '2' => {
                                                            'name' => 'set',
                                                            'offset' => '16',
                                                            'type' => '8952'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-gnutls_int.h-947',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '110' => {
                                     'BaseType' => '128',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1109742' => {
                                         'BaseType' => '754908',
                                         'Name' => 'gnutls_custom_url_st const',
                                         'Size' => '64',
                                         'Type' => 'Const'
                                       },
                          '1110287' => {
                                         'BaseType' => '1109742',
                                         'Name' => 'gnutls_custom_url_st const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1137264' => {
                                         'BaseType' => '1137275',
                                         'Header' => 'system-keys.h',
                                         'Line' => '41',
                                         'Name' => 'gnutls_system_key_iter_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1137275' => {
                                         'BaseType' => '1137281',
                                         'Name' => 'struct system_key_iter_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1137281' => {
                                         'Name' => 'struct system_key_iter_st',
                                         'PrivateABI' => 1,
                                         'Type' => 'Struct'
                                       },
                          '1137702' => {
                                         'BaseType' => '1137264',
                                         'Name' => 'gnutls_system_key_iter_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1144009' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '164',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_GENERIC',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_LIB',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_URL_LIB_VERSION',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_url_type_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1144094' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '290',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_ID_HEX',
                                                              'value' => '1'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LABEL',
                                                              'value' => '2'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_LABEL',
                                                              'value' => '3'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_SERIAL',
                                                              'value' => '4'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_MANUFACTURER',
                                                              'value' => '5'
                                                            },
                                                     '5' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_TOKEN_MODEL',
                                                              'value' => '6'
                                                            },
                                                     '6' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_ID',
                                                              'value' => '7'
                                                            },
                                                     '7' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_VERSION',
                                                              'value' => '8'
                                                            },
                                                     '8' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_DESCRIPTION',
                                                              'value' => '9'
                                                            },
                                                     '9' => {
                                                              'name' => 'GNUTLS_PKCS11_OBJ_LIBRARY_MANUFACTURER',
                                                              'value' => '10'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_obj_info_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1144150' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '325',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_LABEL',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_SERIAL',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MANUFACTURER',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MODEL',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'GNUTLS_PKCS11_TOKEN_MODNAME',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_pkcs11_token_info_t',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1152576' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '186',
                                         'Name' => 'ck_flags_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1152587' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '188',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'major',
                                                              'offset' => '0',
                                                              'type' => '152'
                                                            },
                                                     '1' => {
                                                              'name' => 'minor',
                                                              'offset' => '1',
                                                              'type' => '152'
                                                            }
                                                   },
                                         'Name' => 'struct ck_version',
                                         'Size' => '2',
                                         'Type' => 'Struct'
                                       },
                          '1152624' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '195',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'cryptoki_version',
                                                              'offset' => '0',
                                                              'type' => '1152587'
                                                            },
                                                     '1' => {
                                                              'name' => 'manufacturer_id',
                                                              'offset' => '2',
                                                              'type' => '1152697'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '40',
                                                              'type' => '1152576'
                                                            },
                                                     '3' => {
                                                              'name' => 'library_description',
                                                              'offset' => '48',
                                                              'type' => '1152697'
                                                            },
                                                     '4' => {
                                                              'name' => 'library_version',
                                                              'offset' => '80',
                                                              'type' => '1152587'
                                                            }
                                                   },
                                         'Name' => 'struct ck_info',
                                         'Size' => '88',
                                         'Type' => 'Struct'
                                       },
                          '1152697' => {
                                         'BaseType' => '152',
                                         'Name' => 'unsigned char[32]',
                                         'Size' => '32',
                                         'Type' => 'Array'
                                       },
                          '1152713' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '205',
                                         'Name' => 'ck_notification_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1152724' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '210',
                                         'Name' => 'ck_slot_id_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1152735' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '213',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'slot_description',
                                                              'offset' => '0',
                                                              'type' => '1152808'
                                                            },
                                                     '1' => {
                                                              'name' => 'manufacturer_id',
                                                              'offset' => '64',
                                                              'type' => '1152697'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '96',
                                                              'type' => '1152576'
                                                            },
                                                     '3' => {
                                                              'name' => 'hardware_version',
                                                              'offset' => '104',
                                                              'type' => '1152587'
                                                            },
                                                     '4' => {
                                                              'name' => 'firmware_version',
                                                              'offset' => '106',
                                                              'type' => '1152587'
                                                            }
                                                   },
                                         'Name' => 'struct ck_slot_info',
                                         'Size' => '112',
                                         'Type' => 'Struct'
                                       },
                          '1152808' => {
                                         'BaseType' => '152',
                                         'Name' => 'unsigned char[64]',
                                         'Size' => '64',
                                         'Type' => 'Array'
                                       },
                          '1152824' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '229',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'label',
                                                              'offset' => '0',
                                                              'type' => '1152697'
                                                            },
                                                     '1' => {
                                                              'name' => 'manufacturer_id',
                                                              'offset' => '32',
                                                              'type' => '1152697'
                                                            },
                                                     '10' => {
                                                               'name' => 'min_pin_len',
                                                               'offset' => '144',
                                                               'type' => '68'
                                                             },
                                                     '11' => {
                                                               'name' => 'total_public_memory',
                                                               'offset' => '152',
                                                               'type' => '68'
                                                             },
                                                     '12' => {
                                                               'name' => 'free_public_memory',
                                                               'offset' => '160',
                                                               'type' => '68'
                                                             },
                                                     '13' => {
                                                               'name' => 'total_private_memory',
                                                               'offset' => '168',
                                                               'type' => '68'
                                                             },
                                                     '14' => {
                                                               'name' => 'free_private_memory',
                                                               'offset' => '176',
                                                               'type' => '68'
                                                             },
                                                     '15' => {
                                                               'name' => 'hardware_version',
                                                               'offset' => '184',
                                                               'type' => '1152587'
                                                             },
                                                     '16' => {
                                                               'name' => 'firmware_version',
                                                               'offset' => '186',
                                                               'type' => '1152587'
                                                             },
                                                     '17' => {
                                                               'name' => 'utc_time',
                                                               'offset' => '188',
                                                               'type' => '1153053'
                                                             },
                                                     '2' => {
                                                              'name' => 'model',
                                                              'offset' => '64',
                                                              'type' => '1153053'
                                                            },
                                                     '3' => {
                                                              'name' => 'serial_number',
                                                              'offset' => '80',
                                                              'type' => '1153053'
                                                            },
                                                     '4' => {
                                                              'name' => 'flags',
                                                              'offset' => '96',
                                                              'type' => '1152576'
                                                            },
                                                     '5' => {
                                                              'name' => 'max_session_count',
                                                              'offset' => '104',
                                                              'type' => '68'
                                                            },
                                                     '6' => {
                                                              'name' => 'session_count',
                                                              'offset' => '112',
                                                              'type' => '68'
                                                            },
                                                     '7' => {
                                                              'name' => 'max_rw_session_count',
                                                              'offset' => '120',
                                                              'type' => '68'
                                                            },
                                                     '8' => {
                                                              'name' => 'rw_session_count',
                                                              'offset' => '128',
                                                              'type' => '68'
                                                            },
                                                     '9' => {
                                                              'name' => 'max_pin_len',
                                                              'offset' => '136',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_token_info',
                                         'Size' => '208',
                                         'Type' => 'Struct'
                                       },
                          '1153053' => {
                                         'BaseType' => '152',
                                         'Name' => 'unsigned char[16]',
                                         'Size' => '16',
                                         'Type' => 'Array'
                                       },
                          '1153069' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '275',
                                         'Name' => 'ck_session_handle_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153081' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '280',
                                         'Name' => 'ck_user_type_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153093' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '287',
                                         'Name' => 'ck_state_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153105' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '296',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'slot_id',
                                                              'offset' => '0',
                                                              'type' => '1152724'
                                                            },
                                                     '1' => {
                                                              'name' => 'state',
                                                              'offset' => '8',
                                                              'type' => '1153093'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '16',
                                                              'type' => '1152576'
                                                            },
                                                     '3' => {
                                                              'name' => 'device_error',
                                                              'offset' => '24',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_session_info',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1153171' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '308',
                                         'Name' => 'ck_object_handle_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153219' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '370',
                                         'Name' => 'ck_attribute_type_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153231' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '459',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '1153219'
                                                            },
                                                     '1' => {
                                                              'name' => 'value',
                                                              'offset' => '8',
                                                              'type' => '211'
                                                            },
                                                     '2' => {
                                                              'name' => 'value_len',
                                                              'offset' => '16',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_attribute',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1153284' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '475',
                                         'Name' => 'ck_mechanism_type_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153296' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '719',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'mechanism',
                                                              'offset' => '0',
                                                              'type' => '1153284'
                                                            },
                                                     '1' => {
                                                              'name' => 'parameter',
                                                              'offset' => '8',
                                                              'type' => '211'
                                                            },
                                                     '2' => {
                                                              'name' => 'parameter_len',
                                                              'offset' => '16',
                                                              'type' => '68'
                                                            }
                                                   },
                                         'Name' => 'struct ck_mechanism',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1153349' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '727',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'min_key_size',
                                                              'offset' => '0',
                                                              'type' => '68'
                                                            },
                                                     '1' => {
                                                              'name' => 'max_key_size',
                                                              'offset' => '8',
                                                              'type' => '68'
                                                            },
                                                     '2' => {
                                                              'name' => 'flags',
                                                              'offset' => '16',
                                                              'type' => '1152576'
                                                            }
                                                   },
                                         'Name' => 'struct ck_mechanism_info',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1153402' => {
                                         'BaseType' => '68',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '754',
                                         'Name' => 'ck_rv_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153414' => {
                                         'BaseType' => '1153426',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '757',
                                         'Name' => 'ck_notify_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153426' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_notification_t, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1152713'
                                                             },
                                                      '2' => {
                                                               'type' => '211'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1153457' => {
                                         'BaseType' => '1153469',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '767',
                                         'Name' => 'CK_C_Initialize',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153469' => {
                                         'Name' => 'ck_rv_t(*)(void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '211'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1153490' => {
                                         'BaseType' => '1153469',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '768',
                                         'Name' => 'CK_C_Finalize',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153502' => {
                                         'BaseType' => '1153514',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '769',
                                         'Name' => 'CK_C_GetInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153514' => {
                                         'Name' => 'ck_rv_t(*)(struct ck_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153535'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1153535' => {
                                         'BaseType' => '1152624',
                                         'Name' => 'struct ck_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1153541' => {
                                         'BaseType' => '1153553',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '770',
                                         'Name' => 'CK_C_GetFunctionList',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1153553' => {
                                         'Name' => 'ck_rv_t(*)(struct ck_function_list**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153574'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1153574' => {
                                         'BaseType' => '1153580',
                                         'Name' => 'struct ck_function_list**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1153580' => {
                                         'BaseType' => '1153586',
                                         'Name' => 'struct ck_function_list*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1153586' => {
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1044',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'version',
                                                              'offset' => '0',
                                                              'type' => '1152587'
                                                            },
                                                     '1' => {
                                                              'name' => 'C_Initialize',
                                                              'offset' => '8',
                                                              'type' => '1153457'
                                                            },
                                                     '10' => {
                                                               'name' => 'C_InitToken',
                                                               'offset' => '80',
                                                               'type' => '1154819'
                                                             },
                                                     '11' => {
                                                               'name' => 'C_InitPIN',
                                                               'offset' => '88',
                                                               'type' => '1154867'
                                                             },
                                                     '12' => {
                                                               'name' => 'C_SetPIN',
                                                               'offset' => '96',
                                                               'type' => '1154910'
                                                             },
                                                     '13' => {
                                                               'name' => 'C_OpenSession',
                                                               'offset' => '104',
                                                               'type' => '1154963'
                                                             },
                                                     '14' => {
                                                               'name' => 'C_CloseSession',
                                                               'offset' => '112',
                                                               'type' => '1155022'
                                                             },
                                                     '15' => {
                                                               'name' => 'C_CloseAllSessions',
                                                               'offset' => '120',
                                                               'type' => '1155055'
                                                             },
                                                     '16' => {
                                                               'name' => 'C_GetSessionInfo',
                                                               'offset' => '128',
                                                               'type' => '1155088'
                                                             },
                                                     '17' => {
                                                               'name' => 'C_GetOperationState',
                                                               'offset' => '136',
                                                               'type' => '1155132'
                                                             },
                                                     '18' => {
                                                               'name' => 'C_SetOperationState',
                                                               'offset' => '144',
                                                               'type' => '1155175'
                                                             },
                                                     '19' => {
                                                               'name' => 'C_Login',
                                                               'offset' => '152',
                                                               'type' => '1155228'
                                                             },
                                                     '2' => {
                                                              'name' => 'C_Finalize',
                                                              'offset' => '16',
                                                              'type' => '1153490'
                                                            },
                                                     '20' => {
                                                               'name' => 'C_Logout',
                                                               'offset' => '160',
                                                               'type' => '1155276'
                                                             },
                                                     '21' => {
                                                               'name' => 'C_CreateObject',
                                                               'offset' => '168',
                                                               'type' => '1155288'
                                                             },
                                                     '22' => {
                                                               'name' => 'C_CopyObject',
                                                               'offset' => '176',
                                                               'type' => '1155348'
                                                             },
                                                     '23' => {
                                                               'name' => 'C_DestroyObject',
                                                               'offset' => '184',
                                                               'type' => '1155401'
                                                             },
                                                     '24' => {
                                                               'name' => 'C_GetObjectSize',
                                                               'offset' => '192',
                                                               'type' => '1155439'
                                                             },
                                                     '25' => {
                                                               'name' => 'C_GetAttributeValue',
                                                               'offset' => '200',
                                                               'type' => '1155482'
                                                             },
                                                     '26' => {
                                                               'name' => 'C_SetAttributeValue',
                                                               'offset' => '208',
                                                               'type' => '1155530'
                                                             },
                                                     '27' => {
                                                               'name' => 'C_FindObjectsInit',
                                                               'offset' => '216',
                                                               'type' => '1155542'
                                                             },
                                                     '28' => {
                                                               'name' => 'C_FindObjects',
                                                               'offset' => '224',
                                                               'type' => '1155585'
                                                             },
                                                     '29' => {
                                                               'name' => 'C_FindObjectsFinal',
                                                               'offset' => '232',
                                                               'type' => '1155633'
                                                             },
                                                     '3' => {
                                                              'name' => 'C_GetInfo',
                                                              'offset' => '24',
                                                              'type' => '1153502'
                                                            },
                                                     '30' => {
                                                               'name' => 'C_EncryptInit',
                                                               'offset' => '240',
                                                               'type' => '1155645'
                                                             },
                                                     '31' => {
                                                               'name' => 'C_Encrypt',
                                                               'offset' => '248',
                                                               'type' => '1155694'
                                                             },
                                                     '32' => {
                                                               'name' => 'C_EncryptUpdate',
                                                               'offset' => '256',
                                                               'type' => '1155747'
                                                             },
                                                     '33' => {
                                                               'name' => 'C_EncryptFinal',
                                                               'offset' => '264',
                                                               'type' => '1155759'
                                                             },
                                                     '34' => {
                                                               'name' => 'C_DecryptInit',
                                                               'offset' => '272',
                                                               'type' => '1155771'
                                                             },
                                                     '35' => {
                                                               'name' => 'C_Decrypt',
                                                               'offset' => '280',
                                                               'type' => '1155783'
                                                             },
                                                     '36' => {
                                                               'name' => 'C_DecryptUpdate',
                                                               'offset' => '288',
                                                               'type' => '1155795'
                                                             },
                                                     '37' => {
                                                               'name' => 'C_DecryptFinal',
                                                               'offset' => '296',
                                                               'type' => '1155807'
                                                             },
                                                     '38' => {
                                                               'name' => 'C_DigestInit',
                                                               'offset' => '304',
                                                               'type' => '1155819'
                                                             },
                                                     '39' => {
                                                               'name' => 'C_Digest',
                                                               'offset' => '312',
                                                               'type' => '1155857'
                                                             },
                                                     '4' => {
                                                              'name' => 'C_GetFunctionList',
                                                              'offset' => '32',
                                                              'type' => '1153541'
                                                            },
                                                     '40' => {
                                                               'name' => 'C_DigestUpdate',
                                                               'offset' => '320',
                                                               'type' => '1155869'
                                                             },
                                                     '41' => {
                                                               'name' => 'C_DigestKey',
                                                               'offset' => '328',
                                                               'type' => '1155881'
                                                             },
                                                     '42' => {
                                                               'name' => 'C_DigestFinal',
                                                               'offset' => '336',
                                                               'type' => '1155893'
                                                             },
                                                     '43' => {
                                                               'name' => 'C_SignInit',
                                                               'offset' => '344',
                                                               'type' => '1155905'
                                                             },
                                                     '44' => {
                                                               'name' => 'C_Sign',
                                                               'offset' => '352',
                                                               'type' => '1155917'
                                                             },
                                                     '45' => {
                                                               'name' => 'C_SignUpdate',
                                                               'offset' => '360',
                                                               'type' => '1155929'
                                                             },
                                                     '46' => {
                                                               'name' => 'C_SignFinal',
                                                               'offset' => '368',
                                                               'type' => '1155941'
                                                             },
                                                     '47' => {
                                                               'name' => 'C_SignRecoverInit',
                                                               'offset' => '376',
                                                               'type' => '1155953'
                                                             },
                                                     '48' => {
                                                               'name' => 'C_SignRecover',
                                                               'offset' => '384',
                                                               'type' => '1155965'
                                                             },
                                                     '49' => {
                                                               'name' => 'C_VerifyInit',
                                                               'offset' => '392',
                                                               'type' => '1155977'
                                                             },
                                                     '5' => {
                                                              'name' => 'C_GetSlotList',
                                                              'offset' => '40',
                                                              'type' => '1154535'
                                                            },
                                                     '50' => {
                                                               'name' => 'C_Verify',
                                                               'offset' => '400',
                                                               'type' => '1155989'
                                                             },
                                                     '51' => {
                                                               'name' => 'C_VerifyUpdate',
                                                               'offset' => '408',
                                                               'type' => '1156001'
                                                             },
                                                     '52' => {
                                                               'name' => 'C_VerifyFinal',
                                                               'offset' => '416',
                                                               'type' => '1156013'
                                                             },
                                                     '53' => {
                                                               'name' => 'C_VerifyRecoverInit',
                                                               'offset' => '424',
                                                               'type' => '1156025'
                                                             },
                                                     '54' => {
                                                               'name' => 'C_VerifyRecover',
                                                               'offset' => '432',
                                                               'type' => '1156037'
                                                             },
                                                     '55' => {
                                                               'name' => 'C_DigestEncryptUpdate',
                                                               'offset' => '440',
                                                               'type' => '1156049'
                                                             },
                                                     '56' => {
                                                               'name' => 'C_DecryptDigestUpdate',
                                                               'offset' => '448',
                                                               'type' => '1156061'
                                                             },
                                                     '57' => {
                                                               'name' => 'C_SignEncryptUpdate',
                                                               'offset' => '456',
                                                               'type' => '1156073'
                                                             },
                                                     '58' => {
                                                               'name' => 'C_DecryptVerifyUpdate',
                                                               'offset' => '464',
                                                               'type' => '1156085'
                                                             },
                                                     '59' => {
                                                               'name' => 'C_GenerateKey',
                                                               'offset' => '472',
                                                               'type' => '1156097'
                                                             },
                                                     '6' => {
                                                              'name' => 'C_GetSlotInfo',
                                                              'offset' => '48',
                                                              'type' => '1154590'
                                                            },
                                                     '60' => {
                                                               'name' => 'C_GenerateKeyPair',
                                                               'offset' => '480',
                                                               'type' => '1156150'
                                                             },
                                                     '61' => {
                                                               'name' => 'C_WrapKey',
                                                               'offset' => '488',
                                                               'type' => '1156218'
                                                             },
                                                     '62' => {
                                                               'name' => 'C_UnwrapKey',
                                                               'offset' => '496',
                                                               'type' => '1156276'
                                                             },
                                                     '63' => {
                                                               'name' => 'C_DeriveKey',
                                                               'offset' => '504',
                                                               'type' => '1156344'
                                                             },
                                                     '64' => {
                                                               'name' => 'C_SeedRandom',
                                                               'offset' => '512',
                                                               'type' => '1156402'
                                                             },
                                                     '65' => {
                                                               'name' => 'C_GenerateRandom',
                                                               'offset' => '520',
                                                               'type' => '1156414'
                                                             },
                                                     '66' => {
                                                               'name' => 'C_GetFunctionStatus',
                                                               'offset' => '528',
                                                               'type' => '1156426'
                                                             },
                                                     '67' => {
                                                               'name' => 'C_CancelFunction',
                                                               'offset' => '536',
                                                               'type' => '1156438'
                                                             },
                                                     '68' => {
                                                               'name' => 'C_WaitForSlotEvent',
                                                               'offset' => '544',
                                                               'type' => '1154678'
                                                             },
                                                     '7' => {
                                                              'name' => 'C_GetTokenInfo',
                                                              'offset' => '56',
                                                              'type' => '1154634'
                                                            },
                                                     '8' => {
                                                              'name' => 'C_GetMechanismList',
                                                              'offset' => '64',
                                                              'type' => '1154721'
                                                            },
                                                     '9' => {
                                                              'name' => 'C_GetMechanismInfo',
                                                              'offset' => '72',
                                                              'type' => '1154770'
                                                            }
                                                   },
                                         'Name' => 'struct ck_function_list',
                                         'Size' => '552',
                                         'Type' => 'Struct'
                                       },
                          '1154535' => {
                                         'BaseType' => '1154547',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '773',
                                         'Name' => 'CK_C_GetSlotList',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154547' => {
                                         'Name' => 'ck_rv_t(*)(unsigned char, ck_slot_id_t*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '152'
                                                             },
                                                      '1' => {
                                                               'type' => '1154578'
                                                             },
                                                      '2' => {
                                                               'type' => '1154584'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154578' => {
                                         'BaseType' => '1152724',
                                         'Name' => 'ck_slot_id_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1154584' => {
                                         'BaseType' => '68',
                                         'Name' => 'unsigned long*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1154590' => {
                                         'BaseType' => '1154602',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '776',
                                         'Name' => 'CK_C_GetSlotInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154602' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, struct ck_slot_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152724'
                                                             },
                                                      '1' => {
                                                               'type' => '1154628'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154628' => {
                                         'BaseType' => '1152735',
                                         'Name' => 'struct ck_slot_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1154634' => {
                                         'BaseType' => '1154646',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '778',
                                         'Name' => 'CK_C_GetTokenInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154646' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, struct ck_token_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152724'
                                                             },
                                                      '1' => {
                                                               'type' => '1154672'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154672' => {
                                         'BaseType' => '1152824',
                                         'Name' => 'struct ck_token_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1154678' => {
                                         'BaseType' => '1154690',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '780',
                                         'Name' => 'CK_C_WaitForSlotEvent',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154690' => {
                                         'Name' => 'ck_rv_t(*)(ck_flags_t, ck_slot_id_t*, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152576'
                                                             },
                                                      '1' => {
                                                               'type' => '1154578'
                                                             },
                                                      '2' => {
                                                               'type' => '211'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154721' => {
                                         'BaseType' => '1154733',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '782',
                                         'Name' => 'CK_C_GetMechanismList',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154733' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, ck_mechanism_type_t*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152724'
                                                             },
                                                      '1' => {
                                                               'type' => '1154764'
                                                             },
                                                      '2' => {
                                                               'type' => '1154584'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154764' => {
                                         'BaseType' => '1153284',
                                         'Name' => 'ck_mechanism_type_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1154770' => {
                                         'BaseType' => '1154782',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '786',
                                         'Name' => 'CK_C_GetMechanismInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154782' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, ck_mechanism_type_t, struct ck_mechanism_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152724'
                                                             },
                                                      '1' => {
                                                               'type' => '1153284'
                                                             },
                                                      '2' => {
                                                               'type' => '1154813'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154813' => {
                                         'BaseType' => '1153349',
                                         'Name' => 'struct ck_mechanism_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1154819' => {
                                         'BaseType' => '1154831',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '789',
                                         'Name' => 'CK_C_InitToken',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154831' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, unsigned char*, unsigned long, unsigned char*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152724'
                                                             },
                                                      '1' => {
                                                               'type' => '3626'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '3626'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154867' => {
                                         'BaseType' => '1154879',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '792',
                                         'Name' => 'CK_C_InitPIN',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154879' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '3626'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154910' => {
                                         'BaseType' => '1154922',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '795',
                                         'Name' => 'CK_C_SetPIN',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154922' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long, unsigned char*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '3626'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '3626'
                                                             },
                                                      '4' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1154963' => {
                                         'BaseType' => '1154975',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '800',
                                         'Name' => 'CK_C_OpenSession',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1154975' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t, ck_flags_t, void*, ck_notify_t, ck_session_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152724'
                                                             },
                                                      '1' => {
                                                               'type' => '1152576'
                                                             },
                                                      '2' => {
                                                               'type' => '211'
                                                             },
                                                      '3' => {
                                                               'type' => '1153414'
                                                             },
                                                      '4' => {
                                                               'type' => '1155016'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155016' => {
                                         'BaseType' => '1153069',
                                         'Name' => 'ck_session_handle_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1155022' => {
                                         'BaseType' => '1155034',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '804',
                                         'Name' => 'CK_C_CloseSession',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155034' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155055' => {
                                         'BaseType' => '1155067',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '805',
                                         'Name' => 'CK_C_CloseAllSessions',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155067' => {
                                         'Name' => 'ck_rv_t(*)(ck_slot_id_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1152724'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155088' => {
                                         'BaseType' => '1155100',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '806',
                                         'Name' => 'CK_C_GetSessionInfo',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155100' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_session_info*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155126'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155126' => {
                                         'BaseType' => '1153105',
                                         'Name' => 'struct ck_session_info*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1155132' => {
                                         'BaseType' => '1155144',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '809',
                                         'Name' => 'CK_C_GetOperationState',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155144' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '3626'
                                                             },
                                                      '2' => {
                                                               'type' => '1154584'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155175' => {
                                         'BaseType' => '1155187',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '813',
                                         'Name' => 'CK_C_SetOperationState',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155187' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long, ck_object_handle_t, ck_object_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '3626'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '1153171'
                                                             },
                                                      '4' => {
                                                               'type' => '1153171'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155228' => {
                                         'BaseType' => '1155240',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '819',
                                         'Name' => 'CK_C_Login',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155240' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_user_type_t, unsigned char*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1153081'
                                                             },
                                                      '2' => {
                                                               'type' => '3626'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155276' => {
                                         'BaseType' => '1155034',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '822',
                                         'Name' => 'CK_C_Logout',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155288' => {
                                         'BaseType' => '1155300',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '824',
                                         'Name' => 'CK_C_CreateObject',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155300' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155336'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '1155342'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155336' => {
                                         'BaseType' => '1153231',
                                         'Name' => 'struct ck_attribute*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1155342' => {
                                         'BaseType' => '1153171',
                                         'Name' => 'ck_object_handle_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1155348' => {
                                         'BaseType' => '1155360',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '828',
                                         'Name' => 'CK_C_CopyObject',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155360' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1153171'
                                                             },
                                                      '2' => {
                                                               'type' => '1155336'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             },
                                                      '4' => {
                                                               'type' => '1155342'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155401' => {
                                         'BaseType' => '1155413',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '832',
                                         'Name' => 'CK_C_DestroyObject',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155413' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1153171'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155439' => {
                                         'BaseType' => '1155451',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '835',
                                         'Name' => 'CK_C_GetObjectSize',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155451' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1153171'
                                                             },
                                                      '2' => {
                                                               'type' => '1154584'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155482' => {
                                         'BaseType' => '1155494',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '839',
                                         'Name' => 'CK_C_GetAttributeValue',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155494' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t, struct ck_attribute*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1153171'
                                                             },
                                                      '2' => {
                                                               'type' => '1155336'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155530' => {
                                         'BaseType' => '1155494',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '844',
                                         'Name' => 'CK_C_SetAttributeValue',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155542' => {
                                         'BaseType' => '1155554',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '849',
                                         'Name' => 'CK_C_FindObjectsInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155554' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_attribute*, unsigned long)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155336'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155585' => {
                                         'BaseType' => '1155597',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '853',
                                         'Name' => 'CK_C_FindObjects',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155597' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, ck_object_handle_t*, unsigned long, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155342'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '1154584'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155633' => {
                                         'BaseType' => '1155034',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '858',
                                         'Name' => 'CK_C_FindObjectsFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155645' => {
                                         'BaseType' => '1155657',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '861',
                                         'Name' => 'CK_C_EncryptInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155657' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, ck_object_handle_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155688'
                                                             },
                                                      '2' => {
                                                               'type' => '1153171'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155688' => {
                                         'BaseType' => '1153296',
                                         'Name' => 'struct ck_mechanism*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1155694' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '865',
                                         'Name' => 'CK_C_Encrypt',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155706' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, unsigned char*, unsigned long, unsigned char*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '3626'
                                                             },
                                                      '2' => {
                                                               'type' => '68'
                                                             },
                                                      '3' => {
                                                               'type' => '3626'
                                                             },
                                                      '4' => {
                                                               'type' => '1154584'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155747' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '870',
                                         'Name' => 'CK_C_EncryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155759' => {
                                         'BaseType' => '1155144',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '875',
                                         'Name' => 'CK_C_EncryptFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155771' => {
                                         'BaseType' => '1155657',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '880',
                                         'Name' => 'CK_C_DecryptInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155783' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '884',
                                         'Name' => 'CK_C_Decrypt',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155795' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '889',
                                         'Name' => 'CK_C_DecryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155807' => {
                                         'BaseType' => '1155144',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '894',
                                         'Name' => 'CK_C_DecryptFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155819' => {
                                         'BaseType' => '1155831',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '899',
                                         'Name' => 'CK_C_DigestInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155831' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155688'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1155857' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '902',
                                         'Name' => 'CK_C_Digest',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155869' => {
                                         'BaseType' => '1154879',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '907',
                                         'Name' => 'CK_C_DigestUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155881' => {
                                         'BaseType' => '1155413',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '910',
                                         'Name' => 'CK_C_DigestKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155893' => {
                                         'BaseType' => '1155144',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '912',
                                         'Name' => 'CK_C_DigestFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155905' => {
                                         'BaseType' => '1155657',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '917',
                                         'Name' => 'CK_C_SignInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155917' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '921',
                                         'Name' => 'CK_C_Sign',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155929' => {
                                         'BaseType' => '1154879',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '926',
                                         'Name' => 'CK_C_SignUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155941' => {
                                         'BaseType' => '1155144',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '929',
                                         'Name' => 'CK_C_SignFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155953' => {
                                         'BaseType' => '1155657',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '933',
                                         'Name' => 'CK_C_SignRecoverInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155965' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '937',
                                         'Name' => 'CK_C_SignRecover',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155977' => {
                                         'BaseType' => '1155657',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '943',
                                         'Name' => 'CK_C_VerifyInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1155989' => {
                                         'BaseType' => '1154922',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '947',
                                         'Name' => 'CK_C_Verify',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156001' => {
                                         'BaseType' => '1154879',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '952',
                                         'Name' => 'CK_C_VerifyUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156013' => {
                                         'BaseType' => '1154879',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '955',
                                         'Name' => 'CK_C_VerifyFinal',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156025' => {
                                         'BaseType' => '1155657',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '959',
                                         'Name' => 'CK_C_VerifyRecoverInit',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156037' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '963',
                                         'Name' => 'CK_C_VerifyRecover',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156049' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '970',
                                         'Name' => 'CK_C_DigestEncryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156061' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '975',
                                         'Name' => 'CK_C_DecryptDigestUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156073' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '981',
                                         'Name' => 'CK_C_SignEncryptUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156085' => {
                                         'BaseType' => '1155706',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '986',
                                         'Name' => 'CK_C_DecryptVerifyUpdate',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156097' => {
                                         'BaseType' => '1156109',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '993',
                                         'Name' => 'CK_C_GenerateKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156109' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155688'
                                                             },
                                                      '2' => {
                                                               'type' => '1155336'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             },
                                                      '4' => {
                                                               'type' => '1155342'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1156150' => {
                                         'BaseType' => '1156162',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '999',
                                         'Name' => 'CK_C_GenerateKeyPair',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156162' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, struct ck_attribute*, unsigned long, struct ck_attribute*, unsigned long, ck_object_handle_t*, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155688'
                                                             },
                                                      '2' => {
                                                               'type' => '1155336'
                                                             },
                                                      '3' => {
                                                               'type' => '68'
                                                             },
                                                      '4' => {
                                                               'type' => '1155336'
                                                             },
                                                      '5' => {
                                                               'type' => '68'
                                                             },
                                                      '6' => {
                                                               'type' => '1155342'
                                                             },
                                                      '7' => {
                                                               'type' => '1155342'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1156218' => {
                                         'BaseType' => '1156230',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1008',
                                         'Name' => 'CK_C_WrapKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156230' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, ck_object_handle_t, ck_object_handle_t, unsigned char*, unsigned long*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155688'
                                                             },
                                                      '2' => {
                                                               'type' => '1153171'
                                                             },
                                                      '3' => {
                                                               'type' => '1153171'
                                                             },
                                                      '4' => {
                                                               'type' => '3626'
                                                             },
                                                      '5' => {
                                                               'type' => '1154584'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1156276' => {
                                         'BaseType' => '1156288',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1015',
                                         'Name' => 'CK_C_UnwrapKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156288' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, ck_object_handle_t, unsigned char*, unsigned long, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155688'
                                                             },
                                                      '2' => {
                                                               'type' => '1153171'
                                                             },
                                                      '3' => {
                                                               'type' => '3626'
                                                             },
                                                      '4' => {
                                                               'type' => '68'
                                                             },
                                                      '5' => {
                                                               'type' => '1155336'
                                                             },
                                                      '6' => {
                                                               'type' => '68'
                                                             },
                                                      '7' => {
                                                               'type' => '1155342'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1156344' => {
                                         'BaseType' => '1156356',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1024',
                                         'Name' => 'CK_C_DeriveKey',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156356' => {
                                         'Name' => 'ck_rv_t(*)(ck_session_handle_t, struct ck_mechanism*, ck_object_handle_t, struct ck_attribute*, unsigned long, ck_object_handle_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1153069'
                                                             },
                                                      '1' => {
                                                               'type' => '1155688'
                                                             },
                                                      '2' => {
                                                               'type' => '1153171'
                                                             },
                                                      '3' => {
                                                               'type' => '1155336'
                                                             },
                                                      '4' => {
                                                               'type' => '68'
                                                             },
                                                      '5' => {
                                                               'type' => '1155342'
                                                             }
                                                    },
                                         'Return' => '1153402',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1156402' => {
                                         'BaseType' => '1154879',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1032',
                                         'Name' => 'CK_C_SeedRandom',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156414' => {
                                         'BaseType' => '1154879',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1035',
                                         'Name' => 'CK_C_GenerateRandom',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156426' => {
                                         'BaseType' => '1155034',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1040',
                                         'Name' => 'CK_C_GetFunctionStatus',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156438' => {
                                         'BaseType' => '1155034',
                                         'Header' => 'pkcs11.h',
                                         'Line' => '1041',
                                         'Name' => 'CK_C_CancelFunction',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1156599' => {
                                         'Header' => 'pkcs11_int.h',
                                         'Line' => '37',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'module',
                                                              'offset' => '0',
                                                              'type' => '1153580'
                                                            },
                                                     '1' => {
                                                              'name' => 'tinfo',
                                                              'offset' => '8',
                                                              'type' => '1152824'
                                                            },
                                                     '2' => {
                                                              'name' => 'slot_info',
                                                              'offset' => '216',
                                                              'type' => '1152735'
                                                            },
                                                     '3' => {
                                                              'name' => 'pks',
                                                              'offset' => '328',
                                                              'type' => '1153069'
                                                            },
                                                     '4' => {
                                                              'name' => 'sid',
                                                              'offset' => '336',
                                                              'type' => '1152724'
                                                            },
                                                     '5' => {
                                                              'name' => 'init',
                                                              'offset' => '344',
                                                              'type' => '145'
                                                            }
                                                   },
                                         'Name' => 'struct pkcs11_session_info',
                                         'PrivateABI' => 1,
                                         'Size' => '352',
                                         'Type' => 'Struct'
                                       },
                          '1157105' => {
                                         'BaseType' => '883485',
                                         'Name' => 'gnutls_pkcs11_obj_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1157111' => {
                                         'BaseType' => '1157105',
                                         'Name' => 'gnutls_pkcs11_obj_t*const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '116' => {
                                     'BaseType' => '110',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '1164428' => {
                                         'BaseType' => '1157105',
                                         'Name' => 'gnutls_pkcs11_obj_t**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1194089' => {
                                         'Header' => 'x509.h',
                                         'Line' => '1418',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'oid',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'critical',
                                                              'offset' => '8',
                                                              'type' => '145'
                                                            },
                                                     '2' => {
                                                              'name' => 'data',
                                                              'offset' => '16',
                                                              'type' => '3632'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_ext_st',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1194142' => {
                                         'BaseType' => '1194089',
                                         'Header' => 'x509.h',
                                         'Line' => '1422',
                                         'Name' => 'gnutls_x509_ext_st',
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1206728' => {
                                         'BaseType' => '1194142',
                                         'Name' => 'gnutls_x509_ext_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1207285' => {
                                         'BaseType' => '1206728',
                                         'Name' => 'gnutls_x509_ext_st**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '121' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '12416' => {
                                       'BaseType' => '7999',
                                       'Name' => 'handshake_buffer_st[6]',
                                       'Size' => '432',
                                       'Type' => 'Array'
                                     },
                          '12432' => {
                                       'Header' => 'gnutls_auth.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '110'
                                                          },
                                                   '1' => {
                                                            'name' => 'gnutls_generate_server_certificate',
                                                            'offset' => '8',
                                                            'type' => '12743'
                                                          },
                                                   '10' => {
                                                             'name' => 'gnutls_process_client_kx',
                                                             'offset' => '80',
                                                             'type' => '12774'
                                                           },
                                                   '11' => {
                                                             'name' => 'gnutls_process_client_crt_vrfy',
                                                             'offset' => '88',
                                                             'type' => '12774'
                                                           },
                                                   '12' => {
                                                             'name' => 'gnutls_process_server_crt_request',
                                                             'offset' => '96',
                                                             'type' => '12774'
                                                           },
                                                   '2' => {
                                                            'name' => 'gnutls_generate_client_certificate',
                                                            'offset' => '16',
                                                            'type' => '12743'
                                                          },
                                                   '3' => {
                                                            'name' => 'gnutls_generate_server_kx',
                                                            'offset' => '24',
                                                            'type' => '12743'
                                                          },
                                                   '4' => {
                                                            'name' => 'gnutls_generate_client_kx',
                                                            'offset' => '32',
                                                            'type' => '12743'
                                                          },
                                                   '5' => {
                                                            'name' => 'gnutls_generate_client_crt_vrfy',
                                                            'offset' => '40',
                                                            'type' => '12743'
                                                          },
                                                   '6' => {
                                                            'name' => 'gnutls_generate_server_crt_request',
                                                            'offset' => '48',
                                                            'type' => '12743'
                                                          },
                                                   '7' => {
                                                            'name' => 'gnutls_process_server_certificate',
                                                            'offset' => '56',
                                                            'type' => '12774'
                                                          },
                                                   '8' => {
                                                            'name' => 'gnutls_process_client_certificate',
                                                            'offset' => '64',
                                                            'type' => '12774'
                                                          },
                                                   '9' => {
                                                            'name' => 'gnutls_process_server_kx',
                                                            'offset' => '72',
                                                            'type' => '12774'
                                                          }
                                                 },
                                       'Name' => 'struct mod_auth_st_int',
                                       'PrivateABI' => 1,
                                       'Size' => '104',
                                       'Type' => 'Struct'
                                     },
                          '12601' => {
                                       'BaseType' => '12432',
                                       'Name' => 'struct mod_auth_st_int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12607' => {
                                       'BaseType' => '957',
                                       'Name' => 'uint16_t[32]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '12623' => {
                                       'BaseType' => '10923',
                                       'Name' => 'anon-struct-gnutls_int.h-941[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '12639' => {
                                       'BaseType' => '10972',
                                       'Name' => 'anon-struct-gnutls_int.h-947[32]',
                                       'Size' => '768',
                                       'Type' => 'Array'
                                     },
                          '12655' => {
                                       'BaseType' => '152',
                                       'Name' => 'unsigned char[36]',
                                       'Size' => '36',
                                       'Type' => 'Array'
                                     },
                          '12671' => {
                                       'BaseType' => '3865',
                                       'Name' => 'gnutls_certificate_verify_function*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12677' => {
                                       'BaseType' => '3991',
                                       'Name' => 'gnutls_typed_vdata_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12683' => {
                                       'Header' => 'gnutls_int.h',
                                       'Line' => '1019',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'record_buffer',
                                                            'offset' => '0',
                                                            'type' => '8095'
                                                          },
                                                   '1' => {
                                                            'name' => 'handshake_hash_buffer_prev_len',
                                                            'offset' => '32',
                                                            'type' => '75'
                                                          },
                                                   '10' => {
                                                             'name' => 'may_not_write',
                                                             'offset' => '86',
                                                             'type' => '8952'
                                                           },
                                                   '11' => {
                                                             'name' => 'read_eof',
                                                             'offset' => '87',
                                                             'type' => '8952'
                                                           },
                                                   '12' => {
                                                             'name' => 'last_alert',
                                                             'offset' => '88',
                                                             'type' => '75'
                                                           },
                                                   '13' => {
                                                             'name' => 'last_handshake_in',
                                                             'offset' => '92',
                                                             'type' => '75'
                                                           },
                                                   '14' => {
                                                             'name' => 'last_handshake_out',
                                                             'offset' => '96',
                                                             'type' => '75'
                                                           },
                                                   '15' => {
                                                             'name' => 'priorities',
                                                             'offset' => '100',
                                                             'type' => '3243'
                                                           },
                                                   '16' => {
                                                             'name' => 'resumed',
                                                             'offset' => '1192',
                                                             'type' => '8952'
                                                           },
                                                   '17' => {
                                                             'name' => 'resumption_requested',
                                                             'offset' => '1193',
                                                             'type' => '8952'
                                                           },
                                                   '18' => {
                                                             'name' => 'resumed_security_parameters',
                                                             'offset' => '1200',
                                                             'type' => '10542'
                                                           },
                                                   '19' => {
                                                             'name' => 'handshake_send_buffer',
                                                             'offset' => '1424',
                                                             'type' => '8095'
                                                           },
                                                   '2' => {
                                                            'name' => 'handshake_hash_buffer_client_kx_len',
                                                            'offset' => '36',
                                                            'type' => '145'
                                                          },
                                                   '20' => {
                                                             'name' => 'handshake_recv_buffer',
                                                             'offset' => '1456',
                                                             'type' => '12416'
                                                           },
                                                   '21' => {
                                                             'name' => 'handshake_recv_buffer_size',
                                                             'offset' => '1888',
                                                             'type' => '75'
                                                           },
                                                   '22' => {
                                                             'name' => 'record_recv_buffer',
                                                             'offset' => '1896',
                                                             'type' => '8095'
                                                           },
                                                   '23' => {
                                                             'name' => 'record_send_buffer',
                                                             'offset' => '1928',
                                                             'type' => '8095'
                                                           },
                                                   '24' => {
                                                             'name' => 'record_send_buffer_user_size',
                                                             'offset' => '1960',
                                                             'type' => '52'
                                                           },
                                                   '25' => {
                                                             'name' => 'record_flush_mode',
                                                             'offset' => '1968',
                                                             'type' => '5465'
                                                           },
                                                   '26' => {
                                                             'name' => 'record_presend_buffer',
                                                             'offset' => '1976',
                                                             'type' => '7709'
                                                           },
                                                   '27' => {
                                                             'name' => 'expire_time',
                                                             'offset' => '2008',
                                                             'type' => '145'
                                                           },
                                                   '28' => {
                                                             'name' => 'auth_struct',
                                                             'offset' => '2016',
                                                             'type' => '12601'
                                                           },
                                                   '29' => {
                                                             'name' => 'adv_version_major',
                                                             'offset' => '2024',
                                                             'type' => '946'
                                                           },
                                                   '3' => {
                                                            'name' => 'handshake_hash_buffer',
                                                            'offset' => '40',
                                                            'type' => '7709'
                                                          },
                                                   '30' => {
                                                             'name' => 'adv_version_minor',
                                                             'offset' => '2025',
                                                             'type' => '946'
                                                           },
                                                   '31' => {
                                                             'name' => 'send_cert_req',
                                                             'offset' => '2028',
                                                             'type' => '145'
                                                           },
                                                   '32' => {
                                                             'name' => 'max_handshake_data_buffer_size',
                                                             'offset' => '2032',
                                                             'type' => '52'
                                                           },
                                                   '33' => {
                                                             'name' => 'pull_timeout_func',
                                                             'offset' => '2040',
                                                             'type' => '4710'
                                                           },
                                                   '34' => {
                                                             'name' => 'pull_func',
                                                             'offset' => '2048',
                                                             'type' => '4624'
                                                           },
                                                   '35' => {
                                                             'name' => 'push_func',
                                                             'offset' => '2056',
                                                             'type' => '4667'
                                                           },
                                                   '36' => {
                                                             'name' => 'vec_push_func',
                                                             'offset' => '2064',
                                                             'type' => '4748'
                                                           },
                                                   '37' => {
                                                             'name' => 'errno_func',
                                                             'offset' => '2072',
                                                             'type' => '4797'
                                                           },
                                                   '38' => {
                                                             'name' => 'transport_recv_ptr',
                                                             'offset' => '2080',
                                                             'type' => '3086'
                                                           },
                                                   '39' => {
                                                             'name' => 'transport_send_ptr',
                                                             'offset' => '2088',
                                                             'type' => '3086'
                                                           },
                                                   '4' => {
                                                            'name' => 'resumable',
                                                            'offset' => '72',
                                                            'type' => '8952'
                                                          },
                                                   '40' => {
                                                             'name' => 'db_store_func',
                                                             'offset' => '2096',
                                                             'type' => '4003'
                                                           },
                                                   '41' => {
                                                             'name' => 'db_retrieve_func',
                                                             'offset' => '2104',
                                                             'type' => '4084'
                                                           },
                                                   '42' => {
                                                             'name' => 'db_remove_func',
                                                             'offset' => '2112',
                                                             'type' => '4046'
                                                           },
                                                   '43' => {
                                                             'name' => 'db_ptr',
                                                             'offset' => '2120',
                                                             'type' => '211'
                                                           },
                                                   '44' => {
                                                             'name' => 'user_hello_func',
                                                             'offset' => '2128',
                                                             'type' => '4181'
                                                           },
                                                   '45' => {
                                                             'name' => 'h_hook',
                                                             'offset' => '2136',
                                                             'type' => '4122'
                                                           },
                                                   '46' => {
                                                             'name' => 'h_type',
                                                             'offset' => '2144',
                                                             'type' => '145'
                                                           },
                                                   '47' => {
                                                             'name' => 'h_post',
                                                             'offset' => '2148',
                                                             'type' => '263'
                                                           },
                                                   '48' => {
                                                             'name' => 'selected_cert_list',
                                                             'offset' => '2152',
                                                             'type' => '5142'
                                                           },
                                                   '49' => {
                                                             'name' => 'selected_cert_list_length',
                                                             'offset' => '2160',
                                                             'type' => '263'
                                                           },
                                                   '5' => {
                                                            'name' => 'ticket_sent',
                                                            'offset' => '73',
                                                            'type' => '8952'
                                                          },
                                                   '50' => {
                                                             'name' => 'selected_key',
                                                             'offset' => '2168',
                                                             'type' => '4222'
                                                           },
                                                   '51' => {
                                                             'name' => 'selected_need_free',
                                                             'offset' => '2176',
                                                             'type' => '8952'
                                                           },
                                                   '52' => {
                                                             'name' => 'extensions_sent',
                                                             'offset' => '2178',
                                                             'type' => '12607'
                                                           },
                                                   '53' => {
                                                             'name' => 'extensions_sent_size',
                                                             'offset' => '2242',
                                                             'type' => '957'
                                                           },
                                                   '54' => {
                                                             'name' => 'pgp_fingerprint',
                                                             'offset' => '2244',
                                                             'type' => '8952'
                                                           },
                                                   '55' => {
                                                             'name' => 'default_record_version',
                                                             'offset' => '2245',
                                                             'type' => '10488'
                                                           },
                                                   '56' => {
                                                             'name' => 'default_hello_version',
                                                             'offset' => '2247',
                                                             'type' => '10488'
                                                           },
                                                   '57' => {
                                                             'name' => 'user_ptr',
                                                             'offset' => '2256',
                                                             'type' => '211'
                                                           },
                                                   '58' => {
                                                             'name' => 'enable_private',
                                                             'offset' => '2264',
                                                             'type' => '8952'
                                                           },
                                                   '59' => {
                                                             'name' => 'direction',
                                                             'offset' => '2265',
                                                             'type' => '8952'
                                                           },
                                                   '6' => {
                                                            'name' => 'handshake_final_state',
                                                            'offset' => '76',
                                                            'type' => '7606'
                                                          },
                                                   '60' => {
                                                             'name' => 'openpgp_recv_key_func',
                                                             'offset' => '2272',
                                                             'type' => '5029'
                                                           },
                                                   '61' => {
                                                             'name' => 'ignore_rdn_sequence',
                                                             'offset' => '2280',
                                                             'type' => '8952'
                                                           },
                                                   '62' => {
                                                             'name' => 'rsa_pms_version',
                                                             'offset' => '2281',
                                                             'type' => '10488'
                                                           },
                                                   '63' => {
                                                             'name' => 'params',
                                                             'offset' => '2288',
                                                             'type' => '10720'
                                                           },
                                                   '64' => {
                                                             'name' => 'errnum',
                                                             'offset' => '2304',
                                                             'type' => '75'
                                                           },
                                                   '65' => {
                                                             'name' => 'srp_prime_bits',
                                                             'offset' => '2308',
                                                             'type' => '957'
                                                           },
                                                   '66' => {
                                                             'name' => 'initial_negotiation_completed',
                                                             'offset' => '2310',
                                                             'type' => '8952'
                                                           },
                                                   '67' => {
                                                             'name' => 'extension_int_data',
                                                             'offset' => '2312',
                                                             'type' => '12623'
                                                           },
                                                   '68' => {
                                                             'name' => 'resumed_extension_int_data',
                                                             'offset' => '3080',
                                                             'type' => '12639'
                                                           },
                                                   '69' => {
                                                             'name' => 'transport',
                                                             'offset' => '3848',
                                                             'type' => '5425'
                                                           },
                                                   '7' => {
                                                            'name' => 'handshake_state',
                                                            'offset' => '80',
                                                            'type' => '7606'
                                                          },
                                                   '70' => {
                                                             'name' => 'dtls',
                                                             'offset' => '3856',
                                                             'type' => '10911'
                                                           },
                                                   '71' => {
                                                             'name' => 'handshake_suspicious_loops',
                                                             'offset' => '3944',
                                                             'type' => '145'
                                                           },
                                                   '72' => {
                                                             'name' => 'handshake_in_progress',
                                                             'offset' => '3948',
                                                             'type' => '8952'
                                                           },
                                                   '73' => {
                                                             'name' => 'premaster_set',
                                                             'offset' => '3949',
                                                             'type' => '8952'
                                                           },
                                                   '74' => {
                                                             'name' => 'cb_tls_unique_len',
                                                             'offset' => '3952',
                                                             'type' => '145'
                                                           },
                                                   '75' => {
                                                             'name' => 'cb_tls_unique',
                                                             'offset' => '3956',
                                                             'type' => '12655'
                                                           },
                                                   '76' => {
                                                             'name' => 'handshake_start_time',
                                                             'offset' => '3992',
                                                             'type' => '274'
                                                           },
                                                   '77' => {
                                                             'name' => 'handshake_endtime',
                                                             'offset' => '4008',
                                                             'type' => '252'
                                                           },
                                                   '78' => {
                                                             'name' => 'handshake_timeout_ms',
                                                             'offset' => '4016',
                                                             'type' => '145'
                                                           },
                                                   '79' => {
                                                             'name' => 'record_timeout_ms',
                                                             'offset' => '4020',
                                                             'type' => '145'
                                                           },
                                                   '8' => {
                                                            'name' => 'invalid_connection',
                                                            'offset' => '84',
                                                            'type' => '8952'
                                                          },
                                                   '80' => {
                                                             'name' => 'hb_local_data',
                                                             'offset' => '4024',
                                                             'type' => '7709'
                                                           },
                                                   '81' => {
                                                             'name' => 'hb_remote_data',
                                                             'offset' => '4056',
                                                             'type' => '7709'
                                                           },
                                                   '82' => {
                                                             'name' => 'hb_ping_start',
                                                             'offset' => '4088',
                                                             'type' => '274'
                                                           },
                                                   '83' => {
                                                             'name' => 'hb_ping_sent',
                                                             'offset' => '4104',
                                                             'type' => '274'
                                                           },
                                                   '84' => {
                                                             'name' => 'hb_actual_retrans_timeout_ms',
                                                             'offset' => '4120',
                                                             'type' => '145'
                                                           },
                                                   '85' => {
                                                             'name' => 'hb_retrans_timeout_ms',
                                                             'offset' => '4124',
                                                             'type' => '145'
                                                           },
                                                   '86' => {
                                                             'name' => 'hb_total_timeout_ms',
                                                             'offset' => '4128',
                                                             'type' => '145'
                                                           },
                                                   '87' => {
                                                             'name' => 'ocsp_check_ok',
                                                             'offset' => '4132',
                                                             'type' => '8952'
                                                           },
                                                   '88' => {
                                                             'name' => 'hb_state',
                                                             'offset' => '4136',
                                                             'type' => '7652'
                                                           },
                                                   '89' => {
                                                             'name' => 'recv_state',
                                                             'offset' => '4140',
                                                             'type' => '7692'
                                                           },
                                                   '9' => {
                                                            'name' => 'may_not_read',
                                                            'offset' => '85',
                                                            'type' => '8952'
                                                          },
                                                   '90' => {
                                                             'name' => 'sc_random_set',
                                                             'offset' => '4144',
                                                             'type' => '8952'
                                                           },
                                                   '91' => {
                                                             'name' => 'no_replay_protection',
                                                             'offset' => '4145',
                                                             'type' => '8952'
                                                           },
                                                   '92' => {
                                                             'name' => 'try_ext_master_secret',
                                                             'offset' => '4146',
                                                             'type' => '8952'
                                                           },
                                                   '93' => {
                                                             'name' => 'verify_callback',
                                                             'offset' => '4152',
                                                             'type' => '12671'
                                                           },
                                                   '94' => {
                                                             'name' => 'vc_data',
                                                             'offset' => '4160',
                                                             'type' => '12677'
                                                           },
                                                   '95' => {
                                                             'name' => 'vc_sdata',
                                                             'offset' => '4168',
                                                             'type' => '3991'
                                                           },
                                                   '96' => {
                                                             'name' => 'vc_elements',
                                                             'offset' => '4192',
                                                             'type' => '145'
                                                           },
                                                   '97' => {
                                                             'name' => 'vc_status',
                                                             'offset' => '4196',
                                                             'type' => '145'
                                                           },
                                                   '98' => {
                                                             'name' => 'additional_verify_flags',
                                                             'offset' => '4200',
                                                             'type' => '145'
                                                           },
                                                   '99' => {
                                                             'name' => 'blocking',
                                                             'offset' => '4204',
                                                             'type' => '8952'
                                                           }
                                                 },
                                       'Name' => 'struct internals_st',
                                       'PrivateABI' => 1,
                                       'Size' => '4208',
                                       'Type' => 'Struct'
                                     },
                          '12695' => {
                                       'BaseType' => '12711',
                                       'Name' => 'record_parameters_st*[16]',
                                       'Size' => '128',
                                       'Type' => 'Array'
                                     },
                          '12711' => {
                                       'BaseType' => '8621',
                                       'Name' => 'record_parameters_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12737' => {
                                       'BaseType' => '7709',
                                       'Name' => 'gnutls_buffer_st*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '12743' => {
                                       'Name' => 'int(*)(gnutls_session_t, gnutls_buffer_st*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3098'
                                                           },
                                                    '1' => {
                                                             'type' => '12737'
                                                           }
                                                  },
                                       'Return' => '75',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '12774' => {
                                       'Name' => 'int(*)(gnutls_session_t, uint8_t*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3098'
                                                           },
                                                    '1' => {
                                                             'type' => '7703'
                                                           },
                                                    '2' => {
                                                             'type' => '52'
                                                           }
                                                  },
                                       'Return' => '75',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '128' => {
                                     'BaseType' => '121',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1307663' => {
                                         'BaseType' => '1307675',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1781',
                                         'Name' => 'gnutls_srp_server_credentials_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1307675' => {
                                         'BaseType' => '1307681',
                                         'Name' => 'struct gnutls_srp_server_credentials_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1307681' => {
                                         'Header' => 'srp.h',
                                         'Line' => '34',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'password_file',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'password_conf_file',
                                                              'offset' => '8',
                                                              'type' => '235'
                                                            },
                                                     '2' => {
                                                              'name' => 'pwd_callback',
                                                              'offset' => '16',
                                                              'type' => '1316055'
                                                            },
                                                     '3' => {
                                                              'name' => 'fake_salt_seed',
                                                              'offset' => '24',
                                                              'type' => '3632'
                                                            },
                                                     '4' => {
                                                              'name' => 'fake_salt_length',
                                                              'offset' => '40',
                                                              'type' => '145'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_srp_server_credentials_st',
                                         'PrivateABI' => 1,
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1307754' => {
                                         'BaseType' => '1307766',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1783',
                                         'Name' => 'gnutls_srp_client_credentials_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1307766' => {
                                         'BaseType' => '1307772',
                                         'Name' => 'struct gnutls_srp_client_credentials_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1307772' => {
                                         'Header' => 'srp.h',
                                         'Line' => '28',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'username',
                                                              'offset' => '0',
                                                              'type' => '235'
                                                            },
                                                     '1' => {
                                                              'name' => 'password',
                                                              'offset' => '8',
                                                              'type' => '235'
                                                            },
                                                     '2' => {
                                                              'name' => 'get_function',
                                                              'offset' => '16',
                                                              'type' => '1316049'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_srp_client_credentials_st',
                                         'PrivateABI' => 1,
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1307941' => {
                                         'BaseType' => '1307953',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1833',
                                         'Name' => 'gnutls_srp_server_credentials_function',
                                         'Type' => 'Typedef'
                                       },
                          '1307953' => {
                                         'Name' => 'int()(gnutls_session_t, char const*, gnutls_datum_t*, gnutls_datum_t*, gnutls_datum_t*, gnutls_datum_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3098'
                                                             },
                                                      '1' => {
                                                               'type' => '110'
                                                             },
                                                      '2' => {
                                                               'type' => '4233'
                                                             },
                                                      '3' => {
                                                               'type' => '4233'
                                                             },
                                                      '4' => {
                                                               'type' => '4233'
                                                             },
                                                      '5' => {
                                                               'type' => '4233'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Type' => 'Func'
                                       },
                          '1307993' => {
                                         'BaseType' => '1308005',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1847',
                                         'Name' => 'gnutls_srp_client_credentials_function',
                                         'Type' => 'Typedef'
                                       },
                          '1308005' => {
                                         'Name' => 'int()(gnutls_session_t, char**, char**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3098'
                                                             },
                                                      '1' => {
                                                               'type' => '1002'
                                                             },
                                                      '2' => {
                                                               'type' => '1002'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Type' => 'Func'
                                       },
                          '1316049' => {
                                         'BaseType' => '1307993',
                                         'Name' => 'gnutls_srp_client_credentials_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1316055' => {
                                         'BaseType' => '1307941',
                                         'Name' => 'gnutls_srp_server_credentials_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1318138' => {
                                         'BaseType' => '1307663',
                                         'Name' => 'gnutls_srp_server_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1318492' => {
                                         'BaseType' => '1307754',
                                         'Name' => 'gnutls_srp_client_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1328726' => {
                                         'BaseType' => '1328738',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1878',
                                         'Name' => 'gnutls_psk_client_credentials_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1328738' => {
                                         'BaseType' => '1328744',
                                         'Name' => 'struct gnutls_psk_client_credentials_st*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1328744' => {
                                         'Header' => 'psk.h',
                                         'Line' => '29',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'username',
                                                              'offset' => '0',
                                                              'type' => '3632'
                                                            },
                                                     '1' => {
                                                              'name' => 'key',
                                                              'offset' => '16',
                                                              'type' => '3632'
                                                            },
                                                     '2' => {
                                                              'name' => 'get_function',
                                                              'offset' => '32',
                                                              'type' => '1336807'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_psk_client_credentials_st',
                                         'PrivateABI' => 1,
                                         'Size' => '40',
                                         'Type' => 'Struct'
                                       },
                          '1328793' => {
                                         'Header' => 'gnutls.h',
                                         'Line' => '1887',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'GNUTLS_PSK_KEY_RAW',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'GNUTLS_PSK_KEY_HEX',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum gnutls_psk_key_flags',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1328823' => {
                                         'BaseType' => '1328793',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1890',
                                         'Name' => 'gnutls_psk_key_flags',
                                         'Size' => '4',
                                         'Type' => 'Typedef'
                                       },
                          '1328872' => {
                                         'BaseType' => '1328884',
                                         'Header' => 'gnutls.h',
                                         'Line' => '1926',
                                         'Name' => 'gnutls_psk_client_credentials_function',
                                         'Type' => 'Typedef'
                                       },
                          '1328884' => {
                                         'Name' => 'int()(gnutls_session_t, char**, gnutls_datum_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3098'
                                                             },
                                                      '1' => {
                                                               'type' => '1002'
                                                             },
                                                      '2' => {
                                                               'type' => '4233'
                                                             }
                                                    },
                                         'Return' => '75',
                                         'Type' => 'Func'
                                       },
                          '1336807' => {
                                         'BaseType' => '1328872',
                                         'Name' => 'gnutls_psk_client_credentials_function*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1337779' => {
                                         'BaseType' => '586075',
                                         'Name' => 'gnutls_psk_server_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1338394' => {
                                         'BaseType' => '1328726',
                                         'Name' => 'gnutls_psk_client_credentials_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1342545' => {
                                         'BaseType' => '178',
                                         'Header' => 'stdio.h',
                                         'Line' => '90',
                                         'Name' => 'off_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1361353' => {
                                         'BaseType' => '121',
                                         'Name' => 'char[64]',
                                         'Size' => '64',
                                         'Type' => 'Array'
                                       },
                          '13694' => {
                                       'BaseType' => '3697',
                                       'Name' => 'gnutls_range_st const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '140470' => {
                                        'BaseType' => '121',
                                        'Name' => 'char[32]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '142364' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '210',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'GNUTLS_PARAMS_RSA_EXPORT',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'GNUTLS_PARAMS_DH',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'GNUTLS_PARAMS_ECDH',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum gnutls_params_type_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '143221' => {
                                        'BaseType' => '2768',
                                        'Name' => 'gnutls_pk_algorithm_t const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '1432880' => {
                                         'BaseType' => '742906',
                                         'Name' => 'gnutls_x509_crl_t const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1433999' => {
                                         'BaseType' => '1434011',
                                         'Header' => 'x509.h',
                                         'Line' => '701',
                                         'Name' => 'gnutls_x509_crl_iter_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1434011' => {
                                         'BaseType' => '1434017',
                                         'Name' => 'struct gnutls_x509_crl_iter*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1434017' => {
                                         'Header' => 'x509_int.h',
                                         'Line' => '45',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'rcache',
                                                              'offset' => '0',
                                                              'type' => '9632'
                                                            },
                                                     '1' => {
                                                              'name' => 'rcache_idx',
                                                              'offset' => '8',
                                                              'type' => '145'
                                                            }
                                                   },
                                         'Name' => 'struct gnutls_x509_crl_iter',
                                         'PrivateABI' => 1,
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '143689' => {
                                        'BaseType' => '143701',
                                        'Header' => 'gnutls.h',
                                        'Line' => '790',
                                        'Name' => 'gnutls_rsa_params_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '143701' => {
                                        'BaseType' => '143707',
                                        'Name' => 'struct gnutls_x509_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '143707' => {
                                        'Header' => 'x509_int.h',
                                        'Line' => '116',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'params',
                                                             'offset' => '0',
                                                             'type' => '7376'
                                                           },
                                                    '1' => {
                                                             'name' => 'pk_algorithm',
                                                             'offset' => '144',
                                                             'type' => '2768'
                                                           },
                                                    '2' => {
                                                             'name' => 'expanded',
                                                             'offset' => '148',
                                                             'type' => '145'
                                                           },
                                                    '3' => {
                                                             'name' => 'key',
                                                             'offset' => '152',
                                                             'type' => '9632'
                                                           },
                                                    '4' => {
                                                             'name' => 'pin',
                                                             'offset' => '160',
                                                             'type' => '150955'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_privkey_int',
                                        'PrivateABI' => 1,
                                        'Size' => '176',
                                        'Type' => 'Struct'
                                      },
                          '144186' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '803',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dh',
                                                             'offset' => '0',
                                                             'type' => '3185'
                                                           },
                                                    '1' => {
                                                             'name' => 'rsa_export',
                                                             'offset' => '0',
                                                             'type' => '143689'
                                                           }
                                                  },
                                        'Name' => 'union params',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '144223' => {
                                        'Header' => 'gnutls.h',
                                        'Line' => '801',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '142364'
                                                           },
                                                    '1' => {
                                                             'name' => 'params',
                                                             'offset' => '8',
                                                             'type' => '144186'
                                                           },
                                                    '2' => {
                                                             'name' => 'deinit',
                                                             'offset' => '16',
                                                             'type' => '75'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_params_st',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '144276' => {
                                        'BaseType' => '144223',
                                        'Header' => 'gnutls.h',
                                        'Line' => '808',
                                        'Name' => 'gnutls_params_st',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '144288' => {
                                        'BaseType' => '144300',
                                        'Header' => 'gnutls.h',
                                        'Line' => '810',
                                        'Name' => 'gnutls_params_function',
                                        'Type' => 'Typedef'
                                      },
                          '144300' => {
                                        'Name' => 'int()(gnutls_session_t, gnutls_params_type_t, gnutls_params_st*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '3098'
                                                            },
                                                     '1' => {
                                                              'type' => '142364'
                                                            },
                                                     '2' => {
                                                              'type' => '144325'
                                                            }
                                                   },
                                        'Return' => '75',
                                        'Type' => 'Func'
                                      },
                          '144325' => {
                                        'BaseType' => '144276',
                                        'Name' => 'gnutls_params_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1443301' => {
                                         'BaseType' => '756477',
                                         'Name' => 'gnutls_x509_crl_t**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1447392' => {
                                         'BaseType' => '1433999',
                                         'Name' => 'gnutls_x509_crl_iter_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '144851' => {
                                        'BaseType' => '4222',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1379',
                                        'Name' => 'gnutls_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '144874' => {
                                        'BaseType' => '143701',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1382',
                                        'Name' => 'gnutls_x509_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '144886' => {
                                        'BaseType' => '144898',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1388',
                                        'Name' => 'gnutls_x509_crt_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '144898' => {
                                        'BaseType' => '144904',
                                        'Name' => 'struct gnutls_x509_crt_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '144904' => {
                                        'Header' => 'x509_int.h',
                                        'Line' => '68',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'cert',
                                                             'offset' => '0',
                                                             'type' => '9632'
                                                           },
                                                    '1' => {
                                                             'name' => 'use_extensions',
                                                             'offset' => '8',
                                                             'type' => '75'
                                                           },
                                                    '2' => {
                                                             'name' => 'expanded',
                                                             'offset' => '12',
                                                             'type' => '75'
                                                           },
                                                    '3' => {
                                                             'name' => 'raw_dn',
                                                             'offset' => '16',
                                                             'type' => '3632'
                                                           },
                                                    '4' => {
                                                             'name' => 'raw_issuer_dn',
                                                             'offset' => '32',
                                                             'type' => '3632'
                                                           },
                                                    '5' => {
                                                             'name' => 'raw_spki',
                                                             'offset' => '48',
                                                             'type' => '3632'
                                                           },
                                                    '6' => {
                                                             'name' => 'der',
                                                             'offset' => '64',
                                                             'type' => '3632'
                                                           },
                                                    '7' => {
                                                             'name' => 'pin',
                                                             'offset' => '80',
                                                             'type' => '150955'
                                                           },
                                                    '8' => {
                                                             'name' => 'dn',
                                                             'offset' => '96',
                                                             'type' => '155384'
                                                           },
                                                    '9' => {
                                                             'name' => 'idn',
                                                             'offset' => '104',
                                                             'type' => '155384'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_x509_crt_int',
                                        'PrivateABI' => 1,
                                        'Size' => '112',
                                        'Type' => 'Struct'
                                      },
                          '145' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '145036' => {
                                        'BaseType' => '145048',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1394',
                                        'Name' => 'gnutls_openpgp_keyring_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '145048' => {
                                        'BaseType' => '145054',
                                        'Name' => 'struct gnutls_openpgp_keyring_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '145054' => {
                                        'Header' => 'openpgp_int.h',
                                        'Line' => '54',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'db',
                                                             'offset' => '0',
                                                             'type' => '155417'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_openpgp_keyring_int',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '145078' => {
                                        'BaseType' => '145090',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1401',
                                        'Name' => 'gnutls_certificate_credentials_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '145090' => {
                                        'BaseType' => '145096',
                                        'Name' => 'struct gnutls_certificate_credentials_st*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '145096' => {
                                        'Header' => 'cert.h',
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'dh_params',
                                                             'offset' => '0',
                                                             'type' => '3185'
                                                           },
                                                    '1' => {
                                                             'name' => 'params_func',
                                                             'offset' => '8',
                                                             'type' => '155577'
                                                           },
                                                    '10' => {
                                                              'name' => 'verify_bits',
                                                              'offset' => '68',
                                                              'type' => '145'
                                                            },
                                                    '11' => {
                                                              'name' => 'get_cert_callback',
                                                              'offset' => '72',
                                                              'type' => '155589'
                                                            },
                                                    '12' => {
                                                              'name' => 'get_cert_callback2',
                                                              'offset' => '80',
                                                              'type' => '155595'
                                                            },
                                                    '13' => {
                                                              'name' => 'verify_callback',
                                                              'offset' => '88',
                                                              'type' => '12671'
                                                            },
                                                    '14' => {
                                                              'name' => 'pin',
                                                              'offset' => '96',
                                                              'type' => '150955'
                                                            },
                                                    '15' => {
                                                              'name' => 'pin_tmp',
                                                              'offset' => '112',
                                                              'type' => '140470'
                                                            },
                                                    '16' => {
                                                              'name' => 'ocsp_func',
                                                              'offset' => '144',
                                                              'type' => '145337'
                                                            },
                                                    '17' => {
                                                              'name' => 'ocsp_func_ptr',
                                                              'offset' => '152',
                                                              'type' => '211'
                                                            },
                                                    '18' => {
                                                              'name' => 'ocsp_response_file',
                                                              'offset' => '160',
                                                              'type' => '235'
                                                            },
                                                    '2' => {
                                                             'name' => 'certs',
                                                             'offset' => '16',
                                                             'type' => '155583'
                                                           },
                                                    '3' => {
                                                             'name' => 'ncerts',
                                                             'offset' => '24',
                                                             'type' => '145'
                                                           },
                                                    '4' => {
                                                             'name' => 'pkey',
                                                             'offset' => '32',
                                                             'type' => '147228'
                                                           },
                                                    '5' => {
                                                             'name' => 'keyring',
                                                             'offset' => '40',
                                                             'type' => '145036'
                                                           },
                                                    '6' => {
                                                             'name' => 'tlist',
                                                             'offset' => '48',
                                                             'type' => '147012'
                                                           },
                                                    '7' => {
                                                             'name' => 'flags',
                                                             'offset' => '56',
                                                             'type' => '145'
                                                           },
                                                    '8' => {
                                                             'name' => 'verify_flags',
                                                             'offset' => '60',
                                                             'type' => '145'
                                                           },
                                                    '9' => {
                                                             'name' => 'verify_depth',
                                                             'offset' => '64',
                                                             'type' => '145'
                                                           }
                                                  },
                                        'Name' => 'struct gnutls_certificate_credentials_st',
                                        'PrivateABI' => 1,
                                        'Size' => '168',
                                        'Type' => 'Struct'
                                      },
                          '145337' => {
                                        'BaseType' => '145349',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1579',
