<abi-corpus architecture='elf-amd-x86_64' soname='libgnutls-dane.so.0'>
  <elf-needed>
    <dependency name='libgnutls.so.30'/>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.2'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libhogweed.so.6'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libunbound.so.8'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dane_cert_type_name' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_cert_usage_name' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_match_type_name' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_data' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_deinit' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_entries' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_status' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_tlsa' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_query_to_raw_tlsa' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_raw_tlsa' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_state_deinit' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_state_init' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_state_set_dlv_file' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_strerror' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_verification_status_print' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_verify_crt' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_verify_crt_raw' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dane_verify_session_crt' version='DANE_0_0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='asnprintf.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-6'/>
    <function-decl name='vasnprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-9'/>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-7'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-8'/>
    <typedef-decl name='size_t' type-id='type-id-12' id='type-id-5'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-2'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-11'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>
    <type-decl name='void' id='type-id-13'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='cloexec.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='rpl_fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-14'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='fcntl.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hash.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='8' id='type-id-15'>
      <subrange length='1' type-id='type-id-12' id='type-id-16'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='160' id='type-id-17'>
      <subrange length='20' type-id='type-id-12' id='type-id-18'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-19'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-20'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-21'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-22'/>
    <typedef-decl name='FILE' type-id='type-id-23' id='type-id-24'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-17' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-33' id='type-id-27'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-13' id='type-id-34'/>
    <typedef-decl name='__off64_t' type-id='type-id-33' id='type-id-30'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-35' restrict='yes' id='type-id-36'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-32'/>
    <qualified-type-def type-id='type-id-8' restrict='yes' id='type-id-37'/>
    <function-decl name='malloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='abort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-37'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-33'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='read-file.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='192' id='type-id-39'>
      <subrange length='3' type-id='type-id-12' id='type-id-40'/>
    </array-type-def>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-45' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-39' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-12' id='type-id-42'/>
    <typedef-decl name='__ino_t' type-id='type-id-12' id='type-id-43'/>
    <typedef-decl name='__nlink_t' type-id='type-id-12' id='type-id-44'/>
    <typedef-decl name='__mode_t' type-id='type-id-2' id='type-id-45'/>
    <typedef-decl name='__uid_t' type-id='type-id-2' id='type-id-46'/>
    <typedef-decl name='__gid_t' type-id='type-id-2' id='type-id-47'/>
    <typedef-decl name='__blksize_t' type-id='type-id-33' id='type-id-48'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-33' id='type-id-49'/>
    <qualified-type-def type-id='type-id-9' restrict='yes' id='type-id-7'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-52'/>
    <function-decl name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fopen' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='realloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='explicit_bzero' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='ftello' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-38' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-53'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-33' id='type-id-38'/>
    <typedef-decl name='__time_t' type-id='type-id-33' id='type-id-54'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='vasnprintf.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='1792' id='type-id-56'>
      <subrange length='7' type-id='type-id-12' id='type-id-57'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='4928' id='type-id-59'>
      <subrange length='7' type-id='type-id-12' id='type-id-57'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-60'/>
    <type-decl name='float' size-in-bits='32' id='type-id-61'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-62'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-63'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-64'/>
    <typedef-decl name='arguments' type-id='type-id-65' id='type-id-66'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1920' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-66' visibility='default' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='direct_alloc_arg' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='argument' type-id='type-id-68' id='type-id-55'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-55' visibility='default' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-70' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arg_type' type-id='type-id-71' id='type-id-69'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-71'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='TYPE_NONE' value='0'/>
      <enumerator name='TYPE_SCHAR' value='1'/>
      <enumerator name='TYPE_UCHAR' value='2'/>
      <enumerator name='TYPE_SHORT' value='3'/>
      <enumerator name='TYPE_USHORT' value='4'/>
      <enumerator name='TYPE_INT' value='5'/>
      <enumerator name='TYPE_UINT' value='6'/>
      <enumerator name='TYPE_LONGINT' value='7'/>
      <enumerator name='TYPE_ULONGINT' value='8'/>
      <enumerator name='TYPE_LONGLONGINT' value='9'/>
      <enumerator name='TYPE_ULONGLONGINT' value='10'/>
      <enumerator name='TYPE_DOUBLE' value='11'/>
      <enumerator name='TYPE_LONGDOUBLE' value='12'/>
      <enumerator name='TYPE_CHAR' value='13'/>
      <enumerator name='TYPE_WIDE_CHAR' value='14'/>
      <enumerator name='TYPE_STRING' value='15'/>
      <enumerator name='TYPE_WIDE_STRING' value='16'/>
      <enumerator name='TYPE_POINTER' value='17'/>
      <enumerator name='TYPE_COUNT_SCHAR_POINTER' value='18'/>
      <enumerator name='TYPE_COUNT_SHORT_POINTER' value='19'/>
      <enumerator name='TYPE_COUNT_INT_POINTER' value='20'/>
      <enumerator name='TYPE_COUNT_LONGINT_POINTER' value='21'/>
      <enumerator name='TYPE_COUNT_LONGLONGINT_POINTER' value='22'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-70'>
      <data-member access='private'>
        <var-decl name='a_schar' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_uchar' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_short' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_ushort' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_int' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_uint' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_longint' type-id='type-id-33' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_ulongint' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_longlongint' type-id='type-id-63' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_ulonglongint' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_float' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_double' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_longdouble' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_char' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_wide_char' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_string' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_wide_string' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_pointer' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_schar_pointer' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_short_pointer' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_int_pointer' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_longint_pointer' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_longlongint_pointer' type-id='type-id-80' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='wint_t' type-id='type-id-2' id='type-id-75'/>
    <typedef-decl name='wchar_t' type-id='type-id-14' id='type-id-81'/>
    <typedef-decl name='char_directives' type-id='type-id-82' id='type-id-83'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='5184' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-83' visibility='default' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_width_length' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_precision_length' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='direct_alloc_dir' type-id='type-id-59' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='char_directive' type-id='type-id-85' id='type-id-58'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='704' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-58' visibility='default' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir_start' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir_end' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='width_start' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width_end' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='width_arg_index' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='precision_start' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='precision_end' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='precision_arg_index' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conversion' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arg_index' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-87'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-77'/>
    <function-decl name='printf_fetchargs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='printf_parse' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-74'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-73'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dane-params.c' comp-dir-path='/home/ueno/devel/gnutls/libdane' language='LANG_C11'>
    <function-decl name='dane_cert_usage_name' mangled-name='dane_cert_usage_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dane_cert_usage_name@@DANE_0_0'>
      <parameter type-id='type-id-89' name='usage'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dane_match_type_name' mangled-name='dane_match_type_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dane_match_type_name@@DANE_0_0'>
      <parameter type-id='type-id-90' name='type'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dane_cert_type_name' mangled-name='dane_cert_type_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dane_cert_type_name@@DANE_0_0'>
      <parameter type-id='type-id-91' name='type'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <typedef-decl name='dane_cert_type_t' type-id='type-id-92' id='type-id-91'/>
    <typedef-decl name='dane_cert_usage_t' type-id='type-id-93' id='type-id-89'/>
    <typedef-decl name='dane_match_type_t' type-id='type-id-94' id='type-id-90'/>
    <enum-decl name='dane_cert_type_t' id='type-id-92'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='DANE_CERT_X509' value='0'/>
      <enumerator name='DANE_CERT_PK' value='1'/>
    </enum-decl>
    <enum-decl name='dane_cert_usage_t' id='type-id-93'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='DANE_CERT_USAGE_CA' value='0'/>
      <enumerator name='DANE_CERT_USAGE_EE' value='1'/>
      <enumerator name='DANE_CERT_USAGE_LOCAL_CA' value='2'/>
      <enumerator name='DANE_CERT_USAGE_LOCAL_EE' value='3'/>
    </enum-decl>
    <enum-decl name='dane_match_type_t' id='type-id-94'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='DANE_MATCH_EXACT' value='0'/>
      <enumerator name='DANE_MATCH_SHA2_256' value='1'/>
      <enumerator name='DANE_MATCH_SHA2_512' value='2'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dane.c' comp-dir-path='/home/ueno/devel/gnutls/libdane' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-95' size-in-bits='12288' id='type-id-96'>
      <subrange length='64' type-id='type-id-12' id='type-id-97'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-98' size-in-bits='1024' id='type-id-99'>
      <subrange length='16' type-id='type-id-12' id='type-id-100'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-101' size-in-bits='512' id='type-id-102'>
      <subrange length='2' type-id='type-id-12' id='type-id-103'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='type-id-104'/>
    <type-decl name='char' size-in-bits='8' id='type-id-10'/>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='944' id='type-id-105'>
      <subrange length='118' type-id='type-id-12' id='type-id-106'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='1032' id='type-id-107'>
      <subrange length='129' type-id='type-id-12' id='type-id-108'/>
    </array-type-def>
    <class-decl name='gnutls_anti_replay_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-109'/>
    <class-decl name='gnutls_certificate_credentials_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-110'/>
    <class-decl name='gnutls_privkey_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-111'/>
    <class-decl name='gnutls_pubkey_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-112'/>
    <class-decl name='gnutls_supplemental_entry_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-113'/>
    <class-decl name='gnutls_x509_crl_int' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <class-decl name='gnutls_x509_crt_int' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-115'/>
    <class-decl name='hello_ext_entry_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <class-decl name='ub_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <array-type-def dimensions='1' type-id='type-id-118' size-in-bits='16384' id='type-id-119'>
      <subrange length='256' type-id='type-id-12' id='type-id-120'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-121' size-in-bits='4096' id='type-id-122'>
      <subrange length='64' type-id='type-id-12' id='type-id-97'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-123' size-in-bits='4096' id='type-id-124'>
      <subrange length='64' type-id='type-id-12' id='type-id-97'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-125' size-in-bits='16' id='type-id-126'>
      <subrange length='2' type-id='type-id-12' id='type-id-103'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-91' size-in-bits='3200' alignment-in-bits='32' id='type-id-127'>
      <subrange length='100' type-id='type-id-12' id='type-id-128'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-89' size-in-bits='3200' alignment-in-bits='32' id='type-id-129'>
      <subrange length='100' type-id='type-id-12' id='type-id-128'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-90' size-in-bits='3200' alignment-in-bits='32' id='type-id-130'>
      <subrange length='100' type-id='type-id-12' id='type-id-128'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-131' size-in-bits='12800' id='type-id-132'>
      <subrange length='100' type-id='type-id-12' id='type-id-128'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-133' size-in-bits='3456' id='type-id-134'>
      <subrange length='6' type-id='type-id-12' id='type-id-135'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-14'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-33'/>
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='256' id='type-id-137'>
      <subrange length='4' type-id='type-id-12' id='type-id-138'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='type-id-74'/>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='96' id='type-id-140'>
      <subrange length='12' type-id='type-id-12' id='type-id-141'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='128' id='type-id-142'>
      <subrange length='16' type-id='type-id-12' id='type-id-100'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='2040' id='type-id-143'>
      <subrange length='255' type-id='type-id-12' id='type-id-144'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='2048' id='type-id-145'>
      <subrange length='256' type-id='type-id-12' id='type-id-120'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='16' id='type-id-146'>
      <subrange length='2' type-id='type-id-12' id='type-id-103'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='256' id='type-id-147'>
      <subrange length='32' type-id='type-id-12' id='type-id-148'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='384' id='type-id-149'>
      <subrange length='48' type-id='type-id-12' id='type-id-150'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-139' size-in-bits='512' id='type-id-151'>
      <subrange length='64' type-id='type-id-12' id='type-id-97'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-72'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-73'/>
    <array-type-def dimensions='1' type-id='type-id-73' size-in-bits='256' id='type-id-152'>
      <subrange length='32' type-id='type-id-12' id='type-id-148'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-73' size-in-bits='288' id='type-id-153'>
      <subrange length='36' type-id='type-id-12' id='type-id-154'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-2'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='2048' id='type-id-155'>
      <subrange length='64' type-id='type-id-12' id='type-id-97'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-156'/>
    <type-decl name='void' id='type-id-13'/>
    <typedef-decl name='gnutls_buffer_st' type-id='type-id-157' id='type-id-158'/>
    <class-decl name='gnutls_buffer_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocd' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_length' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='type-id-160' id='type-id-139'/>
    <typedef-decl name='__uint8_t' type-id='type-id-73' id='type-id-160'/>
    <typedef-decl name='size_t' type-id='type-id-12' id='type-id-5'/>
    <typedef-decl name='gnutls_datum_t' type-id='type-id-161' id='type-id-131'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_x509_crt_t' type-id='type-id-163' id='type-id-164'/>
    <typedef-decl name='gnutls_x509_crt_fmt_t' type-id='type-id-165' id='type-id-166'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-165'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <typedef-decl name='gnutls_certificate_credentials_t' type-id='type-id-167' id='type-id-168'/>
    <class-decl name='gnutls_session_int' size-in-bits='59264' is-struct='yes' visibility='default' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security_parameters' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='record_parameters' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='internals' type-id='type-id-171' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36608'>
        <var-decl name='key' type-id='type-id-172' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='security_parameters_st' type-id='type-id-173' id='type-id-170'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='2048' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-170' visibility='default' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entity' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='epoch_read' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='epoch_write' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epoch_next' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='epoch_min' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cs' type-id='type-id-118' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prf' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='master_secret' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='client_random' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='server_random' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='session_id' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='session_id_size' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='timestamp' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='post_handshake_auth' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='max_record_send_size' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='max_record_recv_size' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1584'>
        <var-decl name='max_user_record_send_size' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='max_user_record_recv_size' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='max_early_data_size' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='client_ctype' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='server_ctype' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='grp' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='server_sign_algo' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='client_sign_algo' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ext_master_secret' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1864'>
        <var-decl name='etm' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1872'>
        <var-decl name='client_auth_type' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1880'>
        <var-decl name='server_auth_type' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='do_recv_supplemental' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='do_send_supplemental' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pversion' type-id='type-id-180' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-181' id='type-id-174'/>
    <typedef-decl name='__uint16_t' type-id='type-id-28' id='type-id-181'/>
    <class-decl name='gnutls_cipher_suite_entry_st' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='block_algorithm' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='kx_algorithm' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mac_algorithm' type-id='type-id-185' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='min_version' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='max_version' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_dtls_version' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_dtls_version' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='prf' type-id='type-id-185' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_algorithm_t' type-id='type-id-187' id='type-id-183'/>
    <enum-decl name='gnutls_cipher_algorithm' id='type-id-187'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_CIPHER_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CIPHER_NULL' value='1'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_128' value='2'/>
      <enumerator name='GNUTLS_CIPHER_3DES_CBC' value='3'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CBC' value='4'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CBC' value='5'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_40' value='6'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_CBC' value='7'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_CBC' value='8'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CBC' value='9'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_GCM' value='10'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_GCM' value='11'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_192_CBC' value='12'/>
      <enumerator name='GNUTLS_CIPHER_SALSA20_256' value='13'/>
      <enumerator name='GNUTLS_CIPHER_ESTREAM_SALSA20_256' value='14'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_GCM' value='15'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_GCM' value='16'/>
      <enumerator name='GNUTLS_CIPHER_RC2_40_CBC' value='17'/>
      <enumerator name='GNUTLS_CIPHER_DES_CBC' value='18'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM' value='19'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM' value='20'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM_8' value='21'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM_8' value='22'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_POLY1305' value='23'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CFB' value='24'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPA_CFB' value='25'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPB_CFB' value='26'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPC_CFB' value='27'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPD_CFB' value='28'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CFB8' value='29'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CFB8' value='30'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CFB8' value='31'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_XTS' value='32'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_XTS' value='33'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CNT' value='34'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_64' value='35'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_32' value='36'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_SIV' value='37'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_SIV' value='38'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_GCM' value='39'/>
      <enumerator name='GNUTLS_CIPHER_MAGMA_CTR_ACPKM' value='40'/>
      <enumerator name='GNUTLS_CIPHER_KUZNYECHIK_CTR_ACPKM' value='41'/>
      <enumerator name='GNUTLS_CIPHER_IDEA_PGP_CFB' value='200'/>
      <enumerator name='GNUTLS_CIPHER_3DES_PGP_CFB' value='201'/>
      <enumerator name='GNUTLS_CIPHER_CAST5_PGP_CFB' value='202'/>
      <enumerator name='GNUTLS_CIPHER_BLOWFISH_PGP_CFB' value='203'/>
      <enumerator name='GNUTLS_CIPHER_SAFER_SK128_PGP_CFB' value='204'/>
      <enumerator name='GNUTLS_CIPHER_AES128_PGP_CFB' value='205'/>
      <enumerator name='GNUTLS_CIPHER_AES192_PGP_CFB' value='206'/>
      <enumerator name='GNUTLS_CIPHER_AES256_PGP_CFB' value='207'/>
      <enumerator name='GNUTLS_CIPHER_TWOFISH_PGP_CFB' value='208'/>
    </enum-decl>
    <typedef-decl name='gnutls_kx_algorithm_t' type-id='type-id-188' id='type-id-184'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-188'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_KX_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_KX_RSA' value='1'/>
      <enumerator name='GNUTLS_KX_DHE_DSS' value='2'/>
      <enumerator name='GNUTLS_KX_DHE_RSA' value='3'/>
      <enumerator name='GNUTLS_KX_ANON_DH' value='4'/>
      <enumerator name='GNUTLS_KX_SRP' value='5'/>
      <enumerator name='GNUTLS_KX_RSA_EXPORT' value='6'/>
      <enumerator name='GNUTLS_KX_SRP_RSA' value='7'/>
      <enumerator name='GNUTLS_KX_SRP_DSS' value='8'/>
      <enumerator name='GNUTLS_KX_PSK' value='9'/>
      <enumerator name='GNUTLS_KX_DHE_PSK' value='10'/>
      <enumerator name='GNUTLS_KX_ANON_ECDH' value='11'/>
      <enumerator name='GNUTLS_KX_ECDHE_RSA' value='12'/>
      <enumerator name='GNUTLS_KX_ECDHE_ECDSA' value='13'/>
      <enumerator name='GNUTLS_KX_ECDHE_PSK' value='14'/>
      <enumerator name='GNUTLS_KX_RSA_PSK' value='15'/>
      <enumerator name='GNUTLS_KX_VKO_GOST_12' value='16'/>
    </enum-decl>
    <typedef-decl name='gnutls_mac_algorithm_t' type-id='type-id-189' id='type-id-185'/>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-189'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_MAC_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_MAC_NULL' value='1'/>
      <enumerator name='GNUTLS_MAC_MD5' value='2'/>
      <enumerator name='GNUTLS_MAC_SHA1' value='3'/>
      <enumerator name='GNUTLS_MAC_RMD160' value='4'/>
      <enumerator name='GNUTLS_MAC_MD2' value='5'/>
      <enumerator name='GNUTLS_MAC_SHA256' value='6'/>
      <enumerator name='GNUTLS_MAC_SHA384' value='7'/>
      <enumerator name='GNUTLS_MAC_SHA512' value='8'/>
      <enumerator name='GNUTLS_MAC_SHA224' value='9'/>
      <enumerator name='GNUTLS_MAC_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_MAC_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_MAC_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_MAC_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_MAC_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_MAC_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_512' value='17'/>
      <enumerator name='GNUTLS_MAC_AEAD' value='200'/>
      <enumerator name='GNUTLS_MAC_UMAC_96' value='201'/>
      <enumerator name='GNUTLS_MAC_UMAC_128' value='202'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_128' value='203'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_256' value='204'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_128' value='205'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_192' value='206'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_256' value='207'/>
      <enumerator name='GNUTLS_MAC_GOST28147_TC26Z_IMIT' value='208'/>
      <enumerator name='GNUTLS_MAC_SHAKE_128' value='209'/>
      <enumerator name='GNUTLS_MAC_SHAKE_256' value='210'/>
      <enumerator name='GNUTLS_MAC_MAGMA_OMAC' value='211'/>
      <enumerator name='GNUTLS_MAC_KUZNYECHIK_OMAC' value='212'/>
    </enum-decl>
    <typedef-decl name='gnutls_protocol_t' type-id='type-id-190' id='type-id-186'/>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-190'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_SSL3' value='1'/>
      <enumerator name='GNUTLS_TLS1_0' value='2'/>
      <enumerator name='GNUTLS_TLS1' value='2'/>
      <enumerator name='GNUTLS_TLS1_1' value='3'/>
      <enumerator name='GNUTLS_TLS1_2' value='4'/>
      <enumerator name='GNUTLS_TLS1_3' value='5'/>
      <enumerator name='GNUTLS_DTLS0_9' value='200'/>
      <enumerator name='GNUTLS_DTLS1_0' value='201'/>
      <enumerator name='GNUTLS_DTLS1_2' value='202'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MIN' value='200'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MAX' value='202'/>
      <enumerator name='GNUTLS_TLS_VERSION_MAX' value='5'/>
      <enumerator name='GNUTLS_VERSION_UNKNOWN' value='255'/>
    </enum-decl>
    <typedef-decl name='mac_entry_st' type-id='type-id-191' id='type-id-192'/>
    <class-decl name='mac_entry_st' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_oid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-185' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='output_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nonce_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='placeholder' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='flags' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-54' id='type-id-176'/>
    <typedef-decl name='__time_t' type-id='type-id-33' id='type-id-54'/>
    <typedef-decl name='uint32_t' type-id='type-id-193' id='type-id-177'/>
    <typedef-decl name='__uint32_t' type-id='type-id-2' id='type-id-193'/>
    <typedef-decl name='gnutls_certificate_type_t' type-id='type-id-194' id='type-id-178'/>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-194'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_CRT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CRT_X509' value='1'/>
      <enumerator name='GNUTLS_CRT_OPENPGP' value='2'/>
      <enumerator name='GNUTLS_CRT_RAWPK' value='3'/>
      <enumerator name='GNUTLS_CRT_MAX' value='3'/>
    </enum-decl>
    <typedef-decl name='gnutls_group_entry_st' type-id='type-id-195' id='type-id-196'/>
    <class-decl name='gnutls_group_entry_st' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-197' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prime' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='q' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='generator' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='q_bits' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='curve' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pk' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tls_id' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_group_t' type-id='type-id-202' id='type-id-197'/>
    <enum-decl name='__anonymous_enum__5' is-anonymous='yes' id='type-id-202'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_GROUP_INVALID' value='0'/>
      <enumerator name='GNUTLS_GROUP_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_GROUP_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_GROUP_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_GROUP_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_GROUP_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_GROUP_X25519' value='6'/>
      <enumerator name='GNUTLS_GROUP_X448' value='20'/>
      <enumerator name='GNUTLS_GROUP_GC256A' value='16'/>
      <enumerator name='GNUTLS_GROUP_GC256B' value='17'/>
      <enumerator name='GNUTLS_GROUP_GC256C' value='18'/>
      <enumerator name='GNUTLS_GROUP_GC256D' value='19'/>
      <enumerator name='GNUTLS_GROUP_GC512A' value='13'/>
      <enumerator name='GNUTLS_GROUP_GC512B' value='14'/>
      <enumerator name='GNUTLS_GROUP_GC512C' value='15'/>
      <enumerator name='GNUTLS_GROUP_FFDHE2048' value='256'/>
      <enumerator name='GNUTLS_GROUP_FFDHE3072' value='257'/>
      <enumerator name='GNUTLS_GROUP_FFDHE4096' value='258'/>
      <enumerator name='GNUTLS_GROUP_FFDHE8192' value='259'/>
      <enumerator name='GNUTLS_GROUP_FFDHE6144' value='260'/>
      <enumerator name='GNUTLS_GROUP_MAX' value='260'/>
    </enum-decl>
    <typedef-decl name='gnutls_ecc_curve_t' type-id='type-id-203' id='type-id-200'/>
    <enum-decl name='__anonymous_enum__6' is-anonymous='yes' id='type-id-203'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_ECC_CURVE_INVALID' value='0'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_ECC_CURVE_X25519' value='6'/>
      <enumerator name='GNUTLS_ECC_CURVE_ED25519' value='7'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPA' value='8'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPB' value='9'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPC' value='10'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXA' value='11'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXB' value='12'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512A' value='13'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512B' value='14'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512C' value='15'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256A' value='16'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256B' value='17'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256C' value='18'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256D' value='19'/>
      <enumerator name='GNUTLS_ECC_CURVE_X448' value='20'/>
      <enumerator name='GNUTLS_ECC_CURVE_ED448' value='21'/>
      <enumerator name='GNUTLS_ECC_CURVE_MAX' value='21'/>
    </enum-decl>
    <typedef-decl name='gnutls_pk_algorithm_t' type-id='type-id-204' id='type-id-201'/>
    <enum-decl name='__anonymous_enum__7' is-anonymous='yes' id='type-id-204'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_PK_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_PK_RSA' value='1'/>
      <enumerator name='GNUTLS_PK_DSA' value='2'/>
      <enumerator name='GNUTLS_PK_DH' value='3'/>
      <enumerator name='GNUTLS_PK_ECDSA' value='4'/>
      <enumerator name='GNUTLS_PK_ECDH_X25519' value='5'/>
      <enumerator name='GNUTLS_PK_RSA_PSS' value='6'/>
      <enumerator name='GNUTLS_PK_EDDSA_ED25519' value='7'/>
      <enumerator name='GNUTLS_PK_GOST_01' value='8'/>
      <enumerator name='GNUTLS_PK_GOST_12_256' value='9'/>
      <enumerator name='GNUTLS_PK_GOST_12_512' value='10'/>
      <enumerator name='GNUTLS_PK_ECDH_X448' value='11'/>
      <enumerator name='GNUTLS_PK_EDDSA_ED448' value='12'/>
      <enumerator name='GNUTLS_PK_MAX' value='12'/>
    </enum-decl>
    <typedef-decl name='gnutls_sign_algorithm_t' type-id='type-id-205' id='type-id-179'/>
    <enum-decl name='__anonymous_enum__8' is-anonymous='yes' id='type-id-205'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_SIGN_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA1' value='1'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA' value='1'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA1' value='2'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA' value='2'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD5' value='3'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD2' value='4'/>
      <enumerator name='GNUTLS_SIGN_RSA_RMD160' value='5'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA256' value='6'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA384' value='7'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA512' value='8'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA224' value='9'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA224' value='10'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA256' value='11'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA1' value='12'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA224' value='13'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA256' value='14'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA384' value='15'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA512' value='16'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA384' value='17'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA512' value='18'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_224' value='20'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_256' value='21'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_384' value='22'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_512' value='23'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_224' value='24'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_256' value='25'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_384' value='26'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_512' value='27'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_224' value='28'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_256' value='29'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_384' value='30'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_512' value='31'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA256' value='32'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA384' value='33'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA512' value='34'/>
      <enumerator name='GNUTLS_SIGN_EDDSA_ED25519' value='35'/>
      <enumerator name='GNUTLS_SIGN_RSA_RAW' value='36'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP256R1_SHA256' value='37'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP384R1_SHA384' value='38'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP521R1_SHA512' value='39'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA256' value='40'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA384' value='41'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA512' value='42'/>
      <enumerator name='GNUTLS_SIGN_GOST_94' value='43'/>
      <enumerator name='GNUTLS_SIGN_GOST_256' value='44'/>
      <enumerator name='GNUTLS_SIGN_GOST_512' value='45'/>
      <enumerator name='GNUTLS_SIGN_EDDSA_ED448' value='46'/>
      <enumerator name='GNUTLS_SIGN_MAX' value='46'/>
    </enum-decl>
    <typedef-decl name='version_entry_st' type-id='type-id-206' id='type-id-207'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-207' visibility='default' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='age' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='major' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='minor' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supported' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='explicit_iv' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='extensions' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='selectable_sighash' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='selectable_prf' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='obsolete' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='tls13_sem' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='false_start' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='only_extension' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='post_handshake_auth' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='key_shares' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='multi_ocsp' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tls_sig_sem' type-id='type-id-139' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='transport_t' type-id='type-id-209' id='type-id-208'/>
    <enum-decl name='transport_t' id='type-id-209'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_STREAM' value='0'/>
      <enumerator name='GNUTLS_DGRAM' value='1'/>
    </enum-decl>
    <typedef-decl name='record_parameters_st' type-id='type-id-210' id='type-id-211'/>
    <class-decl name='record_parameters_st' size-in-bits='5888' is-struct='yes' visibility='default' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='epoch' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='initialized' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cipher' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='etm' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mac' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dtls_sw_next' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dtls_sw_bits' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dtls_sw_have_recv' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='read' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='write' type-id='type-id-214' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='usage_cnt' type-id='type-id-14' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cipher_entry_st' type-id='type-id-215' id='type-id-216'/>
    <class-decl name='cipher_entry_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-183' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blocksize' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='keysize' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-217' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='implicit_iv' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='explicit_iv' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cipher_iv' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='tagsize' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='flags' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cipher_type_t' type-id='type-id-218' id='type-id-217'/>
    <enum-decl name='__anonymous_enum__9' is-anonymous='yes' id='type-id-218'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='CIPHER_STREAM' value='0'/>
      <enumerator name='CIPHER_BLOCK' value='1'/>
      <enumerator name='CIPHER_AEAD' value='2'/>
    </enum-decl>
    <typedef-decl name='uint64_t' type-id='type-id-219' id='type-id-213'/>
    <typedef-decl name='__uint64_t' type-id='type-id-12' id='type-id-219'/>
    <typedef-decl name='record_state_st' type-id='type-id-220' id='type-id-214'/>
    <class-decl name='record_state_st' size-in-bits='2688' is-struct='yes' visibility='default' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mac_key' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mac_key_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='iv' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='iv_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='key' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='key_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ctx' type-id='type-id-221' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='aead_tag_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='is_aead' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='sequence_number' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='level' type-id='type-id-222' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='1472' is-anonymous='yes' visibility='default' id='type-id-221'>
      <data-member access='private'>
        <var-decl name='tls12' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='aead' type-id='type-id-224' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='auth_cipher_hd_st' type-id='type-id-225' id='type-id-223'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='1472' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-223' visibility='default' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cipher' type-id='type-id-226' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mac' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='is_mac' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='continuous_mac' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='non_null' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='etm' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tag_size' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cipher_hd_st' type-id='type-id-228' id='type-id-226'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='768' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-226' visibility='default' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='e' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='encrypt' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt' type-id='type-id-230' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aead_encrypt' type-id='type-id-231' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='aead_decrypt' type-id='type-id-232' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth' type-id='type-id-233' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tag' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='setiv' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='getiv' type-id='type-id-236' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='setkey' type-id='type-id-237' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='deinit' type-id='type-id-238' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cipher_encrypt_func' type-id='type-id-239' id='type-id-229'/>
    <typedef-decl name='cipher_decrypt_func' type-id='type-id-239' id='type-id-230'/>
    <typedef-decl name='aead_cipher_encrypt_func' type-id='type-id-240' id='type-id-231'/>
    <typedef-decl name='aead_cipher_decrypt_func' type-id='type-id-240' id='type-id-232'/>
    <typedef-decl name='cipher_auth_func' type-id='type-id-241' id='type-id-233'/>
    <typedef-decl name='cipher_tag_func' type-id='type-id-242' id='type-id-234'/>
    <typedef-decl name='cipher_setiv_func' type-id='type-id-241' id='type-id-235'/>
    <typedef-decl name='cipher_getiv_func' type-id='type-id-241' id='type-id-236'/>
    <typedef-decl name='cipher_setkey_func' type-id='type-id-241' id='type-id-237'/>
    <typedef-decl name='cipher_deinit_func' type-id='type-id-243' id='type-id-238'/>
    <union-decl name='__anonymous_union__1' size-in-bits='576' is-anonymous='yes' visibility='default' id='type-id-227'>
      <data-member access='private'>
        <var-decl name='dig' type-id='type-id-244' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac' type-id='type-id-245' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='digest_hd_st' type-id='type-id-246' id='type-id-244'/>
    <class-decl name='__anonymous_struct__5' size-in-bits='512' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-244' visibility='default' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='output' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='deinit' type-id='type-id-249' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='copy' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='key' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='keysize' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handle' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hash_func' type-id='type-id-241' id='type-id-247'/>
    <typedef-decl name='output_func' type-id='type-id-241' id='type-id-248'/>
    <typedef-decl name='hash_deinit_func' type-id='type-id-243' id='type-id-249'/>
    <typedef-decl name='copy_func' type-id='type-id-251' id='type-id-250'/>
    <typedef-decl name='mac_hd_st' type-id='type-id-252' id='type-id-245'/>
    <class-decl name='__anonymous_struct__6' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-245' visibility='default' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mac_len' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='setnonce' type-id='type-id-253' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit' type-id='type-id-249' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='copy' type-id='type-id-250' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='setkey' type-id='type-id-254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='handle' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nonce_func' type-id='type-id-241' id='type-id-253'/>
    <typedef-decl name='setkey_func' type-id='type-id-241' id='type-id-254'/>
    <typedef-decl name='api_aead_cipher_hd_st' type-id='type-id-255' id='type-id-224'/>
    <class-decl name='api_aead_cipher_hd_st' size-in-bits='768' is-struct='yes' visibility='default' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-226' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_record_encryption_level_t' type-id='type-id-256' id='type-id-222'/>
    <enum-decl name='__anonymous_enum__10' is-anonymous='yes' id='type-id-256'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_INITIAL' value='0'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_EARLY' value='1'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_HANDSHAKE' value='2'/>
      <enumerator name='GNUTLS_ENCRYPTION_LEVEL_APPLICATION' value='3'/>
    </enum-decl>
    <typedef-decl name='internals_st' type-id='type-id-257' id='type-id-171'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='34304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-171' visibility='default' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_buffer' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handshake_hash_buffer_prev_len' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='handshake_hash_buffer_client_hello_len' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='handshake_hash_buffer_client_kx_len' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='handshake_hash_buffer_server_finished_len' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handshake_hash_buffer_client_finished_len' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handshake_hash_buffer' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resumable' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='ticket_state' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bye_state' type-id='type-id-260' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reauth_state' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='handshake_final_state' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='handshake_state' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='invalid_connection' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='904'>
        <var-decl name='may_not_read' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='may_not_write' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='920'>
        <var-decl name='read_eof' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='last_alert' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='last_handshake_in' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='last_handshake_out' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='priorities' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='allow_large_records' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1096'>
        <var-decl name='allow_small_records' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='no_etm' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1112'>
        <var-decl name='no_ext_master_secret' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='allow_key_usage_violation' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1128'>
        <var-decl name='allow_wrong_pms' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='dumbfw' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_prime_bits' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='resumed' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1176'>
        <var-decl name='resumption_requested' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='resumed_security_parameters' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='resumption_data' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='handshake_send_buffer' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='handshake_header_recv_buffer' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='handshake_recv_buffer' type-id='type-id-134' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='handshake_recv_buffer_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='record_recv_buffer' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='record_send_buffer' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='record_send_buffer_user_size' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='early_data_recv_buffer' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='early_data_presend_buffer' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='rsend_state' type-id='type-id-264' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='record_key_update_buffer' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='record_presend_buffer' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='reauth_buffer' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='expire_time' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='auth_struct' type-id='type-id-265' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='adv_version_major' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9480'>
        <var-decl name='adv_version_minor' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9504'>
        <var-decl name='send_cert_req' type-id='type-id-266' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='cert_output_callback' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='max_handshake_data_buffer_size' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='pull_timeout_func' type-id='type-id-268' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='pull_func' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='push_func' type-id='type-id-270' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9856'>
        <var-decl name='vec_push_func' type-id='type-id-271' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='errno_func' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='transport_recv_ptr' type-id='type-id-273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='transport_send_ptr' type-id='type-id-273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='db_store_func' type-id='type-id-274' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='db_retrieve_func' type-id='type-id-275' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='db_remove_func' type-id='type-id-276' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='db_ptr' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='user_hello_func' type-id='type-id-277' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10432'>
        <var-decl name='h_hook' type-id='type-id-278' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10496'>
        <var-decl name='h_type' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10528'>
        <var-decl name='h_post' type-id='type-id-279' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='h_read_func' type-id='type-id-280' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='h_secret_func' type-id='type-id-281' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='alert_read_func' type-id='type-id-282' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='keylog_func' type-id='type-id-283' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='selected_cert_list' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='selected_cert_list_length' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='selected_key' type-id='type-id-285' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='selected_ocsp' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='selected_ocsp_length' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='selected_ocsp_func' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='selected_ocsp_func_ptr' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='selected_need_free' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11272'>
        <var-decl name='default_record_version' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11288'>
        <var-decl name='default_hello_version' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='user_ptr' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11392'>
        <var-decl name='direction' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11400'>
        <var-decl name='ignore_rdn_sequence' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11408'>
        <var-decl name='rsa_pms_version' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11424'>
        <var-decl name='errnum' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11456'>
        <var-decl name='initial_negotiation_completed' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='post_negotiation_lock' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11584'>
        <var-decl name='transport' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11648'>
        <var-decl name='dtls' type-id='type-id-288' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12224'>
        <var-decl name='handshake_suspicious_loops' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12256'>
        <var-decl name='handshake_in_progress' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12264'>
        <var-decl name='premaster_set' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12288'>
        <var-decl name='cb_tls_unique_len' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12320'>
        <var-decl name='cb_tls_unique' type-id='type-id-153' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='handshake_start_time' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12736'>
        <var-decl name='handshake_abs_timeout' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12864'>
        <var-decl name='ertt' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12896'>
        <var-decl name='handshake_timeout_ms' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12928'>
        <var-decl name='record_timeout_ms' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12992'>
        <var-decl name='post_handshake_cr_context' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13120'>
        <var-decl name='post_handshake_hash_buffer' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13376'>
        <var-decl name='hsk_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13440'>
        <var-decl name='last_key_update' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13568'>
        <var-decl name='key_update_count' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13632'>
        <var-decl name='full_client_hello' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13888'>
        <var-decl name='extensions_offset' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13952'>
        <var-decl name='hb_local_data' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14208'>
        <var-decl name='hb_remote_data' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14464'>
        <var-decl name='hb_ping_start' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14592'>
        <var-decl name='hb_ping_sent' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14720'>
        <var-decl name='hb_actual_retrans_timeout_ms' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14752'>
        <var-decl name='hb_retrans_timeout_ms' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14784'>
        <var-decl name='hb_total_timeout_ms' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14816'>
        <var-decl name='ocsp_check_ok' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14848'>
        <var-decl name='hb_state' type-id='type-id-289' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14880'>
        <var-decl name='recv_state' type-id='type-id-290' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14912'>
        <var-decl name='sc_random_set' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14976'>
        <var-decl name='flags' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15040'>
        <var-decl name='verify_callback' type-id='type-id-291' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15104'>
        <var-decl name='vc_data' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15168'>
        <var-decl name='vc_sdata' type-id='type-id-293' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15360'>
        <var-decl name='vc_elements' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15392'>
        <var-decl name='vc_status' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15424'>
        <var-decl name='additional_verify_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15456'>
        <var-decl name='cert_hash' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15712'>
        <var-decl name='cert_hash_set' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15720'>
        <var-decl name='saved_username' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='saved_username_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='tfo' type-id='type-id-294' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='rsup' type-id='type-id-295' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='rsup_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18176'>
        <var-decl name='rexts' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18240'>
        <var-decl name='rexts_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18304'>
        <var-decl name='ext_data' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30592'>
        <var-decl name='used_exts' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30656'>
        <var-decl name='ext_msg' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30688'>
        <var-decl name='max_recv_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30720'>
        <var-decl name='cand_ec_group' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30784'>
        <var-decl name='cand_dh_group' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30848'>
        <var-decl name='cand_group' type-id='type-id-121' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30912'>
        <var-decl name='hrr_cs' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30944'>
        <var-decl name='session_ticket_renew' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30976'>
        <var-decl name='tls13_ticket' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34112'>
        <var-decl name='early_data_received' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34176'>
        <var-decl name='anti_replay' type-id='type-id-299' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34240'>
        <var-decl name='epoch_lock' type-id='type-id-3' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mbuffer_head_st' type-id='type-id-300' id='type-id-258'/>
    <class-decl name='mbuffer_head_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tail' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='byte_length' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mbuffer_st' type-id='type-id-302' id='type-id-303'/>
    <class-decl name='mbuffer_st' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='maximum_size' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='uhead_mark' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='type' type-id='type-id-304' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='record_sequence' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='epoch' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='htype' type-id='type-id-305' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='handshake_sequence' type-id='type-id-174' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='content_type_t' type-id='type-id-306' id='type-id-304'/>
    <enum-decl name='content_type_t' id='type-id-306'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_CHANGE_CIPHER_SPEC' value='20'/>
      <enumerator name='GNUTLS_ALERT' value='21'/>
      <enumerator name='GNUTLS_HANDSHAKE' value='22'/>
      <enumerator name='GNUTLS_APPLICATION_DATA' value='23'/>
      <enumerator name='GNUTLS_HEARTBEAT' value='24'/>
    </enum-decl>
    <typedef-decl name='gnutls_handshake_description_t' type-id='type-id-307' id='type-id-305'/>
    <enum-decl name='__anonymous_enum__11' is-anonymous='yes' id='type-id-307'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_REQUEST' value='0'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO' value='1'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO' value='2'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_VERIFY_REQUEST' value='3'/>
      <enumerator name='GNUTLS_HANDSHAKE_NEW_SESSION_TICKET' value='4'/>
      <enumerator name='GNUTLS_HANDSHAKE_END_OF_EARLY_DATA' value='5'/>
      <enumerator name='GNUTLS_HANDSHAKE_ENCRYPTED_EXTENSIONS' value='8'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_PKT' value='11'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_KEY_EXCHANGE' value='12'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_REQUEST' value='13'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO_DONE' value='14'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_VERIFY' value='15'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_KEY_EXCHANGE' value='16'/>
      <enumerator name='GNUTLS_HANDSHAKE_FINISHED' value='20'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_STATUS' value='22'/>
      <enumerator name='GNUTLS_HANDSHAKE_SUPPLEMENTAL' value='23'/>
      <enumerator name='GNUTLS_HANDSHAKE_KEY_UPDATE' value='24'/>
      <enumerator name='GNUTLS_HANDSHAKE_CHANGE_CIPHER_SPEC' value='254'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO_V2' value='1024'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_RETRY_REQUEST' value='1025'/>
    </enum-decl>
    <typedef-decl name='send_ticket_state_t' type-id='type-id-308' id='type-id-259'/>
    <enum-decl name='send_ticket_state_t' id='type-id-308'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='TICKET_STATE0' value='0'/>
      <enumerator name='TICKET_STATE1' value='1'/>
    </enum-decl>
    <typedef-decl name='bye_state_t' type-id='type-id-309' id='type-id-260'/>
    <enum-decl name='bye_state_t' id='type-id-309'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='BYE_STATE0' value='0'/>
      <enumerator name='BYE_STATE1' value='1'/>
      <enumerator name='BYE_STATE2' value='2'/>
    </enum-decl>
    <typedef-decl name='reauth_state_t' type-id='type-id-310' id='type-id-261'/>
    <enum-decl name='reauth_state_t' id='type-id-310'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='REAUTH_STATE0' value='0'/>
      <enumerator name='REAUTH_STATE1' value='1'/>
      <enumerator name='REAUTH_STATE2' value='2'/>
      <enumerator name='REAUTH_STATE3' value='3'/>
      <enumerator name='REAUTH_STATE4' value='4'/>
      <enumerator name='REAUTH_STATE5' value='5'/>
    </enum-decl>
    <typedef-decl name='handshake_state_t' type-id='type-id-311' id='type-id-262'/>
    <enum-decl name='handshake_state_t' id='type-id-311'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='STATE0' value='0'/>
      <enumerator name='STATE1' value='1'/>
      <enumerator name='STATE2' value='2'/>
      <enumerator name='STATE3' value='3'/>
      <enumerator name='STATE4' value='4'/>
      <enumerator name='STATE5' value='5'/>
      <enumerator name='STATE6' value='6'/>
      <enumerator name='STATE7' value='7'/>
      <enumerator name='STATE8' value='8'/>
      <enumerator name='STATE9' value='9'/>
      <enumerator name='STATE10' value='10'/>
      <enumerator name='STATE11' value='11'/>
      <enumerator name='STATE12' value='12'/>
      <enumerator name='STATE13' value='13'/>
      <enumerator name='STATE14' value='14'/>
      <enumerator name='STATE15' value='15'/>
      <enumerator name='STATE16' value='16'/>
      <enumerator name='STATE17' value='17'/>
      <enumerator name='STATE18' value='18'/>
      <enumerator name='STATE19' value='19'/>
      <enumerator name='STATE20' value='20'/>
      <enumerator name='STATE21' value='21'/>
      <enumerator name='STATE22' value='22'/>
      <enumerator name='STATE30' value='30'/>
      <enumerator name='STATE31' value='31'/>
      <enumerator name='STATE40' value='40'/>
      <enumerator name='STATE41' value='41'/>
      <enumerator name='STATE50' value='50'/>
      <enumerator name='STATE90' value='90'/>
      <enumerator name='STATE91' value='91'/>
      <enumerator name='STATE92' value='92'/>
      <enumerator name='STATE93' value='93'/>
      <enumerator name='STATE94' value='94'/>
      <enumerator name='STATE99' value='99'/>
      <enumerator name='STATE100' value='100'/>
      <enumerator name='STATE101' value='101'/>
      <enumerator name='STATE102' value='102'/>
      <enumerator name='STATE103' value='103'/>
      <enumerator name='STATE104' value='104'/>
      <enumerator name='STATE105' value='105'/>
      <enumerator name='STATE106' value='106'/>
      <enumerator name='STATE107' value='107'/>
      <enumerator name='STATE108' value='108'/>
      <enumerator name='STATE109' value='109'/>
      <enumerator name='STATE110' value='110'/>
      <enumerator name='STATE111' value='111'/>
      <enumerator name='STATE112' value='112'/>
      <enumerator name='STATE113' value='113'/>
      <enumerator name='STATE114' value='114'/>
      <enumerator name='STATE115' value='115'/>
      <enumerator name='STATE150' value='116'/>
    </enum-decl>
    <class-decl name='gnutls_priority_st' size-in-bits='41792' is-struct='yes' visibility='default' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='client_ctype' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='server_ctype' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='_cipher' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='_mac' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10400'>
        <var-decl name='_kx' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='_sign_algo' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14560'>
        <var-decl name='_supported_ecc' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16640'>
        <var-decl name='groups' type-id='type-id-314' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20800'>
        <var-decl name='sigalg' type-id='type-id-315' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24960'>
        <var-decl name='cs' type-id='type-id-316' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='no_extensions' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41440'>
        <var-decl name='sr' type-id='type-id-317' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41472'>
        <var-decl name='min_record_version' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41480'>
        <var-decl name='server_precedence' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41488'>
        <var-decl name='allow_server_key_usage_violation' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41496'>
        <var-decl name='no_tickets' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41504'>
        <var-decl name='have_cbc' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41512'>
        <var-decl name='have_psk' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41520'>
        <var-decl name='force_etm' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41536'>
        <var-decl name='additional_verify_flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41568'>
        <var-decl name='tls13_compat_mode' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41576'>
        <var-decl name='fallback' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41600'>
        <var-decl name='level' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41632'>
        <var-decl name='_allow_large_records' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41640'>
        <var-decl name='_allow_small_records' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41648'>
        <var-decl name='_no_etm' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41656'>
        <var-decl name='_no_ext_master_secret' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41664'>
        <var-decl name='_allow_key_usage_violation' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41672'>
        <var-decl name='_allow_wrong_pms' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41680'>
        <var-decl name='_dumbfw' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41696'>
        <var-decl name='_dh_prime_bits' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='priority_st' type-id='type-id-319' id='type-id-313'/>
    <class-decl name='__anonymous_struct__8' size-in-bits='2080' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-313' visibility='default' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priorities' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='num_priorities' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='group_list_st' type-id='type-id-320' id='type-id-314'/>
    <class-decl name='group_list_st' size-in-bits='4160' is-struct='yes' visibility='default' id='type-id-320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-122' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='have_ffdhe' type-id='type-id-104' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sign_algo_list_st' type-id='type-id-321' id='type-id-315'/>
    <class-decl name='sign_algo_list_st' size-in-bits='4160' is-struct='yes' visibility='default' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-124' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='size' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_sign_entry_st' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-322'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pk' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-323' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='priv_pk' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cert_pk' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='curve' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='aid' type-id='type-id-324' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='slevel' type-id='type-id-325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='hash_output_size' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_digest_algorithm_t' type-id='type-id-326' id='type-id-323'/>
    <enum-decl name='__anonymous_enum__12' is-anonymous='yes' id='type-id-326'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_DIG_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DIG_NULL' value='1'/>
      <enumerator name='GNUTLS_DIG_MD5' value='2'/>
      <enumerator name='GNUTLS_DIG_SHA1' value='3'/>
      <enumerator name='GNUTLS_DIG_RMD160' value='4'/>
      <enumerator name='GNUTLS_DIG_MD2' value='5'/>
      <enumerator name='GNUTLS_DIG_SHA256' value='6'/>
      <enumerator name='GNUTLS_DIG_SHA384' value='7'/>
      <enumerator name='GNUTLS_DIG_SHA512' value='8'/>
      <enumerator name='GNUTLS_DIG_SHA224' value='9'/>
      <enumerator name='GNUTLS_DIG_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_DIG_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_DIG_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_DIG_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_DIG_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_DIG_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_512' value='17'/>
      <enumerator name='GNUTLS_DIG_SHAKE_128' value='209'/>
      <enumerator name='GNUTLS_DIG_SHAKE_256' value='210'/>
    </enum-decl>
    <typedef-decl name='sign_algorithm_st' type-id='type-id-327' id='type-id-328'/>
    <class-decl name='__anonymous_struct__9' size-in-bits='24' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-328' visibility='default' id='type-id-327'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tls_sem' type-id='type-id-139' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hash_security_level_t' type-id='type-id-329' id='type-id-325'/>
    <enum-decl name='hash_security_level_t' id='type-id-329'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='_SECURE' value='0'/>
      <enumerator name='_INSECURE_FOR_CERTS' value='1'/>
      <enumerator name='_INSECURE' value='2'/>
    </enum-decl>
    <typedef-decl name='ciphersuite_list_st' type-id='type-id-330' id='type-id-316'/>
    <class-decl name='ciphersuite_list_st' size-in-bits='16448' is-struct='yes' visibility='default' id='type-id-330'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-119' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='size' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_suite_entry_st' type-id='type-id-182' id='type-id-331'/>
    <typedef-decl name='safe_renegotiation_t' type-id='type-id-332' id='type-id-317'/>
    <enum-decl name='__anonymous_enum__13' is-anonymous='yes' id='type-id-332'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='SR_DISABLED' value='0'/>
      <enumerator name='SR_UNSAFE' value='1'/>
      <enumerator name='SR_PARTIAL' value='2'/>
      <enumerator name='SR_SAFE' value='3'/>
    </enum-decl>
    <typedef-decl name='gnutls_sec_param_t' type-id='type-id-333' id='type-id-318'/>
    <enum-decl name='__anonymous_enum__14' is-anonymous='yes' id='type-id-333'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_SEC_PARAM_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SEC_PARAM_INSECURE' value='5'/>
      <enumerator name='GNUTLS_SEC_PARAM_EXPORT' value='10'/>
      <enumerator name='GNUTLS_SEC_PARAM_VERY_WEAK' value='15'/>
      <enumerator name='GNUTLS_SEC_PARAM_WEAK' value='20'/>
      <enumerator name='GNUTLS_SEC_PARAM_LOW' value='25'/>
      <enumerator name='GNUTLS_SEC_PARAM_LEGACY' value='30'/>
      <enumerator name='GNUTLS_SEC_PARAM_MEDIUM' value='35'/>
      <enumerator name='GNUTLS_SEC_PARAM_HIGH' value='40'/>
      <enumerator name='GNUTLS_SEC_PARAM_ULTRA' value='45'/>
      <enumerator name='GNUTLS_SEC_PARAM_FUTURE' value='50'/>
      <enumerator name='GNUTLS_SEC_PARAM_MAX' value='50'/>
    </enum-decl>
    <typedef-decl name='handshake_buffer_st' type-id='type-id-334' id='type-id-133'/>
    <class-decl name='__anonymous_struct__10' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-133' visibility='default' id='type-id-334'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='htype' type-id='type-id-305' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rtype' type-id='type-id-305' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sequence' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_offset' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='end_offset' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='header' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='header_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data' type-id='type-id-158' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='record_send_state_t' type-id='type-id-335' id='type-id-264'/>
    <enum-decl name='record_send_state_t' id='type-id-335'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='RECORD_SEND_NORMAL' value='0'/>
      <enumerator name='RECORD_SEND_CORKED' value='1'/>
      <enumerator name='RECORD_SEND_CORKED_TO_KU' value='2'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_1' value='3'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_2' value='4'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_3' value='5'/>
    </enum-decl>
    <class-decl name='mod_auth_st_int' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-336'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gnutls_generate_server_certificate' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gnutls_generate_client_certificate' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gnutls_generate_server_kx' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='gnutls_generate_client_kx' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gnutls_generate_client_crt_vrfy' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='gnutls_generate_server_crt_request' type-id='type-id-337' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='gnutls_process_server_certificate' type-id='type-id-338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='gnutls_process_client_certificate' type-id='type-id-338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='gnutls_process_server_kx' type-id='type-id-338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='gnutls_process_client_kx' type-id='type-id-338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='gnutls_process_client_crt_vrfy' type-id='type-id-338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='gnutls_process_server_crt_request' type-id='type-id-338' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_session_t' type-id='type-id-339' id='type-id-340'/>
    <typedef-decl name='gnutls_certificate_request_t' type-id='type-id-341' id='type-id-266'/>
    <enum-decl name='__anonymous_enum__15' is-anonymous='yes' id='type-id-341'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_CERT_IGNORE' value='0'/>
      <enumerator name='GNUTLS_CERT_REQUEST' value='1'/>
      <enumerator name='GNUTLS_CERT_REQUIRE' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_verify_output_function' type-id='type-id-342' id='type-id-343'/>
    <typedef-decl name='gnutls_x509_crl_t' type-id='type-id-344' id='type-id-345'/>
    <typedef-decl name='gnutls_pull_timeout_func' type-id='type-id-346' id='type-id-268'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-3' id='type-id-273'/>
    <typedef-decl name='gnutls_pull_func' type-id='type-id-347' id='type-id-269'/>
    <typedef-decl name='ssize_t' type-id='type-id-348' id='type-id-349'/>
    <typedef-decl name='__ssize_t' type-id='type-id-33' id='type-id-348'/>
    <typedef-decl name='gnutls_push_func' type-id='type-id-347' id='type-id-270'/>
    <typedef-decl name='gnutls_vec_push_func' type-id='type-id-350' id='type-id-271'/>
    <typedef-decl name='giovec_t' type-id='type-id-351' id='type-id-352'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-351'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-5' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_errno_func' type-id='type-id-353' id='type-id-272'/>
    <typedef-decl name='gnutls_db_store_func' type-id='type-id-354' id='type-id-274'/>
    <typedef-decl name='gnutls_db_retr_func' type-id='type-id-355' id='type-id-275'/>
    <typedef-decl name='gnutls_db_remove_func' type-id='type-id-356' id='type-id-276'/>
    <typedef-decl name='gnutls_handshake_simple_hook_func' type-id='type-id-357' id='type-id-277'/>
    <typedef-decl name='gnutls_handshake_hook_func' type-id='type-id-358' id='type-id-278'/>
    <typedef-decl name='int16_t' type-id='type-id-359' id='type-id-279'/>
    <typedef-decl name='__int16_t' type-id='type-id-74' id='type-id-359'/>
    <typedef-decl name='gnutls_handshake_read_func' type-id='type-id-360' id='type-id-280'/>
    <typedef-decl name='gnutls_handshake_secret_func' type-id='type-id-361' id='type-id-281'/>
    <typedef-decl name='gnutls_alert_read_func' type-id='type-id-362' id='type-id-282'/>
    <typedef-decl name='gnutls_alert_level_t' type-id='type-id-363' id='type-id-364'/>
    <enum-decl name='__anonymous_enum__16' is-anonymous='yes' id='type-id-363'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_AL_WARNING' value='1'/>
      <enumerator name='GNUTLS_AL_FATAL' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_alert_description_t' type-id='type-id-365' id='type-id-366'/>
    <enum-decl name='__anonymous_enum__17' is-anonymous='yes' id='type-id-365'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_A_CLOSE_NOTIFY' value='0'/>
      <enumerator name='GNUTLS_A_UNEXPECTED_MESSAGE' value='10'/>
      <enumerator name='GNUTLS_A_BAD_RECORD_MAC' value='20'/>
      <enumerator name='GNUTLS_A_DECRYPTION_FAILED' value='21'/>
      <enumerator name='GNUTLS_A_RECORD_OVERFLOW' value='22'/>
      <enumerator name='GNUTLS_A_DECOMPRESSION_FAILURE' value='30'/>
      <enumerator name='GNUTLS_A_HANDSHAKE_FAILURE' value='40'/>
      <enumerator name='GNUTLS_A_SSL3_NO_CERTIFICATE' value='41'/>
      <enumerator name='GNUTLS_A_BAD_CERTIFICATE' value='42'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_CERTIFICATE' value='43'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REVOKED' value='44'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_EXPIRED' value='45'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNKNOWN' value='46'/>
      <enumerator name='GNUTLS_A_ILLEGAL_PARAMETER' value='47'/>
      <enumerator name='GNUTLS_A_UNKNOWN_CA' value='48'/>
      <enumerator name='GNUTLS_A_ACCESS_DENIED' value='49'/>
      <enumerator name='GNUTLS_A_DECODE_ERROR' value='50'/>
      <enumerator name='GNUTLS_A_DECRYPT_ERROR' value='51'/>
      <enumerator name='GNUTLS_A_EXPORT_RESTRICTION' value='60'/>
      <enumerator name='GNUTLS_A_PROTOCOL_VERSION' value='70'/>
      <enumerator name='GNUTLS_A_INSUFFICIENT_SECURITY' value='71'/>
      <enumerator name='GNUTLS_A_INTERNAL_ERROR' value='80'/>
      <enumerator name='GNUTLS_A_INAPPROPRIATE_FALLBACK' value='86'/>
      <enumerator name='GNUTLS_A_USER_CANCELED' value='90'/>
      <enumerator name='GNUTLS_A_NO_RENEGOTIATION' value='100'/>
      <enumerator name='GNUTLS_A_MISSING_EXTENSION' value='109'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_EXTENSION' value='110'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNOBTAINABLE' value='111'/>
      <enumerator name='GNUTLS_A_UNRECOGNIZED_NAME' value='112'/>
      <enumerator name='GNUTLS_A_UNKNOWN_PSK_IDENTITY' value='115'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REQUIRED' value='116'/>
      <enumerator name='GNUTLS_A_NO_APPLICATION_PROTOCOL' value='120'/>
      <enumerator name='GNUTLS_A_MAX' value='120'/>
    </enum-decl>
    <typedef-decl name='gnutls_keylog_func' type-id='type-id-367' id='type-id-283'/>
    <typedef-decl name='gnutls_pcert_st' type-id='type-id-368' id='type-id-369'/>
    <class-decl name='gnutls_pcert_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pubkey' type-id='type-id-370' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cert' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='type' type-id='type-id-178' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_pubkey_t' type-id='type-id-371' id='type-id-370'/>
    <typedef-decl name='gnutls_ocsp_data_st' type-id='type-id-372' id='type-id-373'/>
    <class-decl name='gnutls_ocsp_data_st' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-372'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exptime' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='padding' type-id='type-id-152' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_status_request_ocsp_func' type-id='type-id-374' id='type-id-287'/>
    <typedef-decl name='dtls_st' type-id='type-id-375' id='type-id-288'/>
    <class-decl name='__anonymous_struct__11' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-288' visibility='default' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dcookie' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hsk_write_seq' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hsk_read_seq' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mtu' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flight_init' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='last_flight' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='retrans_timeout_ms' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hsk_hello_verify_requests' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='actual_retrans_timeout_ms' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='async_term' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_retransmit' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='packets_dropped' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-38' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-33' id='type-id-38'/>
    <typedef-decl name='heartbeat_state_t' type-id='type-id-376' id='type-id-289'/>
    <enum-decl name='heartbeat_state_t' id='type-id-376'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='SHB_SEND1' value='0'/>
      <enumerator name='SHB_SEND2' value='1'/>
      <enumerator name='SHB_RECV' value='2'/>
    </enum-decl>
    <typedef-decl name='recv_state_t' type-id='type-id-377' id='type-id-290'/>
    <enum-decl name='recv_state_t' id='type-id-377'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='RECV_STATE_0' value='0'/>
      <enumerator name='RECV_STATE_DTLS_RETRANSMIT' value='1'/>
      <enumerator name='RECV_STATE_FALSE_START_HANDLING' value='2'/>
      <enumerator name='RECV_STATE_FALSE_START' value='3'/>
      <enumerator name='RECV_STATE_ASYNC_HANDSHAKE' value='4'/>
      <enumerator name='RECV_STATE_EARLY_START_HANDLING' value='5'/>
      <enumerator name='RECV_STATE_EARLY_START' value='6'/>
      <enumerator name='RECV_STATE_REHANDSHAKE' value='7'/>
      <enumerator name='RECV_STATE_REAUTH' value='8'/>
    </enum-decl>
    <typedef-decl name='gnutls_certificate_verify_function' type-id='type-id-378' id='type-id-379'/>
    <typedef-decl name='gnutls_typed_vdata_st' type-id='type-id-380' id='type-id-293'/>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-293' visibility='default' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_vdata_types_t' type-id='type-id-382' id='type-id-381'/>
    <enum-decl name='__anonymous_enum__18' is-anonymous='yes' id='type-id-382'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_DT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DT_DNS_HOSTNAME' value='1'/>
      <enumerator name='GNUTLS_DT_KEY_PURPOSE_OID' value='2'/>
      <enumerator name='GNUTLS_DT_RFC822NAME' value='3'/>
      <enumerator name='GNUTLS_DT_IP_ADDRESS' value='4'/>
    </enum-decl>
    <typedef-decl name='tfo_st' type-id='type-id-383' id='type-id-294'/>
    <class-decl name='tfo_st' size-in-bits='1216' is-struct='yes' visibility='default' id='type-id-383'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='connect_only' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='connect_addr' type-id='type-id-384' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='connect_addrlen' type-id='type-id-385' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' size-in-bits='1024' is-struct='yes' visibility='default' id='type-id-384'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-386' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_family_t' type-id='type-id-28' id='type-id-386'/>
    <typedef-decl name='socklen_t' type-id='type-id-387' id='type-id-385'/>
    <typedef-decl name='__socklen_t' type-id='type-id-2' id='type-id-387'/>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priv' type-id='type-id-388' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resumed_priv' type-id='type-id-388' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='resumed_set' type-id='type-id-139' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-3' id='type-id-388'/>
    <typedef-decl name='gnutls_ext_flags_t' type-id='type-id-389' id='type-id-297'/>
    <enum-decl name='__anonymous_enum__19' is-anonymous='yes' id='type-id-389'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_EXT_FLAG_OVERRIDE_INTERNAL' value='1'/>
      <enumerator name='GNUTLS_EXT_FLAG_CLIENT_HELLO' value='2'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS12_SERVER_HELLO' value='4'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS13_SERVER_HELLO' value='8'/>
      <enumerator name='GNUTLS_EXT_FLAG_EE' value='16'/>
      <enumerator name='GNUTLS_EXT_FLAG_HRR' value='32'/>
      <enumerator name='GNUTLS_EXT_FLAG_IGNORE_CLIENT_REQUEST' value='64'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS' value='128'/>
      <enumerator name='GNUTLS_EXT_FLAG_DTLS' value='256'/>
    </enum-decl>
    <typedef-decl name='tls13_ticket_st' type-id='type-id-390' id='type-id-298'/>
    <class-decl name='__anonymous_struct__14' size-in-bits='3136' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-298' visibility='default' id='type-id-390'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arrival_time' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='creation_time' type-id='type-id-50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lifetime' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='age_add' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nonce' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='nonce_size' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='prf' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='resumption_master_secret' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='ticket' type-id='type-id-131' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_anti_replay_t' type-id='type-id-391' id='type-id-299'/>
    <typedef-decl name='gnutls_key_st' type-id='type-id-392' id='type-id-172'/>
    <class-decl name='gnutls_key_st' size-in-bits='22656' is-struct='yes' visibility='default' id='type-id-392'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kshare' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='proto' type-id='type-id-394' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20096'>
        <var-decl name='binders' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20608'>
        <var-decl name='key' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20736'>
        <var-decl name='session_ticket_key' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21248'>
        <var-decl name='previous_ticket_key' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21760'>
        <var-decl name='initial_stek' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22272'>
        <var-decl name='auth_info' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22336'>
        <var-decl name='auth_info_type' type-id='type-id-395' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22368'>
        <var-decl name='auth_info_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22400'>
        <var-decl name='cred' type-id='type-id-396' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22464'>
        <var-decl name='totp' type-id='type-id-397' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='11520' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-393'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh_params' type-id='type-id-398' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='ecdhx_params' type-id='type-id-398' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='dh_params' type-id='type-id-398' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_pk_params_st' type-id='type-id-399' id='type-id-398'/>
    <class-decl name='__anonymous_struct__16' size-in-bits='3840' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-398' visibility='default' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='params_nr' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='pkflags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='qbits' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='curve' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_group' type-id='type-id-197' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='gost_params' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='raw_pub' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='raw_priv' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='seed_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='seed' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='palgo' type-id='type-id-323' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='spki' type-id='type-id-401' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='algo' type-id='type-id-201' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bigint_t' type-id='type-id-3' id='type-id-98'/>
    <typedef-decl name='gnutls_gost_paramset_t' type-id='type-id-402' id='type-id-400'/>
    <enum-decl name='__anonymous_enum__20' is-anonymous='yes' id='type-id-402'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_TC26_Z' value='1'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_A' value='2'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_B' value='3'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_C' value='4'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_D' value='5'/>
    </enum-decl>
    <typedef-decl name='gnutls_x509_spki_st' type-id='type-id-403' id='type-id-401'/>
    <class-decl name='gnutls_x509_spki_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_dig' type-id='type-id-323' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='salt_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='legacy' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dsa_dig' type-id='type-id-323' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flags' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='8576' is-anonymous='yes' visibility='default' id='type-id-394'>
      <data-member access='private'>
        <var-decl name='tls13' type-id='type-id-404' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tls12' type-id='type-id-405' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='4128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-404'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='temp_secret' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='temp_secret_size' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='e_ckey' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='hs_ckey' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='hs_skey' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='ap_ckey' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='ap_skey' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='ap_expkey' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='ap_rms' type-id='type-id-151' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='8576' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-405'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh' type-id='type-id-406' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='dh' type-id='type-id-407' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='srp' type-id='type-id-408' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='4096' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-406'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-398' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='x' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='y' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='raw' type-id='type-id-131' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='3904' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-407'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-398' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='client_Y' type-id='type-id-98' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srp_key' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srp_g' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srp_p' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='A' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='B' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='u' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='b' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='a' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x' type-id='type-id-98' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='binder_data_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prf' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='psk' type-id='type-id-131' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='idx' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='resumption' type-id='type-id-139' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_credentials_type_t' type-id='type-id-409' id='type-id-395'/>
    <enum-decl name='__anonymous_enum__21' is-anonymous='yes' id='type-id-409'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='GNUTLS_CRD_CERTIFICATE' value='1'/>
      <enumerator name='GNUTLS_CRD_ANON' value='2'/>
      <enumerator name='GNUTLS_CRD_SRP' value='3'/>
      <enumerator name='GNUTLS_CRD_PSK' value='4'/>
      <enumerator name='GNUTLS_CRD_IA' value='5'/>
    </enum-decl>
    <typedef-decl name='auth_cred_st' type-id='type-id-410' id='type-id-411'/>
    <class-decl name='auth_cred_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='algorithm' type-id='type-id-395' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='credentials' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-396' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-397'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='last_result' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='was_rotated' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb' type-id='type-id-412' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_stek_rotation_callback_t' type-id='type-id-413' id='type-id-412'/>
    <class-decl name='ub_result' size-in-bits='768' is-struct='yes' visibility='default' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qname' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qtype' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='qclass' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-415' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='len' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='canonname' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rcode' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='answer_packet' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='answer_len' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='havedata' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nxdomain' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='secure' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='bogus' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='why_bogus' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='was_ratelimited' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='ttl' type-id='type-id-14' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dane_state_t' type-id='type-id-416' id='type-id-417'/>
    <class-decl name='dane_state_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-419' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-2' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dane_query_t' type-id='type-id-420' id='type-id-421'/>
    <class-decl name='dane_query_st' size-in-bits='22592' is-struct='yes' visibility='default' id='type-id-422'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='result' type-id='type-id-423' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data_entries' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='usage' type-id='type-id-129' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='type' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='match' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='data' type-id='type-id-132' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22528'>
        <var-decl name='flags' type-id='type-id-2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22560'>
        <var-decl name='status' type-id='type-id-424' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dane_cert_usage_t' type-id='type-id-93' id='type-id-89'/>
    <enum-decl name='dane_cert_usage_t' id='type-id-93'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='DANE_CERT_USAGE_CA' value='0'/>
      <enumerator name='DANE_CERT_USAGE_EE' value='1'/>
      <enumerator name='DANE_CERT_USAGE_LOCAL_CA' value='2'/>
      <enumerator name='DANE_CERT_USAGE_LOCAL_EE' value='3'/>
    </enum-decl>
    <typedef-decl name='dane_cert_type_t' type-id='type-id-92' id='type-id-91'/>
    <enum-decl name='dane_cert_type_t' id='type-id-92'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='DANE_CERT_X509' value='0'/>
      <enumerator name='DANE_CERT_PK' value='1'/>
    </enum-decl>
    <typedef-decl name='dane_match_type_t' type-id='type-id-94' id='type-id-90'/>
    <enum-decl name='dane_match_type_t' id='type-id-94'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='DANE_MATCH_EXACT' value='0'/>
      <enumerator name='DANE_MATCH_SHA2_256' value='1'/>
      <enumerator name='DANE_MATCH_SHA2_512' value='2'/>
    </enum-decl>
    <typedef-decl name='dane_query_status_t' type-id='type-id-425' id='type-id-424'/>
    <enum-decl name='dane_query_status_t' id='type-id-425'>
      <underlying-type type-id='type-id-72'/>
      <enumerator name='DANE_QUERY_UNKNOWN' value='0'/>
      <enumerator name='DANE_QUERY_DNSSEC_VERIFIED' value='1'/>
      <enumerator name='DANE_QUERY_BOGUS' value='2'/>
      <enumerator name='DANE_QUERY_NO_DNSSEC' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-9'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-426'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-428'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-8'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-429'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-212'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-430'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-431'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-432'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-118'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-433'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-434'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-121'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-435'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-123'/>
    <qualified-type-def type-id='type-id-164' const='yes' id='type-id-436'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-438'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-192' const='yes' id='type-id-440'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-175'/>
    <qualified-type-def type-id='type-id-336' const='yes' id='type-id-441'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-265'/>
    <qualified-type-def type-id='type-id-328' const='yes' id='type-id-324'/>
