<abi-corpus architecture='elf-amd-x86_64' soname='libgnutls.so.30'>
  <elf-needed>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.2'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libnettle.so.6'/>
    <dependency name='libhogweed.so.4'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_dsa_generate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_generate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_gnutls13_psk_ext_iter_next_binder' version='GNUTLS_PRIVATE_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gnutls_ffdhe_4096_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_4096_group_q' size='16' version='GNUTLS_3_6_8' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_4096_key_bits' size='4' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_6144_group_generator' size='16' version='GNUTLS_3_6_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_6144_group_prime' size='16' version='GNUTLS_3_6_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_6144_group_q' size='16' version='GNUTLS_3_6_8' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_6144_key_bits' size='4' version='GNUTLS_3_6_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_group_q' size='16' version='GNUTLS_3_6_8' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_key_bits' size='4' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_free' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_malloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_realloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_secure_malloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_generator' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_prime' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_strdup' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='range.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='type-id-1'/>
    <typedef-decl name='__ssize_t' type-id='type-id-1' id='type-id-2'/>
    <typedef-decl name='ssize_t' type-id='type-id-2' id='type-id-3'/>
    <class-decl name='gnutls_session_int' size-in-bits='52416' is-struct='yes' visibility='default' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security_parameters' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='record_parameters' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='internals' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30080'>
        <var-decl name='key' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='2048' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-5' visibility='default' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entity' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='epoch_read' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='epoch_write' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epoch_next' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='epoch_min' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cs' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prf' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='master_secret' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='client_random' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='server_random' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='session_id' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='session_id_size' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='timestamp' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='post_handshake_auth' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='max_record_send_size' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='max_record_recv_size' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1584'>
        <var-decl name='max_user_record_send_size' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='max_user_record_recv_size' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='max_early_data_size' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='client_ctype' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='server_ctype' type-id='type-id-19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='grp' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='server_sign_algo' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='client_sign_algo' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ext_master_secret' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1864'>
        <var-decl name='etm' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1872'>
        <var-decl name='client_auth_type' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1880'>
        <var-decl name='server_auth_type' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='do_recv_supplemental' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='do_send_supplemental' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pversion' type-id='type-id-23' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-10'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-24'/>
    <typedef-decl name='__uint16_t' type-id='type-id-24' id='type-id-25'/>
    <typedef-decl name='uint16_t' type-id='type-id-25' id='type-id-11'/>
    <class-decl name='gnutls_cipher_suite_entry_st' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='block_algorithm' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='kx_algorithm' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mac_algorithm' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='min_version' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='max_version' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_dtls_version' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_dtls_version' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='prf' type-id='type-id-31' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='char' size-in-bits='8' id='type-id-33'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-27'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-35'/>
    <typedef-decl name='__uint8_t' type-id='type-id-35' id='type-id-36'/>
    <typedef-decl name='uint8_t' type-id='type-id-36' id='type-id-16'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-37'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-38'/>

    <array-type-def dimensions='1' type-id='type-id-37' size-in-bits='16' id='type-id-39'>
      <subrange length='2' type-id='type-id-38' id='type-id-40'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-28'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-41'/>
    <enum-decl name='gnutls_cipher_algorithm' id='type-id-42'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_CIPHER_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CIPHER_NULL' value='1'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_128' value='2'/>
      <enumerator name='GNUTLS_CIPHER_3DES_CBC' value='3'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CBC' value='4'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CBC' value='5'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_40' value='6'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_CBC' value='7'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_CBC' value='8'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CBC' value='9'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_GCM' value='10'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_GCM' value='11'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_192_CBC' value='12'/>
      <enumerator name='GNUTLS_CIPHER_SALSA20_256' value='13'/>
      <enumerator name='GNUTLS_CIPHER_ESTREAM_SALSA20_256' value='14'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_GCM' value='15'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_GCM' value='16'/>
      <enumerator name='GNUTLS_CIPHER_RC2_40_CBC' value='17'/>
      <enumerator name='GNUTLS_CIPHER_DES_CBC' value='18'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM' value='19'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM' value='20'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM_8' value='21'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM_8' value='22'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_POLY1305' value='23'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CFB' value='24'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPA_CFB' value='25'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPB_CFB' value='26'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPC_CFB' value='27'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPD_CFB' value='28'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CFB8' value='29'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CFB8' value='30'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CFB8' value='31'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_XTS' value='32'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_XTS' value='33'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CNT' value='34'/>
      <enumerator name='GNUTLS_CIPHER_IDEA_PGP_CFB' value='200'/>
      <enumerator name='GNUTLS_CIPHER_3DES_PGP_CFB' value='201'/>
      <enumerator name='GNUTLS_CIPHER_CAST5_PGP_CFB' value='202'/>
      <enumerator name='GNUTLS_CIPHER_BLOWFISH_PGP_CFB' value='203'/>
      <enumerator name='GNUTLS_CIPHER_SAFER_SK128_PGP_CFB' value='204'/>
      <enumerator name='GNUTLS_CIPHER_AES128_PGP_CFB' value='205'/>
      <enumerator name='GNUTLS_CIPHER_AES192_PGP_CFB' value='206'/>
      <enumerator name='GNUTLS_CIPHER_AES256_PGP_CFB' value='207'/>
      <enumerator name='GNUTLS_CIPHER_TWOFISH_PGP_CFB' value='208'/>
    </enum-decl>
    <typedef-decl name='gnutls_cipher_algorithm_t' type-id='type-id-42' id='type-id-29'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-43'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_KX_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_KX_RSA' value='1'/>
      <enumerator name='GNUTLS_KX_DHE_DSS' value='2'/>
      <enumerator name='GNUTLS_KX_DHE_RSA' value='3'/>
      <enumerator name='GNUTLS_KX_ANON_DH' value='4'/>
      <enumerator name='GNUTLS_KX_SRP' value='5'/>
      <enumerator name='GNUTLS_KX_RSA_EXPORT' value='6'/>
      <enumerator name='GNUTLS_KX_SRP_RSA' value='7'/>
      <enumerator name='GNUTLS_KX_SRP_DSS' value='8'/>
      <enumerator name='GNUTLS_KX_PSK' value='9'/>
      <enumerator name='GNUTLS_KX_DHE_PSK' value='10'/>
      <enumerator name='GNUTLS_KX_ANON_ECDH' value='11'/>
      <enumerator name='GNUTLS_KX_ECDHE_RSA' value='12'/>
      <enumerator name='GNUTLS_KX_ECDHE_ECDSA' value='13'/>
      <enumerator name='GNUTLS_KX_ECDHE_PSK' value='14'/>
      <enumerator name='GNUTLS_KX_RSA_PSK' value='15'/>
    </enum-decl>
    <typedef-decl name='gnutls_kx_algorithm_t' type-id='type-id-43' id='type-id-30'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-44'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_MAC_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_MAC_NULL' value='1'/>
      <enumerator name='GNUTLS_MAC_MD5' value='2'/>
      <enumerator name='GNUTLS_MAC_SHA1' value='3'/>
      <enumerator name='GNUTLS_MAC_RMD160' value='4'/>
      <enumerator name='GNUTLS_MAC_MD2' value='5'/>
      <enumerator name='GNUTLS_MAC_SHA256' value='6'/>
      <enumerator name='GNUTLS_MAC_SHA384' value='7'/>
      <enumerator name='GNUTLS_MAC_SHA512' value='8'/>
      <enumerator name='GNUTLS_MAC_SHA224' value='9'/>
      <enumerator name='GNUTLS_MAC_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_MAC_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_MAC_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_MAC_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_MAC_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_MAC_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_512' value='17'/>
      <enumerator name='GNUTLS_MAC_AEAD' value='200'/>
      <enumerator name='GNUTLS_MAC_UMAC_96' value='201'/>
      <enumerator name='GNUTLS_MAC_UMAC_128' value='202'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_128' value='203'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_256' value='204'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_128' value='205'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_192' value='206'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_256' value='207'/>
      <enumerator name='GNUTLS_MAC_GOST28147_TC26Z_IMIT' value='208'/>
    </enum-decl>
    <typedef-decl name='gnutls_mac_algorithm_t' type-id='type-id-44' id='type-id-31'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-45'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_SSL3' value='1'/>
      <enumerator name='GNUTLS_TLS1_0' value='2'/>
      <enumerator name='GNUTLS_TLS1' value='2'/>
      <enumerator name='GNUTLS_TLS1_1' value='3'/>
      <enumerator name='GNUTLS_TLS1_2' value='4'/>
      <enumerator name='GNUTLS_TLS1_3' value='5'/>
      <enumerator name='GNUTLS_DTLS0_9' value='200'/>
      <enumerator name='GNUTLS_DTLS1_0' value='201'/>
      <enumerator name='GNUTLS_DTLS1_2' value='202'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MIN' value='200'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MAX' value='202'/>
      <enumerator name='GNUTLS_TLS_VERSION_MAX' value='5'/>
      <enumerator name='GNUTLS_VERSION_UNKNOWN' value='255'/>
    </enum-decl>
    <typedef-decl name='gnutls_protocol_t' type-id='type-id-45' id='type-id-32'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-12'/>
    <class-decl name='mac_entry_st' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_oid' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='output_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nonce_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='placeholder' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='preimage_insecure' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mac_entry_st' type-id='type-id-47' id='type-id-48'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-49'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-13'/>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='384' id='type-id-14'>
      <subrange length='48' type-id='type-id-38' id='type-id-50'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='256' id='type-id-15'>
      <subrange length='32' type-id='type-id-38' id='type-id-51'/>

    </array-type-def>
    <typedef-decl name='__time_t' type-id='type-id-1' id='type-id-52'/>
    <typedef-decl name='time_t' type-id='type-id-52' id='type-id-17'/>
    <typedef-decl name='__uint32_t' type-id='type-id-10' id='type-id-53'/>
    <typedef-decl name='uint32_t' type-id='type-id-53' id='type-id-18'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-54'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_CRT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CRT_X509' value='1'/>
      <enumerator name='GNUTLS_CRT_OPENPGP' value='2'/>
      <enumerator name='GNUTLS_CRT_RAWPK' value='3'/>
      <enumerator name='GNUTLS_CRT_MAX' value='3'/>
    </enum-decl>
    <typedef-decl name='gnutls_certificate_type_t' type-id='type-id-54' id='type-id-19'/>
    <class-decl name='gnutls_group_entry_st' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prime' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='q' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='generator' type-id='type-id-57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='q_bits' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='curve' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pk' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tls_id' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-61'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_GROUP_INVALID' value='0'/>
      <enumerator name='GNUTLS_GROUP_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_GROUP_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_GROUP_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_GROUP_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_GROUP_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_GROUP_X25519' value='6'/>
      <enumerator name='GNUTLS_GROUP_GC256A' value='16'/>
      <enumerator name='GNUTLS_GROUP_GC256B' value='17'/>
      <enumerator name='GNUTLS_GROUP_GC256C' value='18'/>
      <enumerator name='GNUTLS_GROUP_GC256D' value='19'/>
      <enumerator name='GNUTLS_GROUP_GC512A' value='13'/>
      <enumerator name='GNUTLS_GROUP_GC512B' value='14'/>
      <enumerator name='GNUTLS_GROUP_GC512C' value='15'/>
      <enumerator name='GNUTLS_GROUP_FFDHE2048' value='256'/>
      <enumerator name='GNUTLS_GROUP_FFDHE3072' value='257'/>
      <enumerator name='GNUTLS_GROUP_FFDHE4096' value='258'/>
      <enumerator name='GNUTLS_GROUP_FFDHE8192' value='259'/>
      <enumerator name='GNUTLS_GROUP_FFDHE6144' value='260'/>
      <enumerator name='GNUTLS_GROUP_MAX' value='260'/>
    </enum-decl>
    <typedef-decl name='gnutls_group_t' type-id='type-id-61' id='type-id-56'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-62' visibility='default' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-64'/>
    <typedef-decl name='gnutls_datum_t' type-id='type-id-63' id='type-id-62'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-65'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-57'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-66'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-58'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-67'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_ECC_CURVE_INVALID' value='0'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_ECC_CURVE_X25519' value='6'/>
      <enumerator name='GNUTLS_ECC_CURVE_ED25519' value='7'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPA' value='8'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPB' value='9'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPC' value='10'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXA' value='11'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXB' value='12'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512A' value='13'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512B' value='14'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512C' value='15'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256A' value='16'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256B' value='17'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256C' value='18'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256D' value='19'/>
      <enumerator name='GNUTLS_ECC_CURVE_MAX' value='19'/>
    </enum-decl>
    <typedef-decl name='gnutls_ecc_curve_t' type-id='type-id-67' id='type-id-59'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-68'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_PK_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_PK_RSA' value='1'/>
      <enumerator name='GNUTLS_PK_DSA' value='2'/>
      <enumerator name='GNUTLS_PK_DH' value='3'/>
      <enumerator name='GNUTLS_PK_ECDSA' value='4'/>
      <enumerator name='GNUTLS_PK_ECDH_X25519' value='5'/>
      <enumerator name='GNUTLS_PK_RSA_PSS' value='6'/>
      <enumerator name='GNUTLS_PK_EDDSA_ED25519' value='7'/>
      <enumerator name='GNUTLS_PK_GOST_01' value='8'/>
      <enumerator name='GNUTLS_PK_GOST_12_256' value='9'/>
      <enumerator name='GNUTLS_PK_GOST_12_512' value='10'/>
      <enumerator name='GNUTLS_PK_MAX' value='10'/>
    </enum-decl>
    <typedef-decl name='gnutls_pk_algorithm_t' type-id='type-id-68' id='type-id-60'/>
    <typedef-decl name='gnutls_group_entry_st' type-id='type-id-55' id='type-id-69'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-20'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-71'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_SIGN_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA1' value='1'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA' value='1'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA1' value='2'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA' value='2'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD5' value='3'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD2' value='4'/>
      <enumerator name='GNUTLS_SIGN_RSA_RMD160' value='5'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA256' value='6'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA384' value='7'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA512' value='8'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA224' value='9'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA224' value='10'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA256' value='11'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA1' value='12'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA224' value='13'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA256' value='14'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA384' value='15'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA512' value='16'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA384' value='17'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA512' value='18'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_224' value='20'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_256' value='21'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_384' value='22'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_512' value='23'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_224' value='24'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_256' value='25'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_384' value='26'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_512' value='27'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_224' value='28'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_256' value='29'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_384' value='30'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_512' value='31'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA256' value='32'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA384' value='33'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA512' value='34'/>
      <enumerator name='GNUTLS_SIGN_EDDSA_ED25519' value='35'/>
      <enumerator name='GNUTLS_SIGN_RSA_RAW' value='36'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP256R1_SHA256' value='37'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP384R1_SHA384' value='38'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP521R1_SHA512' value='39'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA256' value='40'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA384' value='41'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA512' value='42'/>
      <enumerator name='GNUTLS_SIGN_GOST_94' value='43'/>
      <enumerator name='GNUTLS_SIGN_GOST_256' value='44'/>
      <enumerator name='GNUTLS_SIGN_GOST_512' value='45'/>
      <enumerator name='GNUTLS_SIGN_MAX' value='45'/>
    </enum-decl>
    <typedef-decl name='gnutls_sign_algorithm_t' type-id='type-id-71' id='type-id-21'/>
    <type-decl name='int' size-in-bits='32' id='type-id-22'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='age' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='major' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='minor' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supported' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='explicit_iv' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='extensions' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='selectable_sighash' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='selectable_prf' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='obsolete' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='tls13_sem' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='false_start' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='only_extension' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='post_handshake_auth' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='key_shares' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='tls_sig_sem' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='transport_t' id='type-id-76'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_STREAM' value='0'/>
      <enumerator name='GNUTLS_DGRAM' value='1'/>
    </enum-decl>
    <typedef-decl name='transport_t' type-id='type-id-76' id='type-id-74'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-75'/>
    <typedef-decl name='version_entry_st' type-id='type-id-73' id='type-id-72'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-77'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-23'/>
    <typedef-decl name='security_parameters_st' type-id='type-id-9' id='type-id-5'/>
    <class-decl name='record_parameters_st' size-in-bits='5376' is-struct='yes' visibility='default' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='epoch' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='initialized' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cipher' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='etm' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mac' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dtls_sw_next' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dtls_sw_bits' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dtls_sw_have_recv' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='read' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='write' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='usage_cnt' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='cipher_entry_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blocksize' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='keysize' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='implicit_iv' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='explicit_iv' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cipher_iv' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='tagsize' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='xor_nonce' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='only_aead' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='no_rekey' type-id='type-id-75' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-84'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='CIPHER_STREAM' value='0'/>
      <enumerator name='CIPHER_BLOCK' value='1'/>
      <enumerator name='CIPHER_AEAD' value='2'/>
    </enum-decl>
    <typedef-decl name='cipher_type_t' type-id='type-id-84' id='type-id-83'/>
    <typedef-decl name='cipher_entry_st' type-id='type-id-82' id='type-id-85'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-86'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-79'/>
    <typedef-decl name='__uint64_t' type-id='type-id-38' id='type-id-87'/>
    <typedef-decl name='uint64_t' type-id='type-id-87' id='type-id-80'/>
    <class-decl name='record_state_st' size-in-bits='2432' is-struct='yes' visibility='default' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mac_key' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mac_key_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='iv' type-id='type-id-90' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='iv_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='key' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='key_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ctx' type-id='type-id-91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='aead_tag_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='is_aead' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='sequence_number' type-id='type-id-92' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='512' id='type-id-89'>
      <subrange length='64' type-id='type-id-38' id='type-id-93'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='128' id='type-id-90'>
      <subrange length='16' type-id='type-id-38' id='type-id-94'/>

    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='1280' is-anonymous='yes' visibility='default' id='type-id-91'>
      <data-member access='private'>
        <var-decl name='tls12' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='aead' type-id='type-id-96' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1280' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-95' visibility='default' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cipher' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mac' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_mac' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='non_null' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='etm' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tag_size' type-id='type-id-100' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='e' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='encrypt' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aead_encrypt' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='aead_decrypt' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tag' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='setiv' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='getiv' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='deinit' type-id='type-id-111' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-102'/>
    <typedef-decl name='size_t' type-id='type-id-38' id='type-id-100'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <typedef-decl name='cipher_encrypt_func' type-id='type-id-114' id='type-id-103'/>
    <typedef-decl name='cipher_decrypt_func' type-id='type-id-114' id='type-id-104'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <typedef-decl name='aead_cipher_encrypt_func' type-id='type-id-116' id='type-id-105'/>
    <typedef-decl name='aead_cipher_decrypt_func' type-id='type-id-116' id='type-id-106'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <typedef-decl name='cipher_auth_func' type-id='type-id-118' id='type-id-107'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-120'/>
    <typedef-decl name='cipher_tag_func' type-id='type-id-120' id='type-id-108'/>
    <typedef-decl name='cipher_setiv_func' type-id='type-id-118' id='type-id-109'/>
    <typedef-decl name='cipher_getiv_func' type-id='type-id-118' id='type-id-110'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-122'/>
    <typedef-decl name='cipher_deinit_func' type-id='type-id-122' id='type-id-111'/>
    <typedef-decl name='cipher_hd_st' type-id='type-id-101' id='type-id-98'/>
    <union-decl name='__anonymous_union__' size-in-bits='448' is-anonymous='yes' visibility='default' id='type-id-99'>
      <data-member access='private'>
        <var-decl name='dig' type-id='type-id-123' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac' type-id='type-id-124' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-123' visibility='default' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='output' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='deinit' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='keysize' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handle' type-id='type-id-102' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hash_func' type-id='type-id-118' id='type-id-126'/>
    <typedef-decl name='output_func' type-id='type-id-118' id='type-id-127'/>
    <typedef-decl name='hash_deinit_func' type-id='type-id-122' id='type-id-128'/>
    <typedef-decl name='digest_hd_st' type-id='type-id-125' id='type-id-123'/>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-124' visibility='default' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mac_len' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash' type-id='type-id-126' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='setnonce' type-id='type-id-130' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-127' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit' type-id='type-id-128' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handle' type-id='type-id-102' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nonce_func' type-id='type-id-118' id='type-id-130'/>
    <typedef-decl name='mac_hd_st' type-id='type-id-129' id='type-id-124'/>
    <typedef-decl name='auth_cipher_hd_st' type-id='type-id-97' id='type-id-95'/>
    <class-decl name='api_aead_cipher_hd_st' size-in-bits='704' is-struct='yes' visibility='default' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-98' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='api_aead_cipher_hd_st' type-id='type-id-131' id='type-id-96'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-92' visibility='default' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='i' type-id='type-id-133' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='64' id='type-id-133'>
      <subrange length='8' type-id='type-id-38' id='type-id-134'/>

    </array-type-def>
    <typedef-decl name='gnutls_uint64' type-id='type-id-132' id='type-id-92'/>
    <typedef-decl name='record_state_st' type-id='type-id-88' id='type-id-81'/>
    <typedef-decl name='record_parameters_st' type-id='type-id-78' id='type-id-135'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>

    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='256' id='type-id-6'>
      <subrange length='4' type-id='type-id-38' id='type-id-137'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='27776' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-7' visibility='default' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handshake_hash_buffer_prev_len' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='handshake_hash_buffer_client_hello_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='handshake_hash_buffer_client_kx_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='handshake_hash_buffer_server_finished_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handshake_hash_buffer_client_finished_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handshake_hash_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resumable' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='ticket_state' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bye_state' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reauth_state' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='handshake_final_state' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='handshake_state' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='invalid_connection' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='904'>
        <var-decl name='may_not_read' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='may_not_write' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='920'>
        <var-decl name='read_eof' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='last_alert' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='last_handshake_in' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='last_handshake_out' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='priorities' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='allow_large_records' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1096'>
        <var-decl name='allow_small_records' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='no_etm' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1112'>
        <var-decl name='no_ext_master_secret' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='allow_key_usage_violation' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1128'>
        <var-decl name='allow_wrong_pms' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='dumbfw' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_prime_bits' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='resumed' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1176'>
        <var-decl name='resumption_requested' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='resumed_security_parameters' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='resumption_data' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='handshake_send_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='handshake_header_recv_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='handshake_recv_buffer' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='handshake_recv_buffer_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='record_recv_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='record_send_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='record_send_buffer_user_size' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='early_data_recv_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='early_data_presend_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='rsend_state' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='record_key_update_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='record_presend_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='reauth_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='expire_time' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='auth_struct' type-id='type-id-148' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='adv_version_major' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9480'>
        <var-decl name='adv_version_minor' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9504'>
        <var-decl name='send_cert_req' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='max_handshake_data_buffer_size' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='pull_timeout_func' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='pull_func' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='push_func' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='vec_push_func' type-id='type-id-153' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9856'>
        <var-decl name='errno_func' type-id='type-id-154' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='transport_recv_ptr' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='transport_send_ptr' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='db_store_func' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='db_retrieve_func' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='db_remove_func' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='db_ptr' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='user_hello_func' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='h_hook' type-id='type-id-160' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10432'>
        <var-decl name='h_type' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10464'>
        <var-decl name='h_post' type-id='type-id-161' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10496'>
        <var-decl name='selected_cert_list' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='selected_cert_list_length' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='selected_key' type-id='type-id-163' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='selected_ocsp' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='selected_ocsp_length' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='selected_ocsp_func' type-id='type-id-165' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='selected_ocsp_func_ptr' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='selected_need_free' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10952'>
        <var-decl name='default_record_version' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10968'>
        <var-decl name='default_hello_version' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='user_ptr' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='direction' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11080'>
        <var-decl name='ignore_rdn_sequence' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11088'>
        <var-decl name='rsa_pms_version' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11104'>
        <var-decl name='errnum' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='initial_negotiation_completed' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='post_negotiation_lock' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='transport' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='dtls' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11904'>
        <var-decl name='handshake_suspicious_loops' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11936'>
        <var-decl name='handshake_in_progress' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11944'>
        <var-decl name='premaster_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11968'>
        <var-decl name='cb_tls_unique_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12000'>
        <var-decl name='cb_tls_unique' type-id='type-id-168' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12288'>
        <var-decl name='handshake_start_time' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12416'>
        <var-decl name='handshake_abs_timeout' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12544'>
        <var-decl name='ertt' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12576'>
        <var-decl name='handshake_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='record_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12672'>
        <var-decl name='post_handshake_cr_context' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12800'>
        <var-decl name='post_handshake_hash_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13056'>
        <var-decl name='hsk_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13120'>
        <var-decl name='last_key_update' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13248'>
        <var-decl name='key_update_count' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13312'>
        <var-decl name='full_client_hello' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13568'>
        <var-decl name='extensions_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13632'>
        <var-decl name='hb_local_data' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13888'>
        <var-decl name='hb_remote_data' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14144'>
        <var-decl name='hb_ping_start' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14272'>
        <var-decl name='hb_ping_sent' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14400'>
        <var-decl name='hb_actual_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14432'>
        <var-decl name='hb_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14464'>
        <var-decl name='hb_total_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14496'>
        <var-decl name='ocsp_check_ok' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14528'>
        <var-decl name='hb_state' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14560'>
        <var-decl name='recv_state' type-id='type-id-171' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14592'>
        <var-decl name='sc_random_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14656'>
        <var-decl name='flags' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14720'>
        <var-decl name='verify_callback' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14784'>
        <var-decl name='vc_data' type-id='type-id-173' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14848'>
        <var-decl name='vc_sdata' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15040'>
        <var-decl name='vc_elements' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15072'>
        <var-decl name='vc_status' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15104'>
        <var-decl name='additional_verify_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15136'>
        <var-decl name='cert_hash' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15392'>
        <var-decl name='cert_hash_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15400'>
        <var-decl name='saved_username' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16432'>
        <var-decl name='saved_username_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16448'>
        <var-decl name='tfo' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17664'>
        <var-decl name='rsup' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17728'>
        <var-decl name='rsup_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17792'>
        <var-decl name='rexts' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17856'>
        <var-decl name='rexts_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17920'>
        <var-decl name='ext_data' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24064'>
        <var-decl name='used_exts' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24096'>
        <var-decl name='ext_msg' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24128'>
        <var-decl name='max_recv_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24192'>
        <var-decl name='cand_ec_group' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24256'>
        <var-decl name='cand_dh_group' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24320'>
        <var-decl name='cand_group' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24384'>
        <var-decl name='hrr_cs' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24416'>
        <var-decl name='session_ticket_renew' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24448'>
        <var-decl name='tls13_ticket' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27584'>
        <var-decl name='early_data_received' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='anti_replay' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27712'>
        <var-decl name='epoch_lock' type-id='type-id-102' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mbuffer_head_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tail' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='byte_length' type-id='type-id-100' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mbuffer_st' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='maximum_size' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='uhead_mark' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='type' type-id='type-id-186' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='record_sequence' type-id='type-id-92' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='epoch' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='htype' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='handshake_sequence' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-184'/>
    <enum-decl name='content_type_t' id='type-id-188'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_CHANGE_CIPHER_SPEC' value='20'/>
      <enumerator name='GNUTLS_ALERT' value='21'/>
      <enumerator name='GNUTLS_HANDSHAKE' value='22'/>
      <enumerator name='GNUTLS_APPLICATION_DATA' value='23'/>
      <enumerator name='GNUTLS_HEARTBEAT' value='24'/>
    </enum-decl>
    <typedef-decl name='content_type_t' type-id='type-id-188' id='type-id-186'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-189'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_REQUEST' value='0'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO' value='1'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO' value='2'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_VERIFY_REQUEST' value='3'/>
      <enumerator name='GNUTLS_HANDSHAKE_NEW_SESSION_TICKET' value='4'/>
      <enumerator name='GNUTLS_HANDSHAKE_END_OF_EARLY_DATA' value='5'/>
      <enumerator name='GNUTLS_HANDSHAKE_ENCRYPTED_EXTENSIONS' value='8'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_PKT' value='11'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_KEY_EXCHANGE' value='12'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_REQUEST' value='13'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO_DONE' value='14'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_VERIFY' value='15'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_KEY_EXCHANGE' value='16'/>
      <enumerator name='GNUTLS_HANDSHAKE_FINISHED' value='20'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_STATUS' value='22'/>
      <enumerator name='GNUTLS_HANDSHAKE_SUPPLEMENTAL' value='23'/>
      <enumerator name='GNUTLS_HANDSHAKE_KEY_UPDATE' value='24'/>
      <enumerator name='GNUTLS_HANDSHAKE_CHANGE_CIPHER_SPEC' value='254'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO_V2' value='1024'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_RETRY_REQUEST' value='1025'/>
    </enum-decl>
    <typedef-decl name='gnutls_handshake_description_t' type-id='type-id-189' id='type-id-187'/>
    <typedef-decl name='mbuffer_st' type-id='type-id-185' id='type-id-190'/>
    <typedef-decl name='mbuffer_head_st' type-id='type-id-183' id='type-id-139'/>
    <class-decl name='gnutls_buffer_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocd' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_length' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='type-id-100' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-192'/>
    <typedef-decl name='gnutls_buffer_st' type-id='type-id-191' id='type-id-140'/>
    <enum-decl name='send_ticket_state_t' id='type-id-193'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='TICKET_STATE0' value='0'/>
      <enumerator name='TICKET_STATE1' value='1'/>
    </enum-decl>
    <typedef-decl name='send_ticket_state_t' type-id='type-id-193' id='type-id-141'/>
    <enum-decl name='bye_state_t' id='type-id-194'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='BYE_STATE0' value='0'/>
      <enumerator name='BYE_STATE1' value='1'/>
      <enumerator name='BYE_STATE2' value='2'/>
    </enum-decl>
    <typedef-decl name='bye_state_t' type-id='type-id-194' id='type-id-142'/>
    <enum-decl name='reauth_state_t' id='type-id-195'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='REAUTH_STATE0' value='0'/>
      <enumerator name='REAUTH_STATE1' value='1'/>
      <enumerator name='REAUTH_STATE2' value='2'/>
      <enumerator name='REAUTH_STATE3' value='3'/>
      <enumerator name='REAUTH_STATE4' value='4'/>
      <enumerator name='REAUTH_STATE5' value='5'/>
    </enum-decl>
    <typedef-decl name='reauth_state_t' type-id='type-id-195' id='type-id-143'/>
    <enum-decl name='handshake_state_t' id='type-id-196'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='STATE0' value='0'/>
      <enumerator name='STATE1' value='1'/>
      <enumerator name='STATE2' value='2'/>
      <enumerator name='STATE3' value='3'/>
      <enumerator name='STATE4' value='4'/>
      <enumerator name='STATE5' value='5'/>
      <enumerator name='STATE6' value='6'/>
      <enumerator name='STATE7' value='7'/>
      <enumerator name='STATE8' value='8'/>
      <enumerator name='STATE9' value='9'/>
      <enumerator name='STATE10' value='10'/>
      <enumerator name='STATE11' value='11'/>
      <enumerator name='STATE12' value='12'/>
      <enumerator name='STATE13' value='13'/>
      <enumerator name='STATE14' value='14'/>
      <enumerator name='STATE15' value='15'/>
      <enumerator name='STATE16' value='16'/>
      <enumerator name='STATE17' value='17'/>
      <enumerator name='STATE18' value='18'/>
      <enumerator name='STATE19' value='19'/>
      <enumerator name='STATE20' value='20'/>
      <enumerator name='STATE21' value='21'/>
      <enumerator name='STATE22' value='22'/>
      <enumerator name='STATE30' value='30'/>
      <enumerator name='STATE31' value='31'/>
      <enumerator name='STATE40' value='40'/>
      <enumerator name='STATE41' value='41'/>
      <enumerator name='STATE50' value='50'/>
      <enumerator name='STATE90' value='90'/>
      <enumerator name='STATE91' value='91'/>
      <enumerator name='STATE92' value='92'/>
      <enumerator name='STATE93' value='93'/>
      <enumerator name='STATE94' value='94'/>
      <enumerator name='STATE99' value='99'/>
      <enumerator name='STATE100' value='100'/>
      <enumerator name='STATE101' value='101'/>
      <enumerator name='STATE102' value='102'/>
      <enumerator name='STATE103' value='103'/>
      <enumerator name='STATE104' value='104'/>
      <enumerator name='STATE105' value='105'/>
      <enumerator name='STATE106' value='106'/>
      <enumerator name='STATE107' value='107'/>
      <enumerator name='STATE108' value='108'/>
      <enumerator name='STATE109' value='109'/>
      <enumerator name='STATE110' value='110'/>
      <enumerator name='STATE111' value='111'/>
      <enumerator name='STATE112' value='112'/>
      <enumerator name='STATE113' value='113'/>
      <enumerator name='STATE114' value='114'/>
      <enumerator name='STATE115' value='115'/>
      <enumerator name='STATE150' value='116'/>
    </enum-decl>
    <typedef-decl name='handshake_state_t' type-id='type-id-196' id='type-id-144'/>
    <class-decl name='gnutls_priority_st' size-in-bits='41792' is-struct='yes' visibility='default' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='client_ctype' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='server_ctype' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='_cipher' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='_mac' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10400'>
        <var-decl name='_kx' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='_sign_algo' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14560'>
        <var-decl name='_supported_ecc' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16640'>
        <var-decl name='groups' type-id='type-id-199' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20800'>
        <var-decl name='sigalg' type-id='type-id-200' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24960'>
        <var-decl name='cs' type-id='type-id-201' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='no_extensions' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41440'>
        <var-decl name='sr' type-id='type-id-202' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41472'>
        <var-decl name='min_record_version' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41480'>
        <var-decl name='server_precedence' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41488'>
        <var-decl name='allow_server_key_usage_violation' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41496'>
        <var-decl name='no_tickets' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41504'>
        <var-decl name='have_cbc' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41512'>
        <var-decl name='have_psk' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41520'>
        <var-decl name='force_etm' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41536'>
        <var-decl name='additional_verify_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41568'>
        <var-decl name='fallback' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41600'>
        <var-decl name='level' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41632'>
        <var-decl name='_allow_large_records' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41640'>
        <var-decl name='_allow_small_records' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41648'>
        <var-decl name='_no_etm' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41656'>
        <var-decl name='_no_ext_master_secret' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41664'>
        <var-decl name='_allow_key_usage_violation' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41672'>
        <var-decl name='_allow_wrong_pms' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41680'>
        <var-decl name='_dumbfw' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41696'>
        <var-decl name='_dh_prime_bits' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41728'>
        <var-decl name='usage_cnt' type-id='type-id-204' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='2080' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-198' visibility='default' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priorities' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='num_priorities' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='2048' id='type-id-206'>
      <subrange length='64' type-id='type-id-38' id='type-id-93'/>

    </array-type-def>
    <typedef-decl name='priority_st' type-id='type-id-205' id='type-id-198'/>
    <class-decl name='group_list_st' size-in-bits='4160' is-struct='yes' visibility='default' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='have_ffdhe' type-id='type-id-75' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='4096' id='type-id-208'>
      <subrange length='64' type-id='type-id-38' id='type-id-93'/>

    </array-type-def>
    <typedef-decl name='group_list_st' type-id='type-id-207' id='type-id-199'/>
    <class-decl name='sign_algo_list_st' size-in-bits='4160' is-struct='yes' visibility='default' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-210' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_sign_entry_st' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pk' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='priv_pk' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cert_pk' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tls13_ok' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='curve' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='aid' type-id='type-id-213' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='slevel' type-id='type-id-214' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-215'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_DIG_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DIG_NULL' value='1'/>
      <enumerator name='GNUTLS_DIG_MD5' value='2'/>
      <enumerator name='GNUTLS_DIG_SHA1' value='3'/>
      <enumerator name='GNUTLS_DIG_RMD160' value='4'/>
      <enumerator name='GNUTLS_DIG_MD2' value='5'/>
      <enumerator name='GNUTLS_DIG_SHA256' value='6'/>
      <enumerator name='GNUTLS_DIG_SHA384' value='7'/>
      <enumerator name='GNUTLS_DIG_SHA512' value='8'/>
      <enumerator name='GNUTLS_DIG_SHA224' value='9'/>
      <enumerator name='GNUTLS_DIG_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_DIG_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_DIG_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_DIG_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_DIG_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_DIG_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_512' value='17'/>
    </enum-decl>
    <typedef-decl name='gnutls_digest_algorithm_t' type-id='type-id-215' id='type-id-212'/>
    <class-decl name='__anonymous_struct__' size-in-bits='24' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-216' visibility='default' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tls_sem' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='16' id='type-id-166'>
      <subrange length='2' type-id='type-id-38' id='type-id-40'/>

    </array-type-def>
    <typedef-decl name='sign_algorithm_st' type-id='type-id-217' id='type-id-216'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-213'/>
    <enum-decl name='hash_security_level_t' id='type-id-218'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='_SECURE' value='0'/>
      <enumerator name='_INSECURE_FOR_CERTS' value='1'/>
      <enumerator name='_INSECURE' value='2'/>
    </enum-decl>
    <typedef-decl name='hash_security_level_t' type-id='type-id-218' id='type-id-214'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-219'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-220'/>

    <array-type-def dimensions='1' type-id='type-id-220' size-in-bits='4096' id='type-id-210'>
      <subrange length='64' type-id='type-id-38' id='type-id-93'/>

    </array-type-def>
    <typedef-decl name='sign_algo_list_st' type-id='type-id-209' id='type-id-200'/>
    <class-decl name='ciphersuite_list_st' size-in-bits='16448' is-struct='yes' visibility='default' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_cipher_suite_entry_st' type-id='type-id-26' id='type-id-223'/>

    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='16384' id='type-id-222'>
      <subrange length='256' type-id='type-id-38' id='type-id-224'/>

    </array-type-def>
    <typedef-decl name='ciphersuite_list_st' type-id='type-id-221' id='type-id-201'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-225'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='SR_DISABLED' value='0'/>
      <enumerator name='SR_UNSAFE' value='1'/>
      <enumerator name='SR_PARTIAL' value='2'/>
      <enumerator name='SR_SAFE' value='3'/>
    </enum-decl>
    <typedef-decl name='safe_renegotiation_t' type-id='type-id-225' id='type-id-202'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-226'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_SEC_PARAM_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SEC_PARAM_INSECURE' value='5'/>
      <enumerator name='GNUTLS_SEC_PARAM_EXPORT' value='10'/>
      <enumerator name='GNUTLS_SEC_PARAM_VERY_WEAK' value='15'/>
      <enumerator name='GNUTLS_SEC_PARAM_WEAK' value='20'/>
      <enumerator name='GNUTLS_SEC_PARAM_LOW' value='25'/>
      <enumerator name='GNUTLS_SEC_PARAM_LEGACY' value='30'/>
      <enumerator name='GNUTLS_SEC_PARAM_MEDIUM' value='35'/>
      <enumerator name='GNUTLS_SEC_PARAM_HIGH' value='40'/>
      <enumerator name='GNUTLS_SEC_PARAM_ULTRA' value='45'/>
      <enumerator name='GNUTLS_SEC_PARAM_FUTURE' value='50'/>
      <enumerator name='GNUTLS_SEC_PARAM_MAX' value='50'/>
    </enum-decl>
    <typedef-decl name='gnutls_sec_param_t' type-id='type-id-226' id='type-id-203'/>
    <type-decl name='atomic_uint' size-in-bits='32' id='type-id-204'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-145'/>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-227' visibility='default' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='htype' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rtype' type-id='type-id-187' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sequence' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_offset' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='end_offset' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='header' type-id='type-id-229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='header_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='96' id='type-id-229'>
      <subrange length='12' type-id='type-id-38' id='type-id-230'/>

    </array-type-def>
    <typedef-decl name='handshake_buffer_st' type-id='type-id-228' id='type-id-227'/>

    <array-type-def dimensions='1' type-id='type-id-227' size-in-bits='3456' id='type-id-146'>
      <subrange length='6' type-id='type-id-38' id='type-id-231'/>

    </array-type-def>
    <enum-decl name='record_send_state_t' id='type-id-232'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='RECORD_SEND_NORMAL' value='0'/>
      <enumerator name='RECORD_SEND_CORKED' value='1'/>
      <enumerator name='RECORD_SEND_CORKED_TO_KU' value='2'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_1' value='3'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_2' value='4'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_3' value='5'/>
    </enum-decl>
    <typedef-decl name='record_send_state_t' type-id='type-id-232' id='type-id-147'/>
    <class-decl name='mod_auth_st_int' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gnutls_generate_server_certificate' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gnutls_generate_client_certificate' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gnutls_generate_server_kx' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='gnutls_generate_client_kx' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gnutls_generate_client_crt_vrfy' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='gnutls_generate_server_crt_request' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='gnutls_process_server_certificate' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='gnutls_process_client_certificate' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='gnutls_process_server_kx' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='gnutls_process_client_kx' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='gnutls_process_client_crt_vrfy' type-id='type-id-235' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='gnutls_process_server_crt_request' type-id='type-id-235' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-236'/>
    <typedef-decl name='gnutls_session_t' type-id='type-id-236' id='type-id-237'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-235'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-241'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-148'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-242'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_CERT_IGNORE' value='0'/>
      <enumerator name='GNUTLS_CERT_REQUEST' value='1'/>
      <enumerator name='GNUTLS_CERT_REQUIRE' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_certificate_request_t' type-id='type-id-242' id='type-id-149'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-102' id='type-id-155'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-244'/>
    <typedef-decl name='gnutls_pull_timeout_func' type-id='type-id-244' id='type-id-150'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-246'/>
    <typedef-decl name='gnutls_pull_func' type-id='type-id-246' id='type-id-151'/>
    <typedef-decl name='gnutls_push_func' type-id='type-id-246' id='type-id-152'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-100' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='giovec_t' type-id='type-id-247' id='type-id-248'/>
    <qualified-type-def type-id='type-id-248' const='yes' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <typedef-decl name='gnutls_vec_push_func' type-id='type-id-252' id='type-id-153'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <typedef-decl name='gnutls_errno_func' type-id='type-id-254' id='type-id-154'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <typedef-decl name='gnutls_db_store_func' type-id='type-id-256' id='type-id-156'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <typedef-decl name='gnutls_db_retr_func' type-id='type-id-258' id='type-id-157'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <typedef-decl name='gnutls_db_remove_func' type-id='type-id-260' id='type-id-158'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <typedef-decl name='gnutls_handshake_simple_hook_func' type-id='type-id-262' id='type-id-159'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-264'/>
    <typedef-decl name='gnutls_handshake_hook_func' type-id='type-id-264' id='type-id-160'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-265'/>
    <typedef-decl name='__int16_t' type-id='type-id-265' id='type-id-266'/>
    <typedef-decl name='int16_t' type-id='type-id-266' id='type-id-161'/>
    <class-decl name='gnutls_pcert_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pubkey' type-id='type-id-268' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cert' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='type' type-id='type-id-19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pubkey_st' size-in-bits='4032' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-269'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <typedef-decl name='gnutls_pubkey_t' type-id='type-id-270' id='type-id-268'/>
    <typedef-decl name='gnutls_pcert_st' type-id='type-id-267' id='type-id-271'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-162'/>
    <class-decl name='gnutls_privkey_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-272'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-163'/>
    <class-decl name='gnutls_ocsp_data_st' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exptime' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='padding' type-id='type-id-274' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='256' id='type-id-274'>
      <subrange length='32' type-id='type-id-38' id='type-id-51'/>

    </array-type-def>
    <typedef-decl name='gnutls_ocsp_data_st' type-id='type-id-273' id='type-id-275'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <typedef-decl name='gnutls_status_request_ocsp_func' type-id='type-id-278' id='type-id-165'/>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-167' visibility='default' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dcookie' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hsk_write_seq' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hsk_read_seq' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mtu' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flight_init' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='last_flight' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hsk_hello_verify_requests' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='actual_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='async_term' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_retransmit' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='packets_dropped' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-52' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-280' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-1' id='type-id-280'/>
    <typedef-decl name='dtls_st' type-id='type-id-279' id='type-id-167'/>

    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='288' id='type-id-168'>
      <subrange length='36' type-id='type-id-38' id='type-id-281'/>

    </array-type-def>
    <enum-decl name='heartbeat_state_t' id='type-id-282'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='SHB_SEND1' value='0'/>
      <enumerator name='SHB_SEND2' value='1'/>
      <enumerator name='SHB_RECV' value='2'/>
    </enum-decl>
    <typedef-decl name='heartbeat_state_t' type-id='type-id-282' id='type-id-170'/>
    <enum-decl name='recv_state_t' id='type-id-283'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='RECV_STATE_0' value='0'/>
      <enumerator name='RECV_STATE_DTLS_RETRANSMIT' value='1'/>
      <enumerator name='RECV_STATE_FALSE_START_HANDLING' value='2'/>
      <enumerator name='RECV_STATE_FALSE_START' value='3'/>
      <enumerator name='RECV_STATE_ASYNC_HANDSHAKE' value='4'/>
      <enumerator name='RECV_STATE_EARLY_START_HANDLING' value='5'/>
      <enumerator name='RECV_STATE_EARLY_START' value='6'/>
      <enumerator name='RECV_STATE_REHANDSHAKE' value='7'/>
      <enumerator name='RECV_STATE_REAUTH' value='8'/>
    </enum-decl>
    <typedef-decl name='recv_state_t' type-id='type-id-283' id='type-id-171'/>
    <typedef-decl name='gnutls_certificate_verify_function' type-id='type-id-261' id='type-id-284'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-172'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-174' visibility='default' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-287'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_DT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DT_DNS_HOSTNAME' value='1'/>
      <enumerator name='GNUTLS_DT_KEY_PURPOSE_OID' value='2'/>
      <enumerator name='GNUTLS_DT_RFC822NAME' value='3'/>
      <enumerator name='GNUTLS_DT_IP_ADDRESS' value='4'/>
    </enum-decl>
    <typedef-decl name='gnutls_vdata_types_t' type-id='type-id-287' id='type-id-286'/>
    <typedef-decl name='gnutls_typed_vdata_st' type-id='type-id-285' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-173'/>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='1032' id='type-id-175'>
      <subrange length='129' type-id='type-id-38' id='type-id-288'/>

    </array-type-def>
    <class-decl name='tfo_st' size-in-bits='1216' is-struct='yes' visibility='default' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='connect_only' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='connect_addr' type-id='type-id-290' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='connect_addrlen' type-id='type-id-291' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' size-in-bits='1024' is-struct='yes' visibility='default' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-293' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-38' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_family_t' type-id='type-id-24' id='type-id-292'/>

    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='944' id='type-id-293'>
      <subrange length='118' type-id='type-id-38' id='type-id-294'/>

    </array-type-def>
    <typedef-decl name='__socklen_t' type-id='type-id-10' id='type-id-295'/>
    <typedef-decl name='socklen_t' type-id='type-id-295' id='type-id-291'/>
    <typedef-decl name='tfo_st' type-id='type-id-289' id='type-id-176'/>
    <class-decl name='gnutls_supplemental_entry_st' size-in-bits='256' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-296'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-177'/>
    <class-decl name='hello_ext_entry_st' size-in-bits='640' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-297'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-178'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-298'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priv' type-id='type-id-299' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resumed_priv' type-id='type-id-299' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='resumed_set' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-102' id='type-id-299'/>

    <array-type-def dimensions='1' type-id='type-id-298' size-in-bits='6144' id='type-id-179'>
      <subrange length='32' type-id='type-id-38' id='type-id-51'/>

    </array-type-def>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-300'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_EXT_FLAG_OVERRIDE_INTERNAL' value='1'/>
      <enumerator name='GNUTLS_EXT_FLAG_CLIENT_HELLO' value='2'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS12_SERVER_HELLO' value='4'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS13_SERVER_HELLO' value='8'/>
      <enumerator name='GNUTLS_EXT_FLAG_EE' value='16'/>
      <enumerator name='GNUTLS_EXT_FLAG_HRR' value='32'/>
      <enumerator name='GNUTLS_EXT_FLAG_IGNORE_CLIENT_REQUEST' value='64'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS' value='128'/>
      <enumerator name='GNUTLS_EXT_FLAG_DTLS' value='256'/>
    </enum-decl>
    <typedef-decl name='gnutls_ext_flags_t' type-id='type-id-300' id='type-id-180'/>
    <class-decl name='__anonymous_struct__' size-in-bits='3136' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-181' visibility='default' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arrival_time' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='creation_time' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lifetime' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='age_add' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nonce' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='nonce_size' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='prf' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='resumption_master_secret' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='ticket' type-id='type-id-62' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='2040' id='type-id-302'>
      <subrange length='255' type-id='type-id-38' id='type-id-303'/>

    </array-type-def>
    <typedef-decl name='tls13_ticket_st' type-id='type-id-301' id='type-id-181'/>
    <class-decl name='gnutls_anti_replay_st' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <typedef-decl name='gnutls_anti_replay_t' type-id='type-id-305' id='type-id-182'/>
    <typedef-decl name='internals_st' type-id='type-id-138' id='type-id-7'/>
    <class-decl name='gnutls_key_st' size-in-bits='22336' is-struct='yes' visibility='default' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kshare' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='proto' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19776'>
        <var-decl name='binders' type-id='type-id-309' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20288'>
        <var-decl name='key' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20416'>
        <var-decl name='session_ticket_key' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20928'>
        <var-decl name='previous_ticket_key' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21440'>
        <var-decl name='initial_stek' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21952'>
        <var-decl name='auth_info' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22016'>
        <var-decl name='auth_info_type' type-id='type-id-310' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22048'>
        <var-decl name='auth_info_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22080'>
        <var-decl name='cred' type-id='type-id-311' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22144'>
        <var-decl name='totp' type-id='type-id-312' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='11328' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-307'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh_params' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='ecdhx_params' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='dh_params' type-id='type-id-313' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='3776' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-313' visibility='default' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-315' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='params_nr' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='pkflags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='qbits' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='curve' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_group' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='gost_params' type-id='type-id-316' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='raw_pub' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='raw_priv' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='seed_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='seed' type-id='type-id-317' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='palgo' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='spki' type-id='type-id-318' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='algo' type-id='type-id-60' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bigint_t' type-id='type-id-102' id='type-id-319'/>

    <array-type-def dimensions='1' type-id='type-id-319' size-in-bits='1024' id='type-id-315'>
      <subrange length='16' type-id='type-id-38' id='type-id-94'/>

    </array-type-def>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-320'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_TC26_Z' value='1'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_A' value='2'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_B' value='3'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_C' value='4'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_D' value='5'/>
    </enum-decl>
    <typedef-decl name='gnutls_gost_paramset_t' type-id='type-id-320' id='type-id-316'/>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='2048' id='type-id-317'>
      <subrange length='256' type-id='type-id-38' id='type-id-224'/>

    </array-type-def>
    <class-decl name='gnutls_x509_spki_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_dig' type-id='type-id-212' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='salt_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='legacy' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_x509_spki_st' type-id='type-id-321' id='type-id-318'/>
    <typedef-decl name='gnutls_pk_params_st' type-id='type-id-314' id='type-id-313'/>
    <union-decl name='__anonymous_union__' size-in-bits='8448' is-anonymous='yes' visibility='default' id='type-id-308'>
      <data-member access='private'>
        <var-decl name='tls13' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tls12' type-id='type-id-323' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='4128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-322'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='temp_secret' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='temp_secret_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='e_ckey' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='hs_ckey' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='hs_skey' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='ap_ckey' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='ap_skey' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='ap_expkey' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='ap_rms' type-id='type-id-89' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8448' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-323'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh' type-id='type-id-324' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='dh' type-id='type-id-325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='srp' type-id='type-id-326' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='4032' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-324'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='x' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='y' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='raw' type-id='type-id-62' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='3840' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-325'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='client_Y' type-id='type-id-319' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-326'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srp_key' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srp_g' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srp_p' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='A' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='B' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='u' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='b' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='a' type-id='type-id-319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x' type-id='type-id-319' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='binder_data_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-327'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prf' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='psk' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='idx' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='resumption' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-327' size-in-bits='512' id='type-id-309'>
      <subrange length='2' type-id='type-id-38' id='type-id-40'/>

    </array-type-def>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-328'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_CRD_CERTIFICATE' value='1'/>
      <enumerator name='GNUTLS_CRD_ANON' value='2'/>
      <enumerator name='GNUTLS_CRD_SRP' value='3'/>
      <enumerator name='GNUTLS_CRD_PSK' value='4'/>
      <enumerator name='GNUTLS_CRD_IA' value='5'/>
    </enum-decl>
    <typedef-decl name='gnutls_credentials_type_t' type-id='type-id-328' id='type-id-310'/>
    <class-decl name='auth_cred_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-329'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='algorithm' type-id='type-id-310' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='credentials' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-311' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-311'/>
    <typedef-decl name='auth_cred_st' type-id='type-id-329' id='type-id-330'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='last_result' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='was_rotated' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb' type-id='type-id-331' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <typedef-decl name='gnutls_stek_rotation_callback_t' type-id='type-id-333' id='type-id-331'/>
    <typedef-decl name='gnutls_key_st' type-id='type-id-306' id='type-id-8'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-334' visibility='default' id='type-id-335'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='low' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='high' type-id='type-id-100' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_range_st' type-id='type-id-335' id='type-id-334'/>
    <qualified-type-def type-id='type-id-334' const='yes' id='type-id-336'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
    <function-decl name='gnutls_record_send_range' mangled-name='gnutls_record_send_range' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_send_range@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='data'/>
      <parameter type-id='type-id-100' name='data_size'/>
      <parameter type-id='type-id-337' name='range'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-338'/>
    <function-decl name='gnutls_range_split' mangled-name='gnutls_range_split' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_range_split@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-337' name='orig'/>
      <parameter type-id='type-id-338' name='next'/>
      <parameter type-id='type-id-338' name='remainder'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_record_can_use_length_hiding' mangled-name='gnutls_record_can_use_length_hiding' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_can_use_length_hiding@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_gnutls_log' mangled-name='_gnutls_log' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_tlen_int' mangled-name='_gnutls_send_tlen_int' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_data_mtu' mangled-name='gnutls_dtls_get_data_mtu' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_epoch_get' mangled-name='_gnutls_epoch_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-261'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-239'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-240'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-263'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-277'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-276'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-253'>
      <parameter type-id='type-id-155'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-243'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-259'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-255'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-117'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-113'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-257'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-62'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-245'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-332'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-112'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-121'>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-112'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-119'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-112'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='record.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <class-decl name='hello_ext_entry_st' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_struct' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tls_id' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gid' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='parse_type' type-id='type-id-339' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='validity' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recv_func' type-id='type-id-340' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_func' type-id='type-id-341' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='deinit_func' type-id='type-id-342' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pack_func' type-id='type-id-343' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unpack_func' type-id='type-id-344' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cannot_be_overriden' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-345'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_EXT_ANY' value='0'/>
      <enumerator name='GNUTLS_EXT_APPLICATION' value='1'/>
      <enumerator name='GNUTLS_EXT_TLS' value='2'/>
      <enumerator name='GNUTLS_EXT_MANDATORY' value='3'/>
      <enumerator name='GNUTLS_EXT_NONE' value='4'/>
      <enumerator name='GNUTLS_EXT_VERSION_NEG' value='5'/>
    </enum-decl>
    <typedef-decl name='gnutls_ext_parse_type_t' type-id='type-id-345' id='type-id-339'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-346'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <typedef-decl name='gnutls_ext_recv_func' type-id='type-id-349' id='type-id-340'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-350'/>
    <typedef-decl name='gnutls_buffer_t' type-id='type-id-350' id='type-id-351'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-353'/>
    <typedef-decl name='gnutls_ext_send_func' type-id='type-id-353' id='type-id-341'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <typedef-decl name='gnutls_ext_deinit_data_func' type-id='type-id-355' id='type-id-342'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <typedef-decl name='gnutls_ext_pack_func' type-id='type-id-357' id='type-id-343'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <typedef-decl name='gnutls_ext_unpack_func' type-id='type-id-360' id='type-id-344'/>
    <function-decl name='gnutls_record_set_timeout' mangled-name='gnutls_record_set_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_set_timeout@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-10' name='ms'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_record_recv_seq' mangled-name='gnutls_record_recv_seq' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_recv_seq@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='data'/>
      <parameter type-id='type-id-100' name='data_size'/>
      <parameter type-id='type-id-64' name='seq'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_record_recv' mangled-name='gnutls_record_recv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_recv@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='data'/>
      <parameter type-id='type-id-100' name='data_size'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_record_uncork' mangled-name='gnutls_record_uncork' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_uncork@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-10' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_record_cork' mangled-name='gnutls_record_cork' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_cork@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_record_recv_early_data' mangled-name='gnutls_record_recv_early_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_recv_early_data@@GNUTLS_3_6_5'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='data'/>
      <parameter type-id='type-id-100' name='data_size'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_record_send_early_data' mangled-name='gnutls_record_send_early_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_send_early_data@@GNUTLS_3_6_5'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='data'/>
      <parameter type-id='type-id-100' name='data_size'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_record_send2' mangled-name='gnutls_record_send2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_send2@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='data'/>
      <parameter type-id='type-id-100' name='data_size'/>
      <parameter type-id='type-id-100' name='pad'/>
      <parameter type-id='type-id-10' name='flags'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_record_send' mangled-name='gnutls_record_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_send@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='data'/>
      <parameter type-id='type-id-100' name='data_size'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='gnutls_packet_t' type-id='type-id-184' id='type-id-361'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-362'/>
    <function-decl name='gnutls_record_recv_packet' mangled-name='gnutls_record_recv_packet' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_recv_packet@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-362' name='packet'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_record_discard_queued' mangled-name='gnutls_record_discard_queued' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_discard_queued@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='gnutls_packet_deinit' mangled-name='gnutls_packet_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_packet_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-361' name='packet'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_packet_get' mangled-name='gnutls_packet_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_packet_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-361' name='packet'/>
      <parameter type-id='type-id-276' name='data'/>
      <parameter type-id='type-id-64' name='sequence'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-363'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_SHUT_RDWR' value='0'/>
      <enumerator name='GNUTLS_SHUT_WR' value='1'/>
    </enum-decl>
    <typedef-decl name='gnutls_close_request_t' type-id='type-id-363' id='type-id-364'/>
    <function-decl name='gnutls_bye' mangled-name='gnutls_bye' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_bye@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-364' name='how'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_transport_get_int' mangled-name='gnutls_transport_get_int' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_get_int@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-365'/>
    <function-decl name='gnutls_transport_get_int2' mangled-name='gnutls_transport_get_int2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_get_int2@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-365' name='recv_int'/>
      <parameter type-id='type-id-365' name='send_int'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-366'/>
    <function-decl name='gnutls_transport_get_ptr2' mangled-name='gnutls_transport_get_ptr2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_get_ptr2@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-366' name='recv_ptr'/>
      <parameter type-id='type-id-366' name='send_ptr'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_transport_get_ptr' mangled-name='gnutls_transport_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_get_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-decl name='gnutls_transport_set_int2' mangled-name='gnutls_transport_set_int2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_set_int2@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-22' name='recv_fd'/>
      <parameter type-id='type-id-22' name='send_fd'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_transport_set_ptr2' mangled-name='gnutls_transport_set_ptr2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_set_ptr2@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-155' name='recv_ptr'/>
      <parameter type-id='type-id-155' name='send_ptr'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_transport_set_ptr' mangled-name='gnutls_transport_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_set_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-155' name='ptr'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_record_disable_padding' mangled-name='gnutls_record_disable_padding' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_disable_padding@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_head_get_first' mangled-name='_mbuffer_head_get_first' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_head_remove_bytes' mangled-name='_mbuffer_head_remove_bytes' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_buffer_append_data' mangled-name='gnutls_buffer_append_data' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_session_key_update' mangled-name='gnutls_session_key_update' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_clear' mangled-name='_gnutls_buffer_clear' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_record_get_max_size' mangled-name='gnutls_record_get_max_size' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_record_overhead_size' mangled-name='gnutls_record_overhead_size' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_head_clear' mangled-name='_mbuffer_head_clear' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='__assert_fail' mangled-name='__assert_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_uint64pp' mangled-name='_gnutls_uint64pp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_uint48pp' mangled-name='_gnutls_uint48pp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_enqueue' mangled-name='_mbuffer_enqueue' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_packet2str' mangled-name='_gnutls_packet2str' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_audit_log' mangled-name='_gnutls_audit_log' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_io_read_buffered' mangled-name='_gnutls_io_read_buffered' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_error_is_fatal' mangled-name='gnutls_error_is_fatal' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_linearize_align16' mangled-name='_mbuffer_linearize_align16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='nanosleep' mangled-name='nanosleep' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_timespec_sub_ms' mangled-name='_gnutls_timespec_sub_ms' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_dtls_transmit' mangled-name='_dtls_transmit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_record_buffer_put' mangled-name='_gnutls_record_buffer_put' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_dtls_async_timer_delete' mangled-name='_dtls_async_timer_delete' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_heartbeat_handle' mangled-name='_gnutls_heartbeat_handle' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_async_handshake' mangled-name='_gnutls13_recv_async_handshake' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_name' mangled-name='gnutls_alert_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_alloc_align16' mangled-name='_mbuffer_alloc_align16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_decrypt' mangled-name='_gnutls_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_dtls_record_check' mangled-name='_dtls_record_check' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_head_pop_first' mangled-name='_mbuffer_head_pop_first' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_encrypt' mangled-name='_gnutls_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_io_write_buffered' mangled-name='_gnutls_io_write_buffered' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_io_write_flush' mangled-name='_gnutls_io_write_flush' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_dtls_get_mtu' mangled-name='gnutls_dtls_get_mtu' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_alert_send' mangled-name='gnutls_alert_send' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_record_buffer_get' mangled-name='_gnutls_record_buffer_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_record_buffer_get_packet' mangled-name='_gnutls_record_buffer_get_packet' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='time' mangled-name='time' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_handshake' mangled-name='gnutls_handshake' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_reauth' mangled-name='gnutls_reauth' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-359'>
      <parameter type-id='type-id-351'/>
      <parameter type-id='type-id-358'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-356'>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-348'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-347'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-352'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-351'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-354'>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-112'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='compress.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-367'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_COMP_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_COMP_NULL' value='1'/>
      <enumerator name='GNUTLS_COMP_DEFLATE' value='2'/>
      <enumerator name='GNUTLS_COMP_ZLIB' value='2'/>
    </enum-decl>
    <typedef-decl name='gnutls_compression_method_t' type-id='type-id-367' id='type-id-368'/>
    <qualified-type-def type-id='type-id-368' const='yes' id='type-id-369'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-370'/>
    <function-decl name='gnutls_compression_list' mangled-name='gnutls_compression_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_list@@GNUTLS_3_4'>
      <return type-id='type-id-370'/>
    </function-decl>
    <function-decl name='gnutls_compression_get_id' mangled-name='gnutls_compression_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-27' name='name'/>
      <return type-id='type-id-368'/>
    </function-decl>
    <function-decl name='gnutls_compression_get_name' mangled-name='gnutls_compression_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_compression_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-368' name='algorithm'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='c_strcasecmp' mangled-name='c_strcasecmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='debug.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_handshake_description_get_name' mangled-name='gnutls_handshake_description_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_description_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-187' name='type'/>
      <return type-id='type-id-27'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='cipher.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='_gnutls_auth_cipher_add_auth' mangled-name='_gnutls_auth_cipher_add_auth' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_decrypt2' mangled-name='_gnutls_auth_cipher_decrypt2' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_tag' mangled-name='_gnutls_auth_cipher_tag' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_memcmp' mangled-name='gnutls_memcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='nettle_memxor' mangled-name='nettle_memxor' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='cbc_mac_verify' mangled-name='cbc_mac_verify' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_decrypt' mangled-name='gnutls_aead_cipher_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_rnd' mangled-name='gnutls_rnd' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_auth_cipher_encrypt2_tag' mangled-name='_gnutls_auth_cipher_encrypt2_tag' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_aead_cipher_encryptv' mangled-name='gnutls_aead_cipher_encryptv' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='handshake-tls13.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <class-decl name='gnutls_session_int' size-in-bits='52416' is-struct='yes' visibility='default' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security_parameters' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='record_parameters' type-id='type-id-6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='internals' type-id='type-id-372' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30080'>
        <var-decl name='key' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='27776' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-372' visibility='default' id='type-id-373'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handshake_hash_buffer_prev_len' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='handshake_hash_buffer_client_hello_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='handshake_hash_buffer_client_kx_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='handshake_hash_buffer_server_finished_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handshake_hash_buffer_client_finished_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handshake_hash_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resumable' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='ticket_state' type-id='type-id-141' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bye_state' type-id='type-id-142' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reauth_state' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='handshake_final_state' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='handshake_state' type-id='type-id-144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='invalid_connection' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='904'>
        <var-decl name='may_not_read' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='may_not_write' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='920'>
        <var-decl name='read_eof' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='last_alert' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='last_handshake_in' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='last_handshake_out' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='priorities' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='allow_large_records' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1096'>
        <var-decl name='allow_small_records' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='no_etm' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1112'>
        <var-decl name='no_ext_master_secret' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='allow_key_usage_violation' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1128'>
        <var-decl name='allow_wrong_pms' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='dumbfw' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_prime_bits' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='resumed' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1176'>
        <var-decl name='resumption_requested' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='resumed_security_parameters' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='resumption_data' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='handshake_send_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='handshake_header_recv_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='handshake_recv_buffer' type-id='type-id-146' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='handshake_recv_buffer_size' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='record_recv_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='record_send_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='record_send_buffer_user_size' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='early_data_recv_buffer' type-id='type-id-139' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='early_data_presend_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='rsend_state' type-id='type-id-147' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='record_key_update_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='record_presend_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='reauth_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='expire_time' type-id='type-id-17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='auth_struct' type-id='type-id-148' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='adv_version_major' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9480'>
        <var-decl name='adv_version_minor' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9504'>
        <var-decl name='send_cert_req' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='max_handshake_data_buffer_size' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='pull_timeout_func' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='pull_func' type-id='type-id-151' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='push_func' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='vec_push_func' type-id='type-id-153' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9856'>
        <var-decl name='errno_func' type-id='type-id-154' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='transport_recv_ptr' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='transport_send_ptr' type-id='type-id-155' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='db_store_func' type-id='type-id-156' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='db_retrieve_func' type-id='type-id-157' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='db_remove_func' type-id='type-id-158' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='db_ptr' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='user_hello_func' type-id='type-id-159' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='h_hook' type-id='type-id-160' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10432'>
        <var-decl name='h_type' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10464'>
        <var-decl name='h_post' type-id='type-id-161' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10496'>
        <var-decl name='selected_cert_list' type-id='type-id-162' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='selected_cert_list_length' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='selected_key' type-id='type-id-374' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='selected_ocsp' type-id='type-id-164' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='selected_ocsp_length' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='selected_ocsp_func' type-id='type-id-165' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='selected_ocsp_func_ptr' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='selected_need_free' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10952'>
        <var-decl name='default_record_version' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10968'>
        <var-decl name='default_hello_version' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='user_ptr' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='direction' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11080'>
        <var-decl name='ignore_rdn_sequence' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11088'>
        <var-decl name='rsa_pms_version' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11104'>
        <var-decl name='errnum' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='initial_negotiation_completed' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='post_negotiation_lock' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='transport' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='dtls' type-id='type-id-167' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11904'>
        <var-decl name='handshake_suspicious_loops' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11936'>
        <var-decl name='handshake_in_progress' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11944'>
        <var-decl name='premaster_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11968'>
        <var-decl name='cb_tls_unique_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12000'>
        <var-decl name='cb_tls_unique' type-id='type-id-168' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12288'>
        <var-decl name='handshake_start_time' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12416'>
        <var-decl name='handshake_abs_timeout' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12544'>
        <var-decl name='ertt' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12576'>
        <var-decl name='handshake_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='record_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12672'>
        <var-decl name='post_handshake_cr_context' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12800'>
        <var-decl name='post_handshake_hash_buffer' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13056'>
        <var-decl name='hsk_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13120'>
        <var-decl name='last_key_update' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13248'>
        <var-decl name='key_update_count' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13312'>
        <var-decl name='full_client_hello' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13568'>
        <var-decl name='extensions_offset' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13632'>
        <var-decl name='hb_local_data' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13888'>
        <var-decl name='hb_remote_data' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14144'>
        <var-decl name='hb_ping_start' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14272'>
        <var-decl name='hb_ping_sent' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14400'>
        <var-decl name='hb_actual_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14432'>
        <var-decl name='hb_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14464'>
        <var-decl name='hb_total_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14496'>
        <var-decl name='ocsp_check_ok' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14528'>
        <var-decl name='hb_state' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14560'>
        <var-decl name='recv_state' type-id='type-id-171' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14592'>
        <var-decl name='sc_random_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14656'>
        <var-decl name='flags' type-id='type-id-80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14720'>
        <var-decl name='verify_callback' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14784'>
        <var-decl name='vc_data' type-id='type-id-173' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14848'>
        <var-decl name='vc_sdata' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15040'>
        <var-decl name='vc_elements' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15072'>
        <var-decl name='vc_status' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15104'>
        <var-decl name='additional_verify_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15136'>
        <var-decl name='cert_hash' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15392'>
        <var-decl name='cert_hash_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15400'>
        <var-decl name='saved_username' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16432'>
        <var-decl name='saved_username_set' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16448'>
        <var-decl name='tfo' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17664'>
        <var-decl name='rsup' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17728'>
        <var-decl name='rsup_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17792'>
        <var-decl name='rexts' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17856'>
        <var-decl name='rexts_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17920'>
        <var-decl name='ext_data' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24064'>
        <var-decl name='used_exts' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24096'>
        <var-decl name='ext_msg' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24128'>
        <var-decl name='max_recv_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24192'>
        <var-decl name='cand_ec_group' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24256'>
        <var-decl name='cand_dh_group' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24320'>
        <var-decl name='cand_group' type-id='type-id-20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24384'>
        <var-decl name='hrr_cs' type-id='type-id-166' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24416'>
        <var-decl name='session_ticket_renew' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24448'>
        <var-decl name='tls13_ticket' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27584'>
        <var-decl name='early_data_received' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='anti_replay' type-id='type-id-182' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27712'>
        <var-decl name='epoch_lock' type-id='type-id-102' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pubkey_st' size-in-bits='4032' is-struct='yes' visibility='default' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='params' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='key_usage' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='pin' type-id='type-id-375' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pin_info_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb' type-id='type-id-376' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-102' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-377'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <typedef-decl name='gnutls_pin_callback_t' type-id='type-id-379' id='type-id-376'/>
    <class-decl name='gnutls_privkey_st' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pk_algorithm' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-382' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pin' type-id='type-id-375' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-383'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_PRIVKEY_X509' value='0'/>
      <enumerator name='GNUTLS_PRIVKEY_OPENPGP' value='1'/>
      <enumerator name='GNUTLS_PRIVKEY_PKCS11' value='2'/>
      <enumerator name='GNUTLS_PRIVKEY_EXT' value='3'/>
    </enum-decl>
    <typedef-decl name='gnutls_privkey_type_t' type-id='type-id-383' id='type-id-381'/>
    <union-decl name='__anonymous_union__' size-in-bits='576' is-anonymous='yes' visibility='default' id='type-id-382'>
      <data-member access='private'>
        <var-decl name='x509' type-id='type-id-384' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pkcs11' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ext' type-id='type-id-386' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='gnutls_x509_privkey_int' size-in-bits='4032' is-struct='yes' visibility='default' id='type-id-387'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='expanded' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='key' type-id='type-id-388' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='pin' type-id='type-id-375' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-389'/>
    <typedef-decl name='asn1_node_st' type-id='type-id-389' id='type-id-390'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <typedef-decl name='asn1_node' type-id='type-id-391' id='type-id-388'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-392'/>
    <typedef-decl name='gnutls_x509_privkey_t' type-id='type-id-392' id='type-id-384'/>
    <class-decl name='gnutls_pkcs11_privkey_st' size-in-bits='3392' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-393'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <typedef-decl name='gnutls_pkcs11_privkey_t' type-id='type-id-394' id='type-id-385'/>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-386'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sign_func' type-id='type-id-395' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sign_data_func' type-id='type-id-396' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sign_hash_func' type-id='type-id-397' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt_func' type-id='type-id-398' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='decrypt_func2' type-id='type-id-399' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit_func' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='info_func' type-id='type-id-401' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='userdata' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bits' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-374'/>
    <typedef-decl name='gnutls_privkey_t' type-id='type-id-374' id='type-id-402'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <typedef-decl name='gnutls_privkey_sign_func' type-id='type-id-404' id='type-id-395'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-406'/>
    <typedef-decl name='gnutls_privkey_sign_data_func' type-id='type-id-406' id='type-id-396'/>
    <typedef-decl name='gnutls_privkey_sign_hash_func' type-id='type-id-406' id='type-id-397'/>
    <typedef-decl name='gnutls_privkey_decrypt_func' type-id='type-id-404' id='type-id-398'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-408'/>
    <typedef-decl name='gnutls_privkey_decrypt_func2' type-id='type-id-408' id='type-id-399'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-410'/>
    <typedef-decl name='gnutls_privkey_deinit_func' type-id='type-id-410' id='type-id-400'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-412'/>
    <typedef-decl name='gnutls_privkey_info_func' type-id='type-id-412' id='type-id-401'/>
    <typedef-decl name='internals_st' type-id='type-id-373' id='type-id-372'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-413'/>
    <typedef-decl name='gnutls_session_t' type-id='type-id-413' id='type-id-414'/>
    <function-decl name='gnutls_session_ticket_send' mangled-name='gnutls_session_ticket_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ticket_send@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-414' name='session'/>
      <parameter type-id='type-id-10' name='nr'/>
      <parameter type-id='type-id-10' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls13_send_session_ticket' mangled-name='_gnutls13_send_session_ticket' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_init' mangled-name='_gnutls_buffer_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_io_recv_int' mangled-name='_gnutls_handshake_io_recv_int' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_call_hook_func' mangled-name='_gnutls_call_hook_func' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_session_ticket' mangled-name='_gnutls13_recv_session_ticket' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_key_update' mangled-name='_gnutls13_recv_key_update' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_compute_finished' mangled-name='_gnutls13_compute_finished' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_tls13_derive_secret' mangled-name='_tls13_derive_secret' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_server_hello' mangled-name='_gnutls_send_server_hello' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_tls13_read_connection_state_init' mangled-name='_tls13_read_connection_state_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_epoch_dup' mangled-name='_gnutls_epoch_dup' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_tls13_write_connection_state_init' mangled-name='_tls13_write_connection_state_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_encrypted_extensions' mangled-name='_gnutls13_send_encrypted_extensions' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_certificate_request' mangled-name='_gnutls13_send_certificate_request' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_certificate' mangled-name='_gnutls13_send_certificate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_certificate_verify' mangled-name='_gnutls13_send_certificate_verify' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_finished' mangled-name='_gnutls13_send_finished' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_end_of_early_data' mangled-name='_gnutls13_recv_end_of_early_data' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_certificate' mangled-name='_gnutls13_recv_certificate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_certificate_verify' mangled-name='_gnutls13_recv_certificate_verify' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_run_verify_callback' mangled-name='_gnutls_run_verify_callback' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_finished' mangled-name='_gnutls13_recv_finished' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_handshake' mangled-name='_gnutls_recv_handshake' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_tls13_connection_state_init' mangled-name='_tls13_connection_state_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_change_cipher_spec' mangled-name='_gnutls_send_change_cipher_spec' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_hash_buffers_clear' mangled-name='_gnutls_handshake_hash_buffers_clear' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_hello_retry_request' mangled-name='_gnutls13_send_hello_retry_request' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_handshake_hash_buffers_synth' mangled-name='_gnutls13_handshake_hash_buffers_synth' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_set_resumed_parameters' mangled-name='_gnutls_set_resumed_parameters' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_tls13_update_secret' mangled-name='_tls13_update_secret' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_nss_keylog_write' mangled-name='_gnutls_nss_keylog_write' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_early_data' mangled-name='_gnutls13_send_early_data' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_encrypted_extensions' mangled-name='_gnutls13_recv_encrypted_extensions' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_certificate_request' mangled-name='_gnutls13_recv_certificate_request' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_send_end_of_early_data' mangled-name='_gnutls13_send_end_of_early_data' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-405'>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-276'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-411'>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-403'>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-276'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-407'>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-378'>
      <parameter type-id='type-id-102'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-377'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-22'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-409'>
      <parameter type-id='type-id-402'/>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-112'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='buffers.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_record_check_corked' mangled-name='gnutls_record_check_corked' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_corked@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='gnutls_record_check_pending' mangled-name='gnutls_record_check_pending' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_check_pending@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='_gnutls_recv_in_buffers' mangled-name='_gnutls_recv_in_buffers' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_head_push_first' mangled-name='_mbuffer_head_push_first' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_resize' mangled-name='_gnutls_buffer_resize' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_head_get_next' mangled-name='_mbuffer_head_get_next' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_dequeue' mangled-name='_mbuffer_dequeue' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='qsort' mangled-name='qsort' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_handshake_description_get_name' mangled-name='gnutls_handshake_description_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='handshake.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_handshake_get_last_out' mangled-name='gnutls_handshake_get_last_out' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_get_last_out@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='gnutls_handshake_get_last_in' mangled-name='gnutls_handshake_get_last_in' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_get_last_in@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='gnutls_handshake_set_max_packet_length' mangled-name='gnutls_handshake_set_max_packet_length' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_set_max_packet_length@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <parameter type-id='type-id-100' name='max'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_handshake_set_timeout' mangled-name='gnutls_handshake_set_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_set_timeout@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <parameter type-id='type-id-10' name='ms'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_handshake' mangled-name='gnutls_handshake' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_rehandshake' mangled-name='gnutls_rehandshake' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_rehandshake@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_hash_fast' mangled-name='_gnutls_hash_fast' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_set_datum' mangled-name='_gnutls_set_datum' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_int' mangled-name='_gnutls_recv_int' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_read_connection_state_init' mangled-name='_gnutls_read_connection_state_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_record_check_pending' mangled-name='gnutls_record_check_pending' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_dtls_wait_and_retransmit' mangled-name='_dtls_wait_and_retransmit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_connection_state_init' mangled-name='_gnutls_connection_state_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_write_connection_state_init' mangled-name='_gnutls_write_connection_state_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_version_to_entry' mangled-name='_gnutls_version_to_entry' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_version_lowest' mangled-name='_gnutls_version_lowest' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_version_max' mangled-name='_gnutls_version_max' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_data_prefix' mangled-name='_gnutls_buffer_append_data_prefix' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_get_client_ciphersuites' mangled-name='_gnutls_get_client_ciphersuites' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_gen_hello_extensions' mangled-name='_gnutls_gen_hello_extensions' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_legacy_version_max' mangled-name='_gnutls_legacy_version_max' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_kx_allows_false_start' mangled-name='_gnutls_kx_allows_false_start' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_handshake_client' mangled-name='_gnutls13_handshake_client' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_new_session_ticket' mangled-name='_gnutls_recv_new_session_ticket' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_client_certificate' mangled-name='_gnutls_send_client_certificate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_client_kx_message' mangled-name='_gnutls_send_client_kx_message' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_server_crt_request' mangled-name='_gnutls_recv_server_crt_request' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_client_certificate_verify' mangled-name='_gnutls_send_client_certificate_verify' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_server_certificate_status' mangled-name='_gnutls_recv_server_certificate_status' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_server_kx_message' mangled-name='_gnutls_recv_server_kx_message' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_server_certificate' mangled-name='_gnutls_recv_server_certificate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_ext_sr_verify' mangled-name='_gnutls_ext_sr_verify' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_timeouts' mangled-name='gnutls_dtls_set_timeouts' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_epoch_setup_next' mangled-name='_gnutls_epoch_setup_next' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_new_session_ticket' mangled-name='_gnutls_send_new_session_ticket' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_server_register_current_session' mangled-name='_gnutls_server_register_current_session' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_server_crt_request' mangled-name='_gnutls_send_server_crt_request' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_check_id_for_change' mangled-name='_gnutls_check_id_for_change' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_client_certificate' mangled-name='_gnutls_recv_client_certificate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_handshake_server' mangled-name='_gnutls13_handshake_server' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_server_certificate' mangled-name='_gnutls_send_server_certificate' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_server_kx_message' mangled-name='_gnutls_send_server_kx_message' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_client_certificate_verify_message' mangled-name='_gnutls_recv_client_certificate_verify_message' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_recv_client_kx_message' mangled-name='_gnutls_recv_client_kx_message' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_server_certificate_status' mangled-name='_gnutls_send_server_certificate_status' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_alert_get' mangled-name='gnutls_alert_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_dtls_reset_hsk_state' mangled-name='_dtls_reset_hsk_state' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_epoch_gc' mangled-name='_gnutls_epoch_gc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_internal_state_clear' mangled-name='_gnutls_handshake_internal_state_clear' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_parse_supplemental' mangled-name='_gnutls_parse_supplemental' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_gen_supplemental' mangled-name='_gnutls_gen_supplemental' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_prefix' mangled-name='_gnutls_buffer_append_prefix' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_bin2hex' mangled-name='_gnutls_bin2hex' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls13_recv_hello_retry_request' mangled-name='_gnutls13_recv_hello_retry_request' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_get_cred' mangled-name='_gnutls_get_cred' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_set_cipher_suite2' mangled-name='_gnutls_set_cipher_suite2' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_get_kx_cred' mangled-name='_gnutls_get_kx_cred' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_kx_auth_struct' mangled-name='_gnutls_kx_auth_struct' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_cipher_to_entry' mangled-name='_gnutls_cipher_to_entry' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='nversion_to_entry' mangled-name='nversion_to_entry' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_parse_hello_extensions' mangled-name='_gnutls_parse_hello_extensions' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_nversion_is_supported' mangled-name='_gnutls_nversion_is_supported' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_memset' mangled-name='gnutls_memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='reset_binders' mangled-name='reset_binders' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_tls13_init_secret' mangled-name='_tls13_init_secret' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_server_restore_session' mangled-name='_gnutls_server_restore_session' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_ext_set_full_client_hello' mangled-name='_gnutls_ext_set_full_client_hello' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_read_client_hello_v2' mangled-name='_gnutls_read_client_hello_v2' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_io_cache_int' mangled-name='_gnutls_handshake_io_cache_int' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_io_write_flush' mangled-name='_gnutls_handshake_io_write_flush' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_generate_early_secrets_for_psk' mangled-name='_gnutls_generate_early_secrets_for_psk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='ciphersuite_to_entry' mangled-name='ciphersuite_to_entry' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_ext_sr_recv_cs' mangled-name='_gnutls_ext_sr_recv_cs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_figure_common_ciphersuite' mangled-name='_gnutls_figure_common_ciphersuite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_ext_sr_finished' mangled-name='_gnutls_ext_sr_finished' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_map_kx_get_cred' mangled-name='_gnutls_map_kx_get_cred' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_kx_get' mangled-name='gnutls_kx_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_version_is_too_high' mangled-name='_gnutls_version_is_too_high' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_prf_raw' mangled-name='_gnutls_prf_raw' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_hash_fast' mangled-name='gnutls_hash_fast' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_mbuffer_alloc' mangled-name='_mbuffer_alloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_auth_client_get_type' mangled-name='gnutls_auth_client_get_type' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_check_if_cert_hash_is_same' mangled-name='_gnutls_check_if_cert_hash_is_same' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_auth_server_get_type' mangled-name='gnutls_auth_server_get_type' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='errors.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='_gnutls_log' mangled-name='_gnutls_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_log@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-22' name='level'/>
      <parameter type-id='type-id-27' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_log' mangled-name='_gnutls_mpi_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_mpi_log@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-27' name='prefix'/>
      <parameter type-id='type-id-319' name='a'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_strerror_name' mangled-name='gnutls_strerror_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-22' name='error'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='gnutls_perror' mangled-name='gnutls_perror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_perror@@GNUTLS_3_4'>
      <parameter type-id='type-id-22' name='error'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_error_is_fatal' mangled-name='gnutls_error_is_fatal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_is_fatal@@GNUTLS_3_4'>
      <parameter type-id='type-id-22' name='error'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_strerror' mangled-name='gnutls_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror@@GNUTLS_3_4'>
      <parameter type-id='type-id-22' name='error'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='vasprintf' mangled-name='vasprintf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='fprintf' mangled-name='fprintf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dh.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <class-decl name='gnutls_dh_params_int' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-415'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-416' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='q_bits' type-id='type-id-22' visibility='default'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-319' size-in-bits='192' id='type-id-416'>
      <subrange length='3' type-id='type-id-38' id='type-id-417'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-418'/>
    <typedef-decl name='gnutls_dh_params_t' type-id='type-id-418' id='type-id-419'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-420'/>
    <function-decl name='gnutls_dh_params_export_raw' mangled-name='gnutls_dh_params_export_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='params'/>
      <parameter type-id='type-id-276' name='prime'/>
      <parameter type-id='type-id-276' name='generator'/>
      <parameter type-id='type-id-420' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-421'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <typedef-decl name='gnutls_x509_crt_fmt_t' type-id='type-id-421' id='type-id-422'/>
    <function-decl name='gnutls_dh_params_export2_pkcs3' mangled-name='gnutls_dh_params_export2_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export2_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='params'/>
      <parameter type-id='type-id-422' name='format'/>
      <parameter type-id='type-id-276' name='out'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-423'/>
    <function-decl name='gnutls_dh_params_export_pkcs3' mangled-name='gnutls_dh_params_export_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_export_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='params'/>
      <parameter type-id='type-id-422' name='format'/>
      <parameter type-id='type-id-64' name='params_data'/>
      <parameter type-id='type-id-423' name='params_data_size'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_pkcs3' mangled-name='gnutls_dh_params_import_pkcs3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_pkcs3@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='params'/>
      <parameter type-id='type-id-57' name='pkcs3_params'/>
      <parameter type-id='type-id-422' name='format'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_generate2' mangled-name='gnutls_dh_params_generate2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_generate2@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='dparams'/>
      <parameter type-id='type-id-10' name='bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_cpy' mangled-name='gnutls_dh_params_cpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_cpy@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='dst'/>
      <parameter type-id='type-id-419' name='src'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_deinit' mangled-name='gnutls_dh_params_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='dh_params'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-424'/>
    <function-decl name='gnutls_dh_params_init' mangled-name='gnutls_dh_params_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-424' name='dh_params'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw3' mangled-name='gnutls_dh_params_import_raw3' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw3@@GNUTLS_3_6_8'>
      <parameter type-id='type-id-419' name='dh_params'/>
      <parameter type-id='type-id-57' name='prime'/>
      <parameter type-id='type-id-57' name='q'/>
      <parameter type-id='type-id-57' name='generator'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw2' mangled-name='gnutls_dh_params_import_raw2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw2@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='dh_params'/>
      <parameter type-id='type-id-57' name='prime'/>
      <parameter type-id='type-id-57' name='generator'/>
      <parameter type-id='type-id-10' name='key_bits'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_dsa' mangled-name='gnutls_dh_params_import_dsa' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_dsa@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='dh_params'/>
      <parameter type-id='type-id-384' name='key'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_dh_params_import_raw' mangled-name='gnutls_dh_params_import_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dh_params_import_raw@@GNUTLS_3_4'>
      <parameter type-id='type-id-419' name='dh_params'/>
      <parameter type-id='type-id-57' name='prime'/>
      <parameter type-id='type-id-57' name='generator'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_dprint' mangled-name='_gnutls_mpi_dprint' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_x509_der_encode' mangled-name='_gnutls_x509_der_encode' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='asn1_delete_structure' mangled-name='asn1_delete_structure' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_fbase64_encode' mangled-name='_gnutls_fbase64_encode' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='asn1_create_element' mangled-name='asn1_create_element' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_asn2err' mangled-name='_gnutls_asn2err' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='asn1_write_value' mangled-name='asn1_write_value' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_x509_write_uint32' mangled-name='_gnutls_x509_write_uint32' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='asn1_der_decoding' mangled-name='asn1_der_decoding' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_x509_read_uint' mangled-name='_gnutls_x509_read_uint' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_x509_read_int' mangled-name='_gnutls_x509_read_int' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_fbase64_decode' mangled-name='_gnutls_fbase64_decode' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_pk_params_init' mangled-name='gnutls_pk_params_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_mpi_init_scan_nz' mangled-name='_gnutls_mpi_init_scan_nz' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_x509_privkey_export_dsa_raw' mangled-name='gnutls_x509_privkey_export_dsa_raw' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_sec_param_to_pk_bits' mangled-name='gnutls_sec_param_to_pk_bits' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_pk_params_release' mangled-name='gnutls_pk_params_release' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_dh_save_group' mangled-name='_gnutls_dh_save_group' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='kx.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='_gnutls_session_is_psk' mangled-name='_gnutls_session_is_psk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_send_handshake' mangled-name='_gnutls_send_handshake' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_get_session_hash' mangled-name='_gnutls_handshake_get_session_hash' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' mangled-name='pthread_mutex_unlock' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='secure_getenv' mangled-name='secure_getenv' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='cipher-cbc.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='_gnutls_make_preamble' mangled-name='_gnutls_make_preamble' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='priority.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <var-decl name='_gnutls_default_priority_string' type-id='type-id-27' mangled-name='_gnutls_default_priority_string' visibility='default' elf-symbol-id='_gnutls_default_priority_string@@GNUTLS_PRIVATE_3_4'/>
    <function-decl name='gnutls_priority_string_list' mangled-name='gnutls_priority_string_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_string_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-10' name='iter'/>
      <parameter type-id='type-id-10' name='flags'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <typedef-decl name='gnutls_priority_t' type-id='type-id-145' id='type-id-425'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-426'/>
    <function-decl name='gnutls_priority_certificate_type_list' mangled-name='gnutls_priority_certificate_type_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_certificate_type_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_sign_list' mangled-name='gnutls_priority_sign_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_sign_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_protocol_list' mangled-name='gnutls_priority_protocol_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_protocol_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_compression_list' mangled-name='gnutls_priority_compression_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_compression_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_mac_list' mangled-name='gnutls_priority_mac_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_mac_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_cipher_list' mangled-name='gnutls_priority_cipher_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_cipher_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_kx_list' mangled-name='gnutls_priority_kx_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_kx_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_group_list' mangled-name='gnutls_priority_group_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_group_list@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_ecc_curve_list' mangled-name='gnutls_priority_ecc_curve_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_ecc_curve_list@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-427'/>
    <function-decl name='gnutls_set_default_priority_append' mangled-name='gnutls_set_default_priority_append' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_set_default_priority_append@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-27' name='add_prio'/>
      <parameter type-id='type-id-427' name='err_pos'/>
      <parameter type-id='type-id-10' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_set_default_priority' mangled-name='gnutls_set_default_priority' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_set_default_priority@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_set_direct' mangled-name='gnutls_priority_set_direct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_set_direct@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-27' name='priorities'/>
      <parameter type-id='type-id-427' name='err_pos'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-428'/>
    <function-decl name='gnutls_priority_init' mangled-name='gnutls_priority_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_init@@GNUTLS_3_4'>
      <parameter type-id='type-id-428' name='priority_cache'/>
      <parameter type-id='type-id-27' name='priorities'/>
      <parameter type-id='type-id-427' name='err_pos'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_init2' mangled-name='gnutls_priority_init2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_init2@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-428' name='priority_cache'/>
      <parameter type-id='type-id-27' name='priorities'/>
      <parameter type-id='type-id-427' name='err_pos'/>
      <parameter type-id='type-id-10' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_resolve_priorities' mangled-name='_gnutls_resolve_priorities' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_resolve_priorities@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-27' name='priorities'/>
      <return type-id='type-id-377'/>
    </function-decl>
    <function-decl name='gnutls_get_system_config_file' mangled-name='gnutls_get_system_config_file' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_get_system_config_file@@GNUTLS_3_6_9'>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='gnutls_priority_set' mangled-name='gnutls_priority_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-425' name='priority'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_priority_deinit' mangled-name='gnutls_priority_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_deinit@@GNUTLS_3_4'>
      <parameter type-id='type-id-425' name='priority_cache'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-429'>
      <underlying-type type-id='type-id-41'/>
      <enumerator name='GNUTLS_CTYPE_CLIENT' value='0'/>
      <enumerator name='GNUTLS_CTYPE_SERVER' value='1'/>
      <enumerator name='GNUTLS_CTYPE_OURS' value='2'/>
      <enumerator name='GNUTLS_CTYPE_PEERS' value='3'/>
    </enum-decl>
    <typedef-decl name='gnutls_ctype_target_t' type-id='type-id-429' id='type-id-430'/>
    <function-decl name='gnutls_priority_certificate_type_list2' mangled-name='gnutls_priority_certificate_type_list2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_certificate_type_list2@@GNUTLS_3_6_4'>
      <parameter type-id='type-id-425' name='pcache'/>
      <parameter type-id='type-id-426' name='list'/>
      <parameter type-id='type-id-430' name='target'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_profile_to_sec_level' mangled-name='_gnutls_profile_to_sec_level' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_id_to_group' mangled-name='_gnutls_id_to_group' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='cipher_suite_get' mangled-name='cipher_suite_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_sign_to_entry' mangled-name='_gnutls_sign_to_entry' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_id' mangled-name='gnutls_mac_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='cipher_name_to_entry' mangled-name='cipher_name_to_entry' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_cipher_exists' mangled-name='_gnutls_cipher_exists' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_kx_get_id' mangled-name='_gnutls_kx_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='c_strncasecmp' mangled-name='c_strncasecmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_get_id' mangled-name='gnutls_ecc_curve_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='strncasecmp' mangled-name='strncasecmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_id' mangled-name='gnutls_protocol_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_id' mangled-name='gnutls_sign_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_group_get_id' mangled-name='gnutls_group_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get_id' mangled-name='gnutls_certificate_type_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_append_str' mangled-name='_gnutls_buffer_append_str' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='__xstat' mangled-name='__xstat' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='ini_parse' mangled-name='ini_parse' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_profile_get_id' mangled-name='_gnutls_profile_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='strtok_r' mangled-name='strtok_r' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_version_mark_disabled' mangled-name='_gnutls_version_mark_disabled' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_digest_mark_insecure' mangled-name='_gnutls_digest_mark_insecure' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_sign_mark_insecure' mangled-name='_gnutls_sign_mark_insecure' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_ecc_curve_mark_disabled' mangled-name='_gnutls_ecc_curve_mark_disabled' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_id' mangled-name='gnutls_cipher_get_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hash_int.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='_gnutls_digest_exists' mangled-name='_gnutls_digest_exists' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_digest_exists@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-212' name='algo'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_get_crypto_mac' mangled-name='_gnutls_get_crypto_mac' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_get_crypto_digest' mangled-name='_gnutls_get_crypto_digest' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='cipher_int.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='_gnutls_mac_deinit' mangled-name='_gnutls_mac_deinit' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_mac_init' mangled-name='_gnutls_mac_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_get_crypto_cipher' mangled-name='_gnutls_get_crypto_cipher' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='session.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_session_set_id' mangled-name='gnutls_session_set_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-57' name='sid'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_session_get_desc' mangled-name='gnutls_session_get_desc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_desc@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-377'/>
    </function-decl>
    <function-decl name='gnutls_session_force_valid' mangled-name='gnutls_session_force_valid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_force_valid@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_session_set_data' mangled-name='gnutls_session_set_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_data@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='session_data'/>
      <parameter type-id='type-id-100' name='session_data_size'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_session_get_id2' mangled-name='gnutls_session_get_id2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_id2@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-276' name='session_id'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_session_get_id' mangled-name='gnutls_session_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='session_id'/>
      <parameter type-id='type-id-423' name='session_id_size'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_session_get_data2' mangled-name='gnutls_session_get_data2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_data2@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-276' name='data'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_session_get_data' mangled-name='gnutls_session_get_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_data@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='session_data'/>
      <parameter type-id='type-id-423' name='session_data_size'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_sign_algorithm_get' mangled-name='gnutls_sign_algorithm_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_name' mangled-name='gnutls_sign_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_kx_get_name' mangled-name='gnutls_kx_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='snprintf' mangled-name='snprintf' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get_name' mangled-name='gnutls_certificate_type_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_protocol_get_name' mangled-name='gnutls_protocol_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_mac_get' mangled-name='gnutls_mac_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_name' mangled-name='gnutls_mac_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get' mangled-name='gnutls_cipher_get' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_cipher_get_name' mangled-name='gnutls_cipher_get_name' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_dh_get_prime_bits' mangled-name='gnutls_dh_get_prime_bits' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_session_unpack' mangled-name='_gnutls_session_unpack' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_session_pack' mangled-name='_gnutls_session_pack' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_session_is_resumed' mangled-name='gnutls_session_is_resumed' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='db.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_db_remove_session' mangled-name='gnutls_db_remove_session' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_remove_session@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_expire_time' mangled-name='gnutls_db_check_entry_expire_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_expire_time@@GNUTLS_3_6_5'>
      <parameter type-id='type-id-276' name='entry'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry_time' mangled-name='gnutls_db_check_entry_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry_time@@GNUTLS_3_4'>
      <parameter type-id='type-id-276' name='entry'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='gnutls_db_check_entry' mangled-name='gnutls_db_check_entry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_check_entry@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-62' name='session_entry'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_db_get_default_cache_expiration' mangled-name='gnutls_db_get_default_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_default_cache_expiration@@GNUTLS_3_4'>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_db_set_cache_expiration' mangled-name='gnutls_db_set_cache_expiration' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_cache_expiration@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-22' name='seconds'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_db_get_ptr' mangled-name='gnutls_db_get_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_get_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='gnutls_db_set_ptr' mangled-name='gnutls_db_set_ptr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_ptr@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-102' name='ptr'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_db_set_store_function' mangled-name='gnutls_db_set_store_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_store_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-156' name='store_func'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_db_set_remove_function' mangled-name='gnutls_db_set_remove_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_remove_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-158' name='rem_func'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_db_set_retrieve_function' mangled-name='gnutls_db_set_retrieve_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_db_set_retrieve_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-157' name='retr_func'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_session_set_data' mangled-name='gnutls_session_set_data' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_server_name_matches_resumed' mangled-name='_gnutls_server_name_matches_resumed' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='x509_b64.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_base64_encode2' mangled-name='gnutls_base64_encode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_base64_encode2@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-57' name='data'/>
      <parameter type-id='type-id-276' name='result'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_base64_decode2' mangled-name='gnutls_base64_decode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_base64_decode2@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-57' name='base64'/>
      <parameter type-id='type-id-276' name='result'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pem_base64_decode2' mangled-name='gnutls_pem_base64_decode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pem_base64_decode2@@GNUTLS_3_4'>
      <parameter type-id='type-id-27' name='header'/>
      <parameter type-id='type-id-57' name='b64_data'/>
      <parameter type-id='type-id-276' name='result'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pem_base64_decode' mangled-name='gnutls_pem_base64_decode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pem_base64_decode@@GNUTLS_3_4'>
      <parameter type-id='type-id-27' name='header'/>
      <parameter type-id='type-id-57' name='b64_data'/>
      <parameter type-id='type-id-64' name='result'/>
      <parameter type-id='type-id-423' name='result_size'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pem_base64_encode2' mangled-name='gnutls_pem_base64_encode2' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pem_base64_encode2@@GNUTLS_3_4'>
      <parameter type-id='type-id-27' name='header'/>
      <parameter type-id='type-id-57' name='b64_data'/>
      <parameter type-id='type-id-276' name='result'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_pem_base64_encode' mangled-name='gnutls_pem_base64_encode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pem_base64_encode@@GNUTLS_3_4'>
      <parameter type-id='type-id-27' name='msg'/>
      <parameter type-id='type-id-57' name='data'/>
      <parameter type-id='type-id-377' name='result'/>
      <parameter type-id='type-id-423' name='result_size'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='_gnutls_str_cpy' mangled-name='_gnutls_str_cpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_str_cat' mangled-name='_gnutls_str_cat' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='memmem' mangled-name='memmem' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='nettle_base64_decode_init' mangled-name='nettle_base64_decode_init' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='nettle_base64_decode_update' mangled-name='nettle_base64_decode_update' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='nettle_base64_decode_final' mangled-name='nettle_base64_decode_final' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='nettle_base64_encode_raw' mangled-name='nettle_base64_encode_raw' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hello_ext.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_ext_get_current_msg' mangled-name='gnutls_ext_get_current_msg' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ext_get_current_msg@@GNUTLS_3_6_3'>
      <parameter type-id='type-id-237' name='session'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_ext_get_data' mangled-name='gnutls_ext_get_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ext_get_data@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-10' name='tls_id'/>
      <parameter type-id='type-id-358' name='data'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_ext_set_data' mangled-name='gnutls_ext_set_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ext_set_data@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-10' name='tls_id'/>
      <parameter type-id='type-id-299' name='data'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='gnutls_session_ext_register' mangled-name='gnutls_session_ext_register' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_ext_register@@GNUTLS_3_4'>
      <parameter type-id='type-id-237' name='session'/>
      <parameter type-id='type-id-27' name='name'/>
      <parameter type-id='type-id-22' name='id'/>
      <parameter type-id='type-id-339' name='parse_type'/>
      <parameter type-id='type-id-340' name='recv_func'/>
      <parameter type-id='type-id-341' name='send_func'/>
      <parameter type-id='type-id-342' name='deinit_func'/>
      <parameter type-id='type-id-343' name='pack_func'/>
      <parameter type-id='type-id-344' name='unpack_func'/>
      <parameter type-id='type-id-10' name='flags'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_ext_register' mangled-name='gnutls_ext_register' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ext_register@@GNUTLS_3_4'>
      <parameter type-id='type-id-27' name='name'/>
      <parameter type-id='type-id-22' name='id'/>
      <parameter type-id='type-id-339' name='parse_type'/>
      <parameter type-id='type-id-340' name='recv_func'/>
      <parameter type-id='type-id-341' name='send_func'/>
      <parameter type-id='type-id-342' name='deinit_func'/>
      <parameter type-id='type-id-343' name='pack_func'/>
      <parameter type-id='type-id-344' name='unpack_func'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_ext_get_name' mangled-name='gnutls_ext_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ext_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-10' name='ext'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='_gnutls_buffer_pop_prefix32' mangled-name='_gnutls_buffer_pop_prefix32' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_extv_append' mangled-name='_gnutls_extv_append' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_extv_parse' mangled-name='_gnutls_extv_parse' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='auth.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='gnutls_auth_client_get_type' mangled-name='gnutls_auth_client_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_client_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-310'/>
    </function-decl>
    <function-decl name='gnutls_auth_server_get_type' mangled-name='gnutls_auth_server_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_server_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-310'/>
    </function-decl>
    <function-decl name='gnutls_auth_get_type' mangled-name='gnutls_auth_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-310'/>
    </function-decl>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-431'/>
    <function-decl name='gnutls_credentials_get' mangled-name='gnutls_credentials_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <parameter type-id='type-id-310' name='type'/>
      <parameter type-id='type-id-431' name='cred'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' mangled-name='gnutls_credentials_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <parameter type-id='type-id-310' name='type'/>
      <parameter type-id='type-id-102' name='cred'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnutls_credentials_clear' mangled-name='gnutls_credentials_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_clear@@GNUTLS_3_4'>
      <parameter type-id='type-id-414' name='session'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_free_dh_info' mangled-name='_gnutls_free_dh_info' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sslv2_compat.c' comp-dir-path='/home/nmavrogi/cvs/gnutls-mine/lib' language='LANG_C99'>
    <function-decl name='_gnutls_server_select_suite' mangled-name='_gnutls_server_select_suite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_negotiate_version' mangled-name='_gnutls_negotiate_version' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_user_hello_func' mangled-name='_gnutls_user_hello_func' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_set_client_random' mangled-name='_gnutls_set_client_random' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_gen_server_random' mangled-name='_gnutls_gen_server_random' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='_gnutls_generate_session_id' mangled-name='_gnutls_generate_session_id' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-112'/>
    </function-decl>
  </abi-instr>
