<abi-corpus architecture='elf-amd-x86_64' soname='libgnutls.so.30'>
  <elf-needed>
    <dependency name='libp11-kit.so.0'/>
    <dependency name='libidn2.so.0'/>
    <dependency name='libunistring.so.2'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libtasn1.so.6'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libhogweed.so.6'/>
    <dependency name='libgmp.so.10'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_dsa_generate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_generate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_g' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_dsa_validate_dss_pq' version='GNUTLS_FIPS140_3_4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='gnutls_ffdhe_6144_group_generator' size='16' version='GNUTLS_3_6_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_6144_group_prime' size='16' version='GNUTLS_3_6_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_6144_group_q' size='16' version='GNUTLS_3_6_8' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_6144_key_bits' size='4' version='GNUTLS_3_6_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_group_q' size='16' version='GNUTLS_3_6_8' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_ffdhe_8192_key_bits' size='4' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_free' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_malloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_realloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_secure_malloc' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1024_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_1536_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_2048_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_3072_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_generator' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_4096_group_prime' size='16' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_generator' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_srp_8192_group_prime' size='16' version='GNUTLS_3_6_2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gnutls_strdup' size='8' version='GNUTLS_3_4' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='asnprintf.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='vasnprintf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-5'/>
    <qualified-type-def type-id='type-id-5' restrict='yes' id='type-id-1'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-3'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-2'/>
    <type-decl name='char' size-in-bits='8' id='type-id-7'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-8'/>
    <typedef-decl name='size_t' type-id='type-id-12' id='type-id-9'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-10'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-11'/>
    <type-decl name='void' id='type-id-13'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='cloexec.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='rpl_fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-14'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='fcntl.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='close' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fcntl' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='read-file.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <function-decl name='setvbuf' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='ferror' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fread' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='ftello' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fstat' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fileno' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-16'/>
    <qualified-type-def type-id='type-id-16' restrict='yes' id='type-id-15'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-19'/>
    <typedef-decl name='__off_t' type-id='type-id-22' id='type-id-18'/>
    <qualified-type-def type-id='type-id-11' restrict='yes' id='type-id-17'/>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-24' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-27' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-28' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-32' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-22'/>
    <typedef-decl name='FILE' type-id='type-id-33' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-34' size-in-bits='192' id='type-id-32'>
      <subrange length='3' type-id='type-id-12' id='type-id-35'/>
    </array-type-def>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-42' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-45' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-34' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__blkcnt_t' type-id='type-id-22' id='type-id-30'/>
    <typedef-decl name='__blksize_t' type-id='type-id-22' id='type-id-29'/>
    <typedef-decl name='__dev_t' type-id='type-id-12' id='type-id-23'/>
    <typedef-decl name='__gid_t' type-id='type-id-10' id='type-id-28'/>
    <typedef-decl name='__ino_t' type-id='type-id-12' id='type-id-24'/>
    <typedef-decl name='__mode_t' type-id='type-id-10' id='type-id-26'/>
    <typedef-decl name='__nlink_t' type-id='type-id-12' id='type-id-25'/>
    <typedef-decl name='__uid_t' type-id='type-id-10' id='type-id-27'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-44'/>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='8' id='type-id-40'>
      <subrange length='1' type-id='type-id-12' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='160' id='type-id-45'>
      <subrange length='20' type-id='type-id-12' id='type-id-52'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='type-id-39'/>
    <typedef-decl name='__off64_t' type-id='type-id-22' id='type-id-42'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-22' id='type-id-34'/>
    <typedef-decl name='__time_t' type-id='type-id-22' id='type-id-46'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-38'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-47'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-49'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-50'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-13' id='type-id-48'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='vasnprintf.c' comp-dir-path='/home/ueno/devel/gnutls/gl' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-53' size-in-bits='1792' id='type-id-54'>
      <subrange length='7' type-id='type-id-12' id='type-id-55'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-56' size-in-bits='4928' id='type-id-57'>
      <subrange length='7' type-id='type-id-12' id='type-id-55'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-58'/>
    <type-decl name='float' size-in-bits='32' id='type-id-59'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-60'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-61'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-62'/>
    <typedef-decl name='arguments' type-id='type-id-63' id='type-id-64'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1920' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-64' visibility='default' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='direct_alloc_arg' type-id='type-id-54' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='argument' type-id='type-id-66' id='type-id-53'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-53' visibility='default' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-67' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-68' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arg_type' type-id='type-id-69' id='type-id-67'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-69'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='TYPE_NONE' value='0'/>
      <enumerator name='TYPE_SCHAR' value='1'/>
      <enumerator name='TYPE_UCHAR' value='2'/>
      <enumerator name='TYPE_SHORT' value='3'/>
      <enumerator name='TYPE_USHORT' value='4'/>
      <enumerator name='TYPE_INT' value='5'/>
      <enumerator name='TYPE_UINT' value='6'/>
      <enumerator name='TYPE_LONGINT' value='7'/>
      <enumerator name='TYPE_ULONGINT' value='8'/>
      <enumerator name='TYPE_LONGLONGINT' value='9'/>
      <enumerator name='TYPE_ULONGLONGINT' value='10'/>
      <enumerator name='TYPE_DOUBLE' value='11'/>
      <enumerator name='TYPE_LONGDOUBLE' value='12'/>
      <enumerator name='TYPE_CHAR' value='13'/>
      <enumerator name='TYPE_WIDE_CHAR' value='14'/>
      <enumerator name='TYPE_STRING' value='15'/>
      <enumerator name='TYPE_WIDE_STRING' value='16'/>
      <enumerator name='TYPE_POINTER' value='17'/>
      <enumerator name='TYPE_COUNT_SCHAR_POINTER' value='18'/>
      <enumerator name='TYPE_COUNT_SHORT_POINTER' value='19'/>
      <enumerator name='TYPE_COUNT_INT_POINTER' value='20'/>
      <enumerator name='TYPE_COUNT_LONGINT_POINTER' value='21'/>
      <enumerator name='TYPE_COUNT_LONGLONGINT_POINTER' value='22'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-68'>
      <data-member access='private'>
        <var-decl name='a_schar' type-id='type-id-39' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_uchar' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_short' type-id='type-id-72' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_ushort' type-id='type-id-38' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_int' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_uint' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_longint' type-id='type-id-22' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_ulongint' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_longlongint' type-id='type-id-61' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_ulonglongint' type-id='type-id-62' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_float' type-id='type-id-59' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_double' type-id='type-id-58' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_longdouble' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_char' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_wide_char' type-id='type-id-73' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_string' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_wide_string' type-id='type-id-74' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_pointer' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_schar_pointer' type-id='type-id-75' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_short_pointer' type-id='type-id-76' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_int_pointer' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_longint_pointer' type-id='type-id-78' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='a_count_longlongint_pointer' type-id='type-id-79' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='wint_t' type-id='type-id-10' id='type-id-73'/>
    <typedef-decl name='wchar_t' type-id='type-id-14' id='type-id-80'/>
    <typedef-decl name='char_directives' type-id='type-id-81' id='type-id-82'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='5184' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-82' visibility='default' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir' type-id='type-id-83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_width_length' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='max_precision_length' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='direct_alloc_dir' type-id='type-id-57' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='char_directive' type-id='type-id-84' id='type-id-56'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='704' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-56' visibility='default' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dir_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dir_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='width_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='width_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='width_arg_index' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='precision_start' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='precision_end' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='precision_arg_index' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='conversion' type-id='type-id-7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arg_index' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-86'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-87'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-75'/>
    <function-decl name='printf_fetchargs' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='printf_parse' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-77'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-72'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-71'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='accelerated.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated' language='LANG_C11'>
    <function-decl name='register_x86_crypto' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-cbc-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='2048' id='type-id-89'>
      <subrange length='64' type-id='type-id-12' id='type-id-90'/>
    </array-type-def>
    <typedef-decl name='AES_KEY' type-id='type-id-91' id='type-id-92'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2080' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-92' visibility='default' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rd_key' type-id='type-id-89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='rounds' type-id='type-id-88' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-96'/>
    <var-decl name='_gnutls_aesni_x86' type-id='type-id-97' visibility='default'/>
    <function-decl name='aesni_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='aesni_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='aesni_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-97'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-98'/>
    <typedef-decl name='uint32_t' type-id='type-id-102' id='type-id-88'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-99'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-101'/>
    <typedef-decl name='__uint32_t' type-id='type-id-10' id='type-id-102'/>
    <typedef-decl name='gnutls_crypto_cipher_st' type-id='type-id-103' id='type-id-100'/>
    <class-decl name='__anonymous_struct__' size-in-bits='768' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-100' visibility='default' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='setkey' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='setiv' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='getiv' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='encrypt' type-id='type-id-108' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='decrypt' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='aead_encrypt' type-id='type-id-110' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='aead_decrypt' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='deinit' type-id='type-id-112' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='auth' type-id='type-id-113' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tag' type-id='type-id-114' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='exists' type-id='type-id-115' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-115'/>
    <typedef-decl name='gnutls_cipher_aead_decrypt_func' type-id='type-id-117' id='type-id-111'/>
    <typedef-decl name='gnutls_cipher_aead_encrypt_func' type-id='type-id-117' id='type-id-110'/>
    <typedef-decl name='gnutls_cipher_auth_func' type-id='type-id-118' id='type-id-113'/>
    <typedef-decl name='gnutls_cipher_decrypt_func' type-id='type-id-119' id='type-id-109'/>
    <typedef-decl name='gnutls_cipher_deinit_func' type-id='type-id-120' id='type-id-112'/>
    <typedef-decl name='gnutls_cipher_encrypt_func' type-id='type-id-119' id='type-id-108'/>
    <typedef-decl name='gnutls_cipher_getiv_func' type-id='type-id-118' id='type-id-107'/>
    <typedef-decl name='gnutls_cipher_init_func' type-id='type-id-121' id='type-id-104'/>
    <typedef-decl name='gnutls_cipher_setiv_func' type-id='type-id-118' id='type-id-106'/>
    <typedef-decl name='gnutls_cipher_setkey_func' type-id='type-id-118' id='type-id-105'/>
    <typedef-decl name='gnutls_cipher_tag_func' type-id='type-id-122' id='type-id-114'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-122'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-cbc-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_ssse3' type-id='type-id-97' visibility='default'/>
    <function-decl name='vpaes_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='vpaes_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-93'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='vpaes_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-ccm-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <typedef-decl name='nettle_cipher_func' type-id='type-id-129' id='type-id-130'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <var-decl name='_gnutls_aes_ccm_x86_aesni' type-id='type-id-97' visibility='default'/>
    <function-decl name='nettle_ccm_encrypt_message' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='aesni_ecb_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_ccm_decrypt_message' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-132'/>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-type>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-133'/>
    <qualified-type-def type-id='type-id-135' const='yes' id='type-id-134'/>
    <typedef-decl name='uint8_t' type-id='type-id-136' id='type-id-135'/>
    <typedef-decl name='__uint8_t' type-id='type-id-71' id='type-id-136'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-gcm-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-137' size-in-bits='32768' id='type-id-138'>
      <subrange length='256' type-id='type-id-12' id='type-id-139'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-140' size-in-bits='128' id='type-id-141'>
      <subrange length='2' type-id='type-id-12' id='type-id-142'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='128' id='type-id-143'>
      <subrange length='4' type-id='type-id-12' id='type-id-144'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='128' id='type-id-145'>
      <subrange length='2' type-id='type-id-12' id='type-id-142'/>
    </array-type-def>
    <class-decl name='gcm_key' size-in-bits='32768' is-struct='yes' visibility='default' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='h' type-id='type-id-138' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gcm_ctx' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctr' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='x' type-id='type-id-137' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth_size' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='data_size' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='padlock_cipher_data' size-in-bits='2336' is-struct='yes' visibility='default' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cword' type-id='type-id-150' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ks' type-id='type-id-92' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='type-id-150'>
      <data-member access='private'>
        <var-decl name='pad' type-id='type-id-143' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='b' type-id='type-id-151' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-151'>
      <data-member access='public' static='yes'>
        <var-decl name='rounds' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='dgst' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='align' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ciphr' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='keygen' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='interm' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='encdec' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ksize' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='nettle_block16' size-in-bits='128' visibility='default' id='type-id-137'>
      <data-member access='private'>
        <var-decl name='b' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='w' type-id='type-id-145' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='u64' type-id='type-id-141' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='type-id-146' const='yes' id='type-id-153'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-157'/>
    <var-decl name='_gnutls_aes_gcm_padlock' type-id='type-id-97' visibility='default'/>
    <function-decl name='padlock_aes_cipher_setkey' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_gcm_set_iv' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_gcm_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_gcm_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_gcm_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_ecb_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='nettle_gcm_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <typedef-decl name='uint64_t' type-id='type-id-158' id='type-id-140'/>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='128' id='type-id-152'>
      <subrange length='16' type-id='type-id-12' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='128' id='type-id-149'>
      <subrange length='16' type-id='type-id-12' id='type-id-159'/>
    </array-type-def>
    <typedef-decl name='__uint64_t' type-id='type-id-12' id='type-id-158'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-gcm-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_x86_aesni' type-id='type-id-97' visibility='default'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-gcm-x86-pclmul-avx.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <typedef-decl name='u128' type-id='type-id-160' id='type-id-161'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-161' visibility='default' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hi' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lo' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-140' const='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-167'/>
    <var-decl name='_gnutls_aes_gcm_pclmul_avx' type-id='type-id-97' visibility='default'/>
    <function-decl name='gcm_init_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='aesni_ctr32_encrypt_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='aesni_gcm_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='aesni_gcm_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gcm_gmult_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gcm_ghash_avx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-gcm-x86-pclmul.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_pclmul' type-id='type-id-97' visibility='default'/>
    <function-decl name='gcm_init_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gcm_gmult_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gcm_ghash_clmul' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-132'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-gcm-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_gcm_x86_ssse3' type-id='type-id-97' visibility='default'/>
    <function-decl name='vpaes_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='1920' id='type-id-168'>
      <subrange length='60' type-id='type-id-12' id='type-id-169'/>
    </array-type-def>
    <class-decl name='aes256_ctx' size-in-bits='1920' is-struct='yes' visibility='default' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-168' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <var-decl name='_gnutls_aes_padlock' type-id='type-id-97' visibility='default'/>
    <function-decl name='padlock_cbc_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='padlock_reload_key' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_decrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_aes256_set_encrypt_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aes-xts-x86-aesni.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_aes_xts_x86_aesni' type-id='type-id-97' visibility='default'/>
    <function-decl name='aesni_xts_encrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='aesni_xts_decrypt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-99'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hmac-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='160' id='type-id-172'>
      <subrange length='5' type-id='type-id-12' id='type-id-173'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-88' size-in-bits='256' id='type-id-174'>
      <subrange length='8' type-id='type-id-12' id='type-id-175'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-140' size-in-bits='512' id='type-id-176'>
      <subrange length='8' type-id='type-id-12' id='type-id-175'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='1024' id='type-id-177'>
      <subrange length='128' type-id='type-id-12' id='type-id-178'/>
    </array-type-def>
    <class-decl name='sha1_ctx' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='count' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='index' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='block' type-id='type-id-180' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha256_ctx' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='count' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='index' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block' type-id='type-id-180' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sha512_ctx' size-in-bits='1728' is-struct='yes' visibility='default' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='count_low' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='count_high' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='index' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='block' type-id='type-id-177' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nettle_hash' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='context_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='digest_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='block_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init' type-id='type-id-184' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update' type-id='type-id-185' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='digest' type-id='type-id-186' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nettle_hash_init_func' type-id='type-id-127' id='type-id-187'/>
    <typedef-decl name='nettle_hash_update_func' type-id='type-id-188' id='type-id-189'/>
    <typedef-decl name='nettle_hash_digest_func' type-id='type-id-190' id='type-id-191'/>
    <qualified-type-def type-id='type-id-183' const='yes' id='type-id-192'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-196'/>
    <var-decl name='_gnutls_hmac_sha_padlock' type-id='type-id-197' visibility='default'/>
    <var-decl name='_gnutls_hmac_sha_padlock_nano' type-id='type-id-197' visibility='default'/>
    <function-decl name='padlock_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_hmac_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_hmac_set_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='wrap_padlock_hash_fast' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-197'/>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-190'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-type>
    <typedef-decl name='gnutls_digest_algorithm_t' type-id='type-id-200' id='type-id-198'/>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='512' id='type-id-180'>
      <subrange length='64' type-id='type-id-12' id='type-id-90'/>
    </array-type-def>
    <enum-decl name='__anonymous_enum__10' is-anonymous='yes' id='type-id-200'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_DIG_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DIG_NULL' value='1'/>
      <enumerator name='GNUTLS_DIG_MD5' value='2'/>
      <enumerator name='GNUTLS_DIG_SHA1' value='3'/>
      <enumerator name='GNUTLS_DIG_RMD160' value='4'/>
      <enumerator name='GNUTLS_DIG_MD2' value='5'/>
      <enumerator name='GNUTLS_DIG_SHA256' value='6'/>
      <enumerator name='GNUTLS_DIG_SHA384' value='7'/>
      <enumerator name='GNUTLS_DIG_SHA512' value='8'/>
      <enumerator name='GNUTLS_DIG_SHA224' value='9'/>
      <enumerator name='GNUTLS_DIG_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_DIG_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_DIG_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_DIG_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_DIG_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_DIG_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_DIG_STREEBOG_512' value='17'/>
      <enumerator name='GNUTLS_DIG_SHAKE_128' value='209'/>
      <enumerator name='GNUTLS_DIG_SHAKE_256' value='210'/>
    </enum-decl>
    <typedef-decl name='gnutls_crypto_mac_st' type-id='type-id-201' id='type-id-199'/>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-199' visibility='default' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init' type-id='type-id-202' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='setkey' type-id='type-id-203' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='setnonce' type-id='type-id-204' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-206' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit' type-id='type-id-207' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fast' type-id='type-id-208' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='copy' type-id='type-id-209' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='exists' type-id='type-id-210' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-210'/>
    <typedef-decl name='gnutls_mac_copy_func' type-id='type-id-212' id='type-id-209'/>
    <typedef-decl name='gnutls_mac_deinit_func' type-id='type-id-120' id='type-id-207'/>
    <typedef-decl name='gnutls_mac_fast_func' type-id='type-id-213' id='type-id-208'/>
    <typedef-decl name='gnutls_mac_hash_func' type-id='type-id-118' id='type-id-205'/>
    <typedef-decl name='gnutls_mac_init_func' type-id='type-id-214' id='type-id-202'/>
    <typedef-decl name='gnutls_mac_output_func' type-id='type-id-118' id='type-id-206'/>
    <typedef-decl name='gnutls_mac_setkey_func' type-id='type-id-118' id='type-id-203'/>
    <typedef-decl name='gnutls_mac_setnonce_func' type-id='type-id-118' id='type-id-204'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-212'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='hmac-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='_gnutls_hmac_sha_x86_ssse3' type-id='type-id-197' visibility='default'/>
    <function-decl name='x86_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='x86_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='x86_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sha-padlock.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='padlock_sha1' type-id='type-id-192' visibility='default'/>
    <var-decl name='padlock_sha224' type-id='type-id-192' visibility='default'/>
    <var-decl name='padlock_sha256' type-id='type-id-192' visibility='default'/>
    <var-decl name='padlock_sha384' type-id='type-id-192' visibility='default'/>
    <var-decl name='padlock_sha512' type-id='type-id-192' visibility='default'/>
    <var-decl name='_gnutls_sha_padlock' type-id='type-id-218' visibility='default'/>
    <var-decl name='_gnutls_sha_padlock_nano' type-id='type-id-218' visibility='default'/>
    <function-decl name='nettle_sha512_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-196'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha384_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-196'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha256_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha224_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha1_init' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-194'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_sha256_oneshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_sha1_oneshot' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_sha512_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_sha256_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='padlock_sha1_blocks' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-218'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-219'/>
    <typedef-decl name='gnutls_crypto_digest_st' type-id='type-id-221' id='type-id-220'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='448' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-220' visibility='default' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='init' type-id='type-id-222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='output' type-id='type-id-224' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='deinit' type-id='type-id-225' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fast' type-id='type-id-226' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='copy' type-id='type-id-227' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='exists' type-id='type-id-228' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-228'/>
    <typedef-decl name='gnutls_digest_copy_func' type-id='type-id-212' id='type-id-227'/>
    <typedef-decl name='gnutls_digest_deinit_func' type-id='type-id-120' id='type-id-225'/>
    <typedef-decl name='gnutls_digest_fast_func' type-id='type-id-230' id='type-id-226'/>
    <typedef-decl name='gnutls_digest_hash_func' type-id='type-id-118' id='type-id-223'/>
    <typedef-decl name='gnutls_digest_init_func' type-id='type-id-231' id='type-id-222'/>
    <typedef-decl name='gnutls_digest_output_func' type-id='type-id-118' id='type-id-224'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-230'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sha-x86-ssse3.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <var-decl name='x86_sha1' type-id='type-id-192' visibility='default'/>
    <var-decl name='x86_sha224' type-id='type-id-192' visibility='default'/>
    <var-decl name='x86_sha256' type-id='type-id-192' visibility='default'/>
    <var-decl name='x86_sha384' type-id='type-id-192' visibility='default'/>
    <var-decl name='x86_sha512' type-id='type-id-192' visibility='default'/>
    <var-decl name='_gnutls_sha_x86_ssse3' type-id='type-id-218' visibility='default'/>
    <function-decl name='nettle_sha512_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha384_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha256_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha224_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha1_digest' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='sha512_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha512_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='sha256_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha256_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='sha1_block_data_order' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nettle_sha1_update' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='x86-common.c' comp-dir-path='/home/ueno/devel/gnutls/lib/accelerated/x86' language='LANG_C11'>
    <function-decl name='padlock_capability' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_gnutls_priority_update_non_aesni' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gnutls_crypto_single_mac_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-234'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_crypto_single_digest_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_crypto_single_cipher_register' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-235'/>
    <typedef-decl name='gnutls_cipher_algorithm_t' type-id='type-id-239' id='type-id-237'/>
    <typedef-decl name='gnutls_mac_algorithm_t' type-id='type-id-240' id='type-id-234'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-240'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_MAC_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_MAC_NULL' value='1'/>
      <enumerator name='GNUTLS_MAC_MD5' value='2'/>
      <enumerator name='GNUTLS_MAC_SHA1' value='3'/>
      <enumerator name='GNUTLS_MAC_RMD160' value='4'/>
      <enumerator name='GNUTLS_MAC_MD2' value='5'/>
      <enumerator name='GNUTLS_MAC_SHA256' value='6'/>
      <enumerator name='GNUTLS_MAC_SHA384' value='7'/>
      <enumerator name='GNUTLS_MAC_SHA512' value='8'/>
      <enumerator name='GNUTLS_MAC_SHA224' value='9'/>
      <enumerator name='GNUTLS_MAC_SHA3_224' value='10'/>
      <enumerator name='GNUTLS_MAC_SHA3_256' value='11'/>
      <enumerator name='GNUTLS_MAC_SHA3_384' value='12'/>
      <enumerator name='GNUTLS_MAC_SHA3_512' value='13'/>
      <enumerator name='GNUTLS_MAC_MD5_SHA1' value='14'/>
      <enumerator name='GNUTLS_MAC_GOSTR_94' value='15'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_256' value='16'/>
      <enumerator name='GNUTLS_MAC_STREEBOG_512' value='17'/>
      <enumerator name='GNUTLS_MAC_AEAD' value='200'/>
      <enumerator name='GNUTLS_MAC_UMAC_96' value='201'/>
      <enumerator name='GNUTLS_MAC_UMAC_128' value='202'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_128' value='203'/>
      <enumerator name='GNUTLS_MAC_AES_CMAC_256' value='204'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_128' value='205'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_192' value='206'/>
      <enumerator name='GNUTLS_MAC_AES_GMAC_256' value='207'/>
      <enumerator name='GNUTLS_MAC_GOST28147_TC26Z_IMIT' value='208'/>
      <enumerator name='GNUTLS_MAC_SHAKE_128' value='209'/>
      <enumerator name='GNUTLS_MAC_SHAKE_256' value='210'/>
    </enum-decl>
    <enum-decl name='gnutls_cipher_algorithm' id='type-id-239'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_CIPHER_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CIPHER_NULL' value='1'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_128' value='2'/>
      <enumerator name='GNUTLS_CIPHER_3DES_CBC' value='3'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CBC' value='4'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CBC' value='5'/>
      <enumerator name='GNUTLS_CIPHER_ARCFOUR_40' value='6'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_CBC' value='7'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_CBC' value='8'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CBC' value='9'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_GCM' value='10'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_GCM' value='11'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_192_CBC' value='12'/>
      <enumerator name='GNUTLS_CIPHER_SALSA20_256' value='13'/>
      <enumerator name='GNUTLS_CIPHER_ESTREAM_SALSA20_256' value='14'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_128_GCM' value='15'/>
      <enumerator name='GNUTLS_CIPHER_CAMELLIA_256_GCM' value='16'/>
      <enumerator name='GNUTLS_CIPHER_RC2_40_CBC' value='17'/>
      <enumerator name='GNUTLS_CIPHER_DES_CBC' value='18'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM' value='19'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM' value='20'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CCM_8' value='21'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CCM_8' value='22'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_POLY1305' value='23'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CFB' value='24'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPA_CFB' value='25'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPB_CFB' value='26'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPC_CFB' value='27'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_CPD_CFB' value='28'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_CFB8' value='29'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_CFB8' value='30'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_CFB8' value='31'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_XTS' value='32'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_XTS' value='33'/>
      <enumerator name='GNUTLS_CIPHER_GOST28147_TC26Z_CNT' value='34'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_64' value='35'/>
      <enumerator name='GNUTLS_CIPHER_CHACHA20_32' value='36'/>
      <enumerator name='GNUTLS_CIPHER_AES_128_SIV' value='37'/>
      <enumerator name='GNUTLS_CIPHER_AES_256_SIV' value='38'/>
      <enumerator name='GNUTLS_CIPHER_AES_192_GCM' value='39'/>
      <enumerator name='GNUTLS_CIPHER_IDEA_PGP_CFB' value='200'/>
      <enumerator name='GNUTLS_CIPHER_3DES_PGP_CFB' value='201'/>
      <enumerator name='GNUTLS_CIPHER_CAST5_PGP_CFB' value='202'/>
      <enumerator name='GNUTLS_CIPHER_BLOWFISH_PGP_CFB' value='203'/>
      <enumerator name='GNUTLS_CIPHER_SAFER_SK128_PGP_CFB' value='204'/>
      <enumerator name='GNUTLS_CIPHER_AES128_PGP_CFB' value='205'/>
      <enumerator name='GNUTLS_CIPHER_AES192_PGP_CFB' value='206'/>
      <enumerator name='GNUTLS_CIPHER_AES256_PGP_CFB' value='207'/>
      <enumerator name='GNUTLS_CIPHER_TWOFISH_PGP_CFB' value='208'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='alert.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <function-decl name='gnutls_alert_send_appropriate' mangled-name='gnutls_alert_send_appropriate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_send_appropriate@@GNUTLS_3_4'>
      <parameter type-id='type-id-241' name='session'/>
      <parameter type-id='type-id-14' name='err'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_error_to_alert' mangled-name='gnutls_error_to_alert' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_to_alert@@GNUTLS_3_4'>
      <parameter type-id='type-id-14' name='err'/>
      <parameter type-id='type-id-77' name='level'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_strname' mangled-name='gnutls_alert_get_strname' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_strname@@GNUTLS_3_4'>
      <parameter type-id='type-id-242' name='alert'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='gnutls_alert_description_t' type-id='type-id-243' id='type-id-242'/>
    <typedef-decl name='gnutls_session_t' type-id='type-id-244' id='type-id-241'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' id='type-id-243'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_A_CLOSE_NOTIFY' value='0'/>
      <enumerator name='GNUTLS_A_UNEXPECTED_MESSAGE' value='10'/>
      <enumerator name='GNUTLS_A_BAD_RECORD_MAC' value='20'/>
      <enumerator name='GNUTLS_A_DECRYPTION_FAILED' value='21'/>
      <enumerator name='GNUTLS_A_RECORD_OVERFLOW' value='22'/>
      <enumerator name='GNUTLS_A_DECOMPRESSION_FAILURE' value='30'/>
      <enumerator name='GNUTLS_A_HANDSHAKE_FAILURE' value='40'/>
      <enumerator name='GNUTLS_A_SSL3_NO_CERTIFICATE' value='41'/>
      <enumerator name='GNUTLS_A_BAD_CERTIFICATE' value='42'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_CERTIFICATE' value='43'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REVOKED' value='44'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_EXPIRED' value='45'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNKNOWN' value='46'/>
      <enumerator name='GNUTLS_A_ILLEGAL_PARAMETER' value='47'/>
      <enumerator name='GNUTLS_A_UNKNOWN_CA' value='48'/>
      <enumerator name='GNUTLS_A_ACCESS_DENIED' value='49'/>
      <enumerator name='GNUTLS_A_DECODE_ERROR' value='50'/>
      <enumerator name='GNUTLS_A_DECRYPT_ERROR' value='51'/>
      <enumerator name='GNUTLS_A_EXPORT_RESTRICTION' value='60'/>
      <enumerator name='GNUTLS_A_PROTOCOL_VERSION' value='70'/>
      <enumerator name='GNUTLS_A_INSUFFICIENT_SECURITY' value='71'/>
      <enumerator name='GNUTLS_A_INTERNAL_ERROR' value='80'/>
      <enumerator name='GNUTLS_A_INAPPROPRIATE_FALLBACK' value='86'/>
      <enumerator name='GNUTLS_A_USER_CANCELED' value='90'/>
      <enumerator name='GNUTLS_A_NO_RENEGOTIATION' value='100'/>
      <enumerator name='GNUTLS_A_MISSING_EXTENSION' value='109'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_EXTENSION' value='110'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNOBTAINABLE' value='111'/>
      <enumerator name='GNUTLS_A_UNRECOGNIZED_NAME' value='112'/>
      <enumerator name='GNUTLS_A_UNKNOWN_PSK_IDENTITY' value='115'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REQUIRED' value='116'/>
      <enumerator name='GNUTLS_A_NO_APPLICATION_PROTOCOL' value='120'/>
      <enumerator name='GNUTLS_A_MAX' value='120'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-244'/>
    <class-decl name='gnutls_session_int' size-in-bits='59008' is-struct='yes' visibility='default' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security_parameters' type-id='type-id-246' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='record_parameters' type-id='type-id-247' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='internals' type-id='type-id-248' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36352'>
        <var-decl name='key' type-id='type-id-249' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-250' size-in-bits='256' id='type-id-247'>
      <subrange length='4' type-id='type-id-12' id='type-id-144'/>
    </array-type-def>
    <typedef-decl name='gnutls_key_st' type-id='type-id-251' id='type-id-249'/>
    <typedef-decl name='internals_st' type-id='type-id-252' id='type-id-248'/>
    <typedef-decl name='security_parameters_st' type-id='type-id-253' id='type-id-246'/>
    <class-decl name='gnutls_key_st' size-in-bits='22656' is-struct='yes' visibility='default' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kshare' type-id='type-id-254' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='proto' type-id='type-id-255' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20096'>
        <var-decl name='binders' type-id='type-id-256' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20608'>
        <var-decl name='key' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20736'>
        <var-decl name='session_ticket_key' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21248'>
        <var-decl name='previous_ticket_key' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21760'>
        <var-decl name='initial_stek' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22272'>
        <var-decl name='auth_info' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22336'>
        <var-decl name='auth_info_type' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22368'>
        <var-decl name='auth_info_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22400'>
        <var-decl name='cred' type-id='type-id-259' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22464'>
        <var-decl name='totp' type-id='type-id-260' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='34048' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-248' visibility='default' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='record_buffer' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handshake_hash_buffer_prev_len' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='handshake_hash_buffer_client_hello_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='handshake_hash_buffer_client_kx_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='handshake_hash_buffer_server_finished_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handshake_hash_buffer_client_finished_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handshake_hash_buffer' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resumable' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='ticket_state' type-id='type-id-264' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bye_state' type-id='type-id-265' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reauth_state' type-id='type-id-266' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='handshake_final_state' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='handshake_state' type-id='type-id-267' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='invalid_connection' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='904'>
        <var-decl name='may_not_read' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='912'>
        <var-decl name='may_not_write' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='920'>
        <var-decl name='read_eof' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='last_alert' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='last_handshake_in' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='last_handshake_out' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='priorities' type-id='type-id-268' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='allow_large_records' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1096'>
        <var-decl name='allow_small_records' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='no_etm' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1112'>
        <var-decl name='no_ext_master_secret' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='allow_key_usage_violation' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1128'>
        <var-decl name='allow_wrong_pms' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1136'>
        <var-decl name='dumbfw' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_prime_bits' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='resumed' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1176'>
        <var-decl name='resumption_requested' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='resumed_security_parameters' type-id='type-id-246' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='resumption_data' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='handshake_send_buffer' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='handshake_header_recv_buffer' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='handshake_recv_buffer' type-id='type-id-270' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='handshake_recv_buffer_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='record_recv_buffer' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='record_send_buffer' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='record_send_buffer_user_size' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='early_data_recv_buffer' type-id='type-id-261' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='early_data_presend_buffer' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='rsend_state' type-id='type-id-271' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='record_key_update_buffer' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='record_presend_buffer' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='reauth_buffer' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='expire_time' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='auth_struct' type-id='type-id-273' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='adv_version_major' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9480'>
        <var-decl name='adv_version_minor' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9504'>
        <var-decl name='send_cert_req' type-id='type-id-274' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='max_handshake_data_buffer_size' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='pull_timeout_func' type-id='type-id-275' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='pull_func' type-id='type-id-276' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='push_func' type-id='type-id-277' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='vec_push_func' type-id='type-id-278' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9856'>
        <var-decl name='errno_func' type-id='type-id-279' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9920'>
        <var-decl name='transport_recv_ptr' type-id='type-id-280' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='transport_send_ptr' type-id='type-id-280' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='db_store_func' type-id='type-id-281' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='db_retrieve_func' type-id='type-id-282' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='db_remove_func' type-id='type-id-283' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='db_ptr' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='user_hello_func' type-id='type-id-284' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10368'>
        <var-decl name='h_hook' type-id='type-id-285' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10432'>
        <var-decl name='h_type' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10464'>
        <var-decl name='h_post' type-id='type-id-286' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10496'>
        <var-decl name='keylog_func' type-id='type-id-287' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10560'>
        <var-decl name='selected_cert_list' type-id='type-id-288' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10624'>
        <var-decl name='selected_cert_list_length' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='selected_key' type-id='type-id-289' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='selected_ocsp' type-id='type-id-290' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='selected_ocsp_length' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='selected_ocsp_func' type-id='type-id-291' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='selected_ocsp_func_ptr' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='selected_need_free' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11016'>
        <var-decl name='default_record_version' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11032'>
        <var-decl name='default_hello_version' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='user_ptr' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='direction' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11144'>
        <var-decl name='ignore_rdn_sequence' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11152'>
        <var-decl name='rsa_pms_version' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11168'>
        <var-decl name='errnum' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='initial_negotiation_completed' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='post_negotiation_lock' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='transport' type-id='type-id-293' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11392'>
        <var-decl name='dtls' type-id='type-id-294' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11968'>
        <var-decl name='handshake_suspicious_loops' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12000'>
        <var-decl name='handshake_in_progress' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12008'>
        <var-decl name='premaster_set' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12032'>
        <var-decl name='cb_tls_unique_len' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12064'>
        <var-decl name='cb_tls_unique' type-id='type-id-295' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12352'>
        <var-decl name='handshake_start_time' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='handshake_abs_timeout' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='ertt' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12640'>
        <var-decl name='handshake_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12672'>
        <var-decl name='record_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12736'>
        <var-decl name='post_handshake_cr_context' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12864'>
        <var-decl name='post_handshake_hash_buffer' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13120'>
        <var-decl name='hsk_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13184'>
        <var-decl name='last_key_update' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13312'>
        <var-decl name='key_update_count' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13376'>
        <var-decl name='full_client_hello' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13632'>
        <var-decl name='extensions_offset' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13696'>
        <var-decl name='hb_local_data' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13952'>
        <var-decl name='hb_remote_data' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14208'>
        <var-decl name='hb_ping_start' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='hb_ping_sent' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14464'>
        <var-decl name='hb_actual_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14496'>
        <var-decl name='hb_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14528'>
        <var-decl name='hb_total_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14560'>
        <var-decl name='ocsp_check_ok' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14592'>
        <var-decl name='hb_state' type-id='type-id-296' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14624'>
        <var-decl name='recv_state' type-id='type-id-297' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14656'>
        <var-decl name='sc_random_set' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14720'>
        <var-decl name='flags' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14784'>
        <var-decl name='verify_callback' type-id='type-id-298' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14848'>
        <var-decl name='vc_data' type-id='type-id-299' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14912'>
        <var-decl name='vc_sdata' type-id='type-id-300' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15104'>
        <var-decl name='vc_elements' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15136'>
        <var-decl name='vc_status' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15168'>
        <var-decl name='additional_verify_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15200'>
        <var-decl name='cert_hash' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15456'>
        <var-decl name='cert_hash_set' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15464'>
        <var-decl name='saved_username' type-id='type-id-302' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16512'>
        <var-decl name='saved_username_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16576'>
        <var-decl name='tfo' type-id='type-id-303' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17792'>
        <var-decl name='rsup' type-id='type-id-304' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17856'>
        <var-decl name='rsup_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17920'>
        <var-decl name='rexts' type-id='type-id-305' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='rexts_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='ext_data' type-id='type-id-306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30336'>
        <var-decl name='used_exts' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30400'>
        <var-decl name='ext_msg' type-id='type-id-307' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30432'>
        <var-decl name='max_recv_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30464'>
        <var-decl name='cand_ec_group' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30528'>
        <var-decl name='cand_dh_group' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30592'>
        <var-decl name='cand_group' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30656'>
        <var-decl name='hrr_cs' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30688'>
        <var-decl name='session_ticket_renew' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30720'>
        <var-decl name='tls13_ticket' type-id='type-id-309' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33856'>
        <var-decl name='early_data_received' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33920'>
        <var-decl name='anti_replay' type-id='type-id-310' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33984'>
        <var-decl name='epoch_lock' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='2048' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-246' visibility='default' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entity' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='epoch_read' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='epoch_write' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='epoch_next' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='epoch_min' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cs' type-id='type-id-311' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prf' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='master_secret' type-id='type-id-313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='client_random' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='server_random' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='session_id' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='session_id_size' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='timestamp' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='post_handshake_auth' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1552'>
        <var-decl name='max_record_send_size' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='max_record_recv_size' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1584'>
        <var-decl name='max_user_record_send_size' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='max_user_record_recv_size' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='max_early_data_size' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='client_ctype' type-id='type-id-314' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='server_ctype' type-id='type-id-314' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='grp' type-id='type-id-308' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='server_sign_algo' type-id='type-id-315' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='client_sign_algo' type-id='type-id-315' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ext_master_secret' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1864'>
        <var-decl name='etm' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1872'>
        <var-decl name='client_auth_type' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1880'>
        <var-decl name='server_auth_type' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='do_recv_supplemental' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='do_send_supplemental' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pversion' type-id='type-id-316' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-250'/>
    <array-type-def dimensions='1' type-id='type-id-318' size-in-bits='12288' id='type-id-306'>
      <subrange length='64' type-id='type-id-12' id='type-id-90'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-259'/>
    <array-type-def dimensions='1' type-id='type-id-320' size-in-bits='512' id='type-id-256'>
      <subrange length='2' type-id='type-id-12' id='type-id-142'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='type-id-263'/>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='1032' id='type-id-302'>
      <subrange length='129' type-id='type-id-12' id='type-id-321'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__15' size-in-bits='11520' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh_params' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='ecdhx_params' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='dh_params' type-id='type-id-322' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='last_result' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='was_rotated' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb' type-id='type-id-323' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-312'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-268'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-299'/>
    <array-type-def dimensions='1' type-id='type-id-335' size-in-bits='3456' id='type-id-270'>
      <subrange length='6' type-id='type-id-12' id='type-id-336'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-305'/>
    <typedef-decl name='bye_state_t' type-id='type-id-338' id='type-id-265'/>
    <typedef-decl name='dtls_st' type-id='type-id-339' id='type-id-294'/>
    <typedef-decl name='gnutls_anti_replay_t' type-id='type-id-340' id='type-id-310'/>
    <typedef-decl name='gnutls_buffer_st' type-id='type-id-341' id='type-id-262'/>
    <typedef-decl name='gnutls_certificate_request_t' type-id='type-id-342' id='type-id-274'/>
    <typedef-decl name='gnutls_certificate_type_t' type-id='type-id-343' id='type-id-314'/>
    <typedef-decl name='gnutls_credentials_type_t' type-id='type-id-344' id='type-id-258'/>
    <typedef-decl name='gnutls_datum_t' type-id='type-id-345' id='type-id-257'/>
    <typedef-decl name='gnutls_db_remove_func' type-id='type-id-346' id='type-id-283'/>
    <typedef-decl name='gnutls_db_retr_func' type-id='type-id-347' id='type-id-282'/>
    <typedef-decl name='gnutls_db_store_func' type-id='type-id-348' id='type-id-281'/>
    <typedef-decl name='gnutls_errno_func' type-id='type-id-349' id='type-id-279'/>
    <typedef-decl name='gnutls_ext_flags_t' type-id='type-id-350' id='type-id-307'/>
    <typedef-decl name='gnutls_handshake_hook_func' type-id='type-id-351' id='type-id-285'/>
    <typedef-decl name='gnutls_handshake_simple_hook_func' type-id='type-id-352' id='type-id-284'/>
    <typedef-decl name='gnutls_keylog_func' type-id='type-id-353' id='type-id-287'/>
    <typedef-decl name='gnutls_pull_func' type-id='type-id-354' id='type-id-276'/>
    <typedef-decl name='gnutls_pull_timeout_func' type-id='type-id-355' id='type-id-275'/>
    <typedef-decl name='gnutls_push_func' type-id='type-id-354' id='type-id-277'/>
    <typedef-decl name='gnutls_sign_algorithm_t' type-id='type-id-356' id='type-id-315'/>
    <typedef-decl name='gnutls_status_request_ocsp_func' type-id='type-id-357' id='type-id-291'/>
    <typedef-decl name='gnutls_transport_ptr_t' type-id='type-id-11' id='type-id-280'/>
    <typedef-decl name='gnutls_typed_vdata_st' type-id='type-id-358' id='type-id-300'/>
    <typedef-decl name='gnutls_vec_push_func' type-id='type-id-359' id='type-id-278'/>
    <typedef-decl name='handshake_state_t' type-id='type-id-360' id='type-id-267'/>
    <typedef-decl name='heartbeat_state_t' type-id='type-id-361' id='type-id-296'/>
    <typedef-decl name='int16_t' type-id='type-id-362' id='type-id-286'/>
    <typedef-decl name='mbuffer_head_st' type-id='type-id-363' id='type-id-261'/>
    <typedef-decl name='reauth_state_t' type-id='type-id-364' id='type-id-266'/>
    <typedef-decl name='record_parameters_st' type-id='type-id-365' id='type-id-317'/>
    <typedef-decl name='record_send_state_t' type-id='type-id-366' id='type-id-271'/>
    <typedef-decl name='recv_state_t' type-id='type-id-367' id='type-id-297'/>
    <typedef-decl name='send_ticket_state_t' type-id='type-id-368' id='type-id-264'/>
    <typedef-decl name='tfo_st' type-id='type-id-369' id='type-id-303'/>
    <typedef-decl name='time_t' type-id='type-id-46' id='type-id-272'/>
    <typedef-decl name='tls13_ticket_st' type-id='type-id-370' id='type-id-309'/>
    <typedef-decl name='transport_t' type-id='type-id-371' id='type-id-293'/>
    <typedef-decl name='uint16_t' type-id='type-id-372' id='type-id-269'/>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='16' id='type-id-292'>
      <subrange length='2' type-id='type-id-12' id='type-id-142'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='256' id='type-id-301'>
      <subrange length='32' type-id='type-id-12' id='type-id-373'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='384' id='type-id-313'>
      <subrange length='48' type-id='type-id-12' id='type-id-374'/>
    </array-type-def>
    <union-decl name='__anonymous_union__2' size-in-bits='8576' is-anonymous='yes' visibility='default' id='type-id-255'>
      <data-member access='private'>
        <var-decl name='tls13' type-id='type-id-375' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='tls12' type-id='type-id-376' visibility='default'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='288' id='type-id-295'>
      <subrange length='36' type-id='type-id-12' id='type-id-377'/>
    </array-type-def>
    <class-decl name='auth_cred_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='algorithm' type-id='type-id-258' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='credentials' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-259' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='binder_data_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prf' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='psk' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='idx' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='resumption' type-id='type-id-135' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_buffer_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-341'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocd' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-133' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_length' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_priority_st' size-in-bits='41792' is-struct='yes' visibility='default' id='type-id-332'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='protocol' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='client_ctype' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='server_ctype' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='_cipher' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='_mac' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10400'>
        <var-decl name='_kx' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='_sign_algo' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14560'>
        <var-decl name='_supported_ecc' type-id='type-id-378' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16640'>
        <var-decl name='groups' type-id='type-id-379' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20800'>
        <var-decl name='sigalg' type-id='type-id-380' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24960'>
        <var-decl name='cs' type-id='type-id-381' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41408'>
        <var-decl name='no_extensions' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41440'>
        <var-decl name='sr' type-id='type-id-382' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41472'>
        <var-decl name='min_record_version' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41480'>
        <var-decl name='server_precedence' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41488'>
        <var-decl name='allow_server_key_usage_violation' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41496'>
        <var-decl name='no_tickets' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41504'>
        <var-decl name='have_cbc' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41512'>
        <var-decl name='have_psk' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41520'>
        <var-decl name='force_etm' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41536'>
        <var-decl name='additional_verify_flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41568'>
        <var-decl name='fallback' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41600'>
        <var-decl name='level' type-id='type-id-383' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41632'>
        <var-decl name='_allow_large_records' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41640'>
        <var-decl name='_allow_small_records' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41648'>
        <var-decl name='_no_etm' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41656'>
        <var-decl name='_no_ext_master_secret' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41664'>
        <var-decl name='_allow_key_usage_violation' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41672'>
        <var-decl name='_allow_wrong_pms' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41680'>
        <var-decl name='_dumbfw' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41696'>
        <var-decl name='_dh_prime_bits' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_privkey_st' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-333'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-384' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pk_algorithm' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-386' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pin' type-id='type-id-387' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_supplemental_entry_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-334'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-388' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='supp_recv_func' type-id='type-id-389' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supp_send_func' type-id='type-id-390' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='hello_ext_entry_st' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_struct' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tls_id' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gid' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='client_parse_point' type-id='type-id-391' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='server_parse_point' type-id='type-id-391' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='validity' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recv_func' type-id='type-id-392' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_func' type-id='type-id-393' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='deinit_func' type-id='type-id-394' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pack_func' type-id='type-id-395' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unpack_func' type-id='type-id-396' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cannot_be_overriden' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mbuffer_head_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-397' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tail' type-id='type-id-397' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='byte_length' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='record_parameters_st' size-in-bits='5504' is-struct='yes' visibility='default' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='epoch' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='initialized' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cipher' type-id='type-id-398' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='etm' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mac' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dtls_sw_next' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dtls_sw_bits' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dtls_sw_have_recv' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='read' type-id='type-id-399' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='write' type-id='type-id-399' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='usage_cnt' type-id='type-id-14' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='tfo_st' size-in-bits='1216' is-struct='yes' visibility='default' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='connect_only' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='connect_addr' type-id='type-id-400' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='connect_addrlen' type-id='type-id-401' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='8576' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-376'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ecdh' type-id='type-id-402' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='dh' type-id='type-id-403' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8000'>
        <var-decl name='srp' type-id='type-id-404' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-294' visibility='default' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dcookie' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hsk_write_seq' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='hsk_read_seq' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mtu' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flight_init' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='last_flight' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hsk_hello_verify_requests' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='actual_retrans_timeout_ms' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='async_term' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_retransmit' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='packets_dropped' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priv' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resumed_priv' type-id='type-id-405' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='resumed_set' type-id='type-id-135' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-300' visibility='default' id='type-id-358'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-406' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='3136' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-309' visibility='default' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arrival_time' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='creation_time' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lifetime' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='age_add' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nonce' type-id='type-id-407' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='nonce_size' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='prf' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='resumption_master_secret' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='ticket' type-id='type-id-257' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='4128' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-375'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='temp_secret' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='temp_secret_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='e_ckey' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='hs_ckey' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='hs_skey' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='ap_ckey' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='ap_skey' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='ap_expkey' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='ap_rms' type-id='type-id-180' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-257' visibility='default' id='type-id-345'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-408' const='yes' id='type-id-324'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-325'/>
    <qualified-type-def type-id='type-id-410' const='yes' id='type-id-326'/>
    <qualified-type-def type-id='type-id-411' const='yes' id='type-id-327'/>
    <qualified-type-def type-id='type-id-412' const='yes' id='type-id-328'/>
    <enum-decl name='__anonymous_enum__13' is-anonymous='yes' id='type-id-342'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_CERT_IGNORE' value='0'/>
      <enumerator name='GNUTLS_CERT_REQUEST' value='1'/>
      <enumerator name='GNUTLS_CERT_REQUIRE' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__15' is-anonymous='yes' id='type-id-350'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_EXT_FLAG_OVERRIDE_INTERNAL' value='1'/>
      <enumerator name='GNUTLS_EXT_FLAG_CLIENT_HELLO' value='2'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS12_SERVER_HELLO' value='4'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS13_SERVER_HELLO' value='8'/>
      <enumerator name='GNUTLS_EXT_FLAG_EE' value='16'/>
      <enumerator name='GNUTLS_EXT_FLAG_HRR' value='32'/>
      <enumerator name='GNUTLS_EXT_FLAG_IGNORE_CLIENT_REQUEST' value='64'/>
      <enumerator name='GNUTLS_EXT_FLAG_TLS' value='128'/>
      <enumerator name='GNUTLS_EXT_FLAG_DTLS' value='256'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__17' is-anonymous='yes' id='type-id-344'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_CRD_CERTIFICATE' value='1'/>
      <enumerator name='GNUTLS_CRD_ANON' value='2'/>
      <enumerator name='GNUTLS_CRD_SRP' value='3'/>
      <enumerator name='GNUTLS_CRD_PSK' value='4'/>
      <enumerator name='GNUTLS_CRD_IA' value='5'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__3' is-anonymous='yes' id='type-id-343'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_CRT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CRT_X509' value='1'/>
      <enumerator name='GNUTLS_CRT_OPENPGP' value='2'/>
      <enumerator name='GNUTLS_CRT_RAWPK' value='3'/>
      <enumerator name='GNUTLS_CRT_MAX' value='3'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__7' is-anonymous='yes' id='type-id-356'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_SIGN_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA1' value='1'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA' value='1'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA1' value='2'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA' value='2'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD5' value='3'/>
      <enumerator name='GNUTLS_SIGN_RSA_MD2' value='4'/>
      <enumerator name='GNUTLS_SIGN_RSA_RMD160' value='5'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA256' value='6'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA384' value='7'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA512' value='8'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA224' value='9'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA224' value='10'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA256' value='11'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA1' value='12'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA224' value='13'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA256' value='14'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA384' value='15'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA512' value='16'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA384' value='17'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA512' value='18'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_224' value='20'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_256' value='21'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_384' value='22'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SHA3_512' value='23'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_224' value='24'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_256' value='25'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_384' value='26'/>
      <enumerator name='GNUTLS_SIGN_DSA_SHA3_512' value='27'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_224' value='28'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_256' value='29'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_384' value='30'/>
      <enumerator name='GNUTLS_SIGN_RSA_SHA3_512' value='31'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA256' value='32'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA384' value='33'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_SHA512' value='34'/>
      <enumerator name='GNUTLS_SIGN_EDDSA_ED25519' value='35'/>
      <enumerator name='GNUTLS_SIGN_RSA_RAW' value='36'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP256R1_SHA256' value='37'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP384R1_SHA384' value='38'/>
      <enumerator name='GNUTLS_SIGN_ECDSA_SECP521R1_SHA512' value='39'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA256' value='40'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA384' value='41'/>
      <enumerator name='GNUTLS_SIGN_RSA_PSS_RSAE_SHA512' value='42'/>
      <enumerator name='GNUTLS_SIGN_GOST_94' value='43'/>
      <enumerator name='GNUTLS_SIGN_GOST_256' value='44'/>
      <enumerator name='GNUTLS_SIGN_GOST_512' value='45'/>
      <enumerator name='GNUTLS_SIGN_EDDSA_ED448' value='46'/>
      <enumerator name='GNUTLS_SIGN_MAX' value='46'/>
    </enum-decl>
    <enum-decl name='bye_state_t' id='type-id-338'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='BYE_STATE0' value='0'/>
      <enumerator name='BYE_STATE1' value='1'/>
      <enumerator name='BYE_STATE2' value='2'/>
    </enum-decl>
    <enum-decl name='handshake_state_t' id='type-id-360'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='STATE0' value='0'/>
      <enumerator name='STATE1' value='1'/>
      <enumerator name='STATE2' value='2'/>
      <enumerator name='STATE3' value='3'/>
      <enumerator name='STATE4' value='4'/>
      <enumerator name='STATE5' value='5'/>
      <enumerator name='STATE6' value='6'/>
      <enumerator name='STATE7' value='7'/>
      <enumerator name='STATE8' value='8'/>
      <enumerator name='STATE9' value='9'/>
      <enumerator name='STATE10' value='10'/>
      <enumerator name='STATE11' value='11'/>
      <enumerator name='STATE12' value='12'/>
      <enumerator name='STATE13' value='13'/>
      <enumerator name='STATE14' value='14'/>
      <enumerator name='STATE15' value='15'/>
      <enumerator name='STATE16' value='16'/>
      <enumerator name='STATE17' value='17'/>
      <enumerator name='STATE18' value='18'/>
      <enumerator name='STATE19' value='19'/>
      <enumerator name='STATE20' value='20'/>
      <enumerator name='STATE21' value='21'/>
      <enumerator name='STATE22' value='22'/>
      <enumerator name='STATE30' value='30'/>
      <enumerator name='STATE31' value='31'/>
      <enumerator name='STATE40' value='40'/>
      <enumerator name='STATE41' value='41'/>
      <enumerator name='STATE50' value='50'/>
      <enumerator name='STATE90' value='90'/>
      <enumerator name='STATE91' value='91'/>
      <enumerator name='STATE92' value='92'/>
      <enumerator name='STATE93' value='93'/>
      <enumerator name='STATE94' value='94'/>
      <enumerator name='STATE99' value='99'/>
      <enumerator name='STATE100' value='100'/>
      <enumerator name='STATE101' value='101'/>
      <enumerator name='STATE102' value='102'/>
      <enumerator name='STATE103' value='103'/>
      <enumerator name='STATE104' value='104'/>
      <enumerator name='STATE105' value='105'/>
      <enumerator name='STATE106' value='106'/>
      <enumerator name='STATE107' value='107'/>
      <enumerator name='STATE108' value='108'/>
      <enumerator name='STATE109' value='109'/>
      <enumerator name='STATE110' value='110'/>
      <enumerator name='STATE111' value='111'/>
      <enumerator name='STATE112' value='112'/>
      <enumerator name='STATE113' value='113'/>
      <enumerator name='STATE114' value='114'/>
      <enumerator name='STATE115' value='115'/>
      <enumerator name='STATE150' value='116'/>
    </enum-decl>
    <enum-decl name='heartbeat_state_t' id='type-id-361'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='SHB_SEND1' value='0'/>
      <enumerator name='SHB_SEND2' value='1'/>
      <enumerator name='SHB_RECV' value='2'/>
    </enum-decl>
    <enum-decl name='reauth_state_t' id='type-id-364'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='REAUTH_STATE0' value='0'/>
      <enumerator name='REAUTH_STATE1' value='1'/>
      <enumerator name='REAUTH_STATE2' value='2'/>
      <enumerator name='REAUTH_STATE3' value='3'/>
      <enumerator name='REAUTH_STATE4' value='4'/>
      <enumerator name='REAUTH_STATE5' value='5'/>
    </enum-decl>
    <enum-decl name='record_send_state_t' id='type-id-366'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='RECORD_SEND_NORMAL' value='0'/>
      <enumerator name='RECORD_SEND_CORKED' value='1'/>
      <enumerator name='RECORD_SEND_CORKED_TO_KU' value='2'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_1' value='3'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_2' value='4'/>
      <enumerator name='RECORD_SEND_KEY_UPDATE_3' value='5'/>
    </enum-decl>
    <enum-decl name='recv_state_t' id='type-id-367'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='RECV_STATE_0' value='0'/>
      <enumerator name='RECV_STATE_DTLS_RETRANSMIT' value='1'/>
      <enumerator name='RECV_STATE_FALSE_START_HANDLING' value='2'/>
      <enumerator name='RECV_STATE_FALSE_START' value='3'/>
      <enumerator name='RECV_STATE_ASYNC_HANDSHAKE' value='4'/>
      <enumerator name='RECV_STATE_EARLY_START_HANDLING' value='5'/>
      <enumerator name='RECV_STATE_EARLY_START' value='6'/>
      <enumerator name='RECV_STATE_REHANDSHAKE' value='7'/>
      <enumerator name='RECV_STATE_REAUTH' value='8'/>
    </enum-decl>
    <enum-decl name='send_ticket_state_t' id='type-id-368'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='TICKET_STATE0' value='0'/>
      <enumerator name='TICKET_STATE1' value='1'/>
    </enum-decl>
    <enum-decl name='transport_t' id='type-id-371'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_STREAM' value='0'/>
      <enumerator name='GNUTLS_DGRAM' value='1'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-340'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-353'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-355'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-346'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-348'/>
    <typedef-decl name='__int16_t' type-id='type-id-72' id='type-id-362'/>
    <typedef-decl name='__uint16_t' type-id='type-id-38' id='type-id-372'/>
    <typedef-decl name='gnutls_certificate_verify_function' type-id='type-id-414' id='type-id-329'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-347'/>
    <typedef-decl name='gnutls_ocsp_data_st' type-id='type-id-423' id='type-id-330'/>
    <typedef-decl name='gnutls_pcert_st' type-id='type-id-424' id='type-id-331'/>
    <typedef-decl name='gnutls_pk_params_st' type-id='type-id-425' id='type-id-322'/>
    <typedef-decl name='gnutls_stek_rotation_callback_t' type-id='type-id-426' id='type-id-323'/>
    <typedef-decl name='handshake_buffer_st' type-id='type-id-427' id='type-id-335'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-359'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-354'/>
    <class-decl name='gnutls_anti_replay_st' size-in-bits='320' is-struct='yes' visibility='default' id='type-id-413'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='window' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start_time' type-id='type-id-31' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='db_add_func' type-id='type-id-430' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='db_ptr' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_cipher_suite_entry_st' size-in-bits='384' is-struct='yes' visibility='default' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-431' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='block_algorithm' type-id='type-id-237' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='kx_algorithm' type-id='type-id-432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mac_algorithm' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='min_version' type-id='type-id-433' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='max_version' type-id='type-id-433' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='min_dtls_version' type-id='type-id-433' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='max_dtls_version' type-id='type-id-433' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='prf' type-id='type-id-234' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_ocsp_data_st' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-423'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='response' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='exptime' type-id='type-id-272' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='padding' type-id='type-id-434' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pcert_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-424'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pubkey' type-id='type-id-435' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cert' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='type' type-id='type-id-314' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mod_auth_st_int' size-in-bits='832' is-struct='yes' visibility='default' id='type-id-411'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gnutls_generate_server_certificate' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gnutls_generate_client_certificate' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gnutls_generate_server_kx' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='gnutls_generate_client_kx' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gnutls_generate_client_crt_vrfy' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='gnutls_generate_server_crt_request' type-id='type-id-436' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='gnutls_process_server_certificate' type-id='type-id-437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='gnutls_process_client_certificate' type-id='type-id-437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='gnutls_process_server_kx' type-id='type-id-437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='gnutls_process_client_kx' type-id='type-id-437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='gnutls_process_client_crt_vrfy' type-id='type-id-437' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='gnutls_process_server_crt_request' type-id='type-id-437' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pin_info_st' size-in-bits='128' is-struct='yes' visibility='default' id='type-id-387'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb' type-id='type-id-438' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' size-in-bits='1024' is-struct='yes' visibility='default' id='type-id-400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-439' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-440' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-12' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='3840' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-322' visibility='default' id='type-id-425'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-441' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='params_nr' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='pkflags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='qbits' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='curve' type-id='type-id-442' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dh_group' type-id='type-id-443' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='gost_params' type-id='type-id-444' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='raw_pub' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='raw_priv' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='seed_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='seed' type-id='type-id-445' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='palgo' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='spki' type-id='type-id-446' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='algo' type-id='type-id-385' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-404'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srp_key' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srp_g' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='srp_p' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='A' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='B' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='u' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='b' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='a' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='x' type-id='type-id-447' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-335' visibility='default' id='type-id-427'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='htype' type-id='type-id-448' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rtype' type-id='type-id-448' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='sequence' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_offset' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='end_offset' type-id='type-id-88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='header' type-id='type-id-449' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='header_size' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data' type-id='type-id-262' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='3904' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='client_Y' type-id='type-id-447' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='4096' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-402'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='x' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='y' type-id='type-id-447' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='raw' type-id='type-id-257' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-397'/>
    <typedef-decl name='ciphersuite_list_st' type-id='type-id-452' id='type-id-381'/>
    <typedef-decl name='gnutls_ext_deinit_data_func' type-id='type-id-453' id='type-id-394'/>
    <typedef-decl name='gnutls_ext_pack_func' type-id='type-id-454' id='type-id-395'/>
    <typedef-decl name='gnutls_ext_parse_type_t' type-id='type-id-455' id='type-id-391'/>
    <typedef-decl name='gnutls_ext_priv_data_t' type-id='type-id-11' id='type-id-405'/>
    <typedef-decl name='gnutls_ext_recv_func' type-id='type-id-456' id='type-id-392'/>
    <typedef-decl name='gnutls_ext_send_func' type-id='type-id-457' id='type-id-393'/>
    <typedef-decl name='gnutls_ext_unpack_func' type-id='type-id-458' id='type-id-396'/>
    <typedef-decl name='gnutls_group_entry_st' type-id='type-id-459' id='type-id-409'/>
    <typedef-decl name='gnutls_pk_algorithm_t' type-id='type-id-460' id='type-id-385'/>
    <typedef-decl name='gnutls_privkey_type_t' type-id='type-id-461' id='type-id-384'/>
    <typedef-decl name='gnutls_sec_param_t' type-id='type-id-462' id='type-id-383'/>
    <typedef-decl name='gnutls_supp_recv_func' type-id='type-id-456' id='type-id-389'/>
    <typedef-decl name='gnutls_supp_send_func' type-id='type-id-457' id='type-id-390'/>
    <typedef-decl name='gnutls_supplemental_data_format_type_t' type-id='type-id-463' id='type-id-388'/>
    <typedef-decl name='gnutls_vdata_types_t' type-id='type-id-464' id='type-id-406'/>
    <typedef-decl name='group_list_st' type-id='type-id-465' id='type-id-379'/>
    <typedef-decl name='mac_entry_st' type-id='type-id-466' id='type-id-410'/>
    <typedef-decl name='priority_st' type-id='type-id-467' id='type-id-378'/>
    <typedef-decl name='record_state_st' type-id='type-id-468' id='type-id-399'/>
    <typedef-decl name='safe_renegotiation_t' type-id='type-id-469' id='type-id-382'/>
    <typedef-decl name='sign_algo_list_st' type-id='type-id-470' id='type-id-380'/>
    <typedef-decl name='socklen_t' type-id='type-id-471' id='type-id-401'/>
    <typedef-decl name='version_entry_st' type-id='type-id-472' id='type-id-412'/>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='2040' id='type-id-407'>
      <subrange length='255' type-id='type-id-12' id='type-id-473'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='576' is-anonymous='yes' visibility='default' id='type-id-386'>
      <data-member access='private'>
        <var-decl name='x509' type-id='type-id-474' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='pkcs11' type-id='type-id-475' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ext' type-id='type-id-476' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-426'/>
    <array-type-def dimensions='1' type-id='type-id-447' size-in-bits='1024' id='type-id-441'>
      <subrange length='16' type-id='type-id-12' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='944' id='type-id-440'>
      <subrange length='118' type-id='type-id-12' id='type-id-478'/>
    </array-type-def>
    <class-decl name='ciphersuite_list_st' size-in-bits='16448' is-struct='yes' visibility='default' id='type-id-452'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-479' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_group_entry_st' size-in-bits='512' is-struct='yes' visibility='default' id='type-id-459'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-443' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prime' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='q' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='generator' type-id='type-id-480' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='q_bits' type-id='type-id-481' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='curve' type-id='type-id-442' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pk' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tls_id' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='group_list_st' size-in-bits='4160' is-struct='yes' visibility='default' id='type-id-465'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-482' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='have_ffdhe' type-id='type-id-263' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mac_entry_st' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-466'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mac_oid' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='output_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nonce_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='placeholder' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='block_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mbuffer_st' size-in-bits='640' is-struct='yes' visibility='default' id='type-id-451'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-397' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-397' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='msg' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='maximum_size' type-id='type-id-9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='uhead_mark' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='type' type-id='type-id-483' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='record_sequence' type-id='type-id-140' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='epoch' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='htype' type-id='type-id-448' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='handshake_sequence' type-id='type-id-269' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='record_state_st' size-in-bits='2496' is-struct='yes' visibility='default' id='type-id-468'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mac_key' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mac_key_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='iv' type-id='type-id-152' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='iv_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='key' type-id='type-id-301' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='key_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='ctx' type-id='type-id-484' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='aead_tag_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='is_aead' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='sequence_number' type-id='type-id-140' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sign_algo_list_st' size-in-bits='4160' is-struct='yes' visibility='default' id='type-id-470'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='type-id-485' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-412' visibility='default' id='type-id-472'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-433' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='age' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='major' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='minor' type-id='type-id-135' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport' type-id='type-id-293' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='supported' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='explicit_iv' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='extensions' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='selectable_sighash' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='selectable_prf' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='obsolete' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='tls13_sem' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='false_start' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='only_extension' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='post_handshake_auth' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='key_shares' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='multi_ocsp' type-id='type-id-263' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tls_sig_sem' type-id='type-id-135' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' id='type-id-476'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sign_func' type-id='type-id-486' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sign_data_func' type-id='type-id-487' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sign_hash_func' type-id='type-id-488' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt_func' type-id='type-id-489' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='decrypt_func2' type-id='type-id-490' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit_func' type-id='type-id-491' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='info_func' type-id='type-id-492' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='userdata' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bits' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='2080' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-378' visibility='default' id='type-id-467'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priorities' type-id='type-id-493' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='num_priorities' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-494' const='yes' id='type-id-450'/>
    <array-type-def dimensions='1' type-id='type-id-134' size-in-bits='16' id='type-id-431'>
      <subrange length='2' type-id='type-id-12' id='type-id-142'/>
    </array-type-def>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-455'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_EXT_ANY' value='0'/>
      <enumerator name='GNUTLS_EXT_APPLICATION' value='1'/>
      <enumerator name='GNUTLS_EXT_TLS' value='2'/>
      <enumerator name='GNUTLS_EXT_MANDATORY' value='3'/>
      <enumerator name='GNUTLS_EXT_NONE' value='4'/>
      <enumerator name='GNUTLS_EXT_VERSION_NEG' value='5'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-461'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_PRIVKEY_X509' value='0'/>
      <enumerator name='GNUTLS_PRIVKEY_OPENPGP' value='1'/>
      <enumerator name='GNUTLS_PRIVKEY_PKCS11' value='2'/>
      <enumerator name='GNUTLS_PRIVKEY_EXT' value='3'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-463'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_SUPPLEMENTAL_UNKNOWN' value='0'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__11' is-anonymous='yes' id='type-id-469'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='SR_DISABLED' value='0'/>
      <enumerator name='SR_UNSAFE' value='1'/>
      <enumerator name='SR_PARTIAL' value='2'/>
      <enumerator name='SR_SAFE' value='3'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__12' is-anonymous='yes' id='type-id-462'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_SEC_PARAM_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_SEC_PARAM_INSECURE' value='5'/>
      <enumerator name='GNUTLS_SEC_PARAM_EXPORT' value='10'/>
      <enumerator name='GNUTLS_SEC_PARAM_VERY_WEAK' value='15'/>
      <enumerator name='GNUTLS_SEC_PARAM_WEAK' value='20'/>
      <enumerator name='GNUTLS_SEC_PARAM_LOW' value='25'/>
      <enumerator name='GNUTLS_SEC_PARAM_LEGACY' value='30'/>
      <enumerator name='GNUTLS_SEC_PARAM_MEDIUM' value='35'/>
      <enumerator name='GNUTLS_SEC_PARAM_HIGH' value='40'/>
      <enumerator name='GNUTLS_SEC_PARAM_ULTRA' value='45'/>
      <enumerator name='GNUTLS_SEC_PARAM_FUTURE' value='50'/>
      <enumerator name='GNUTLS_SEC_PARAM_MAX' value='50'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__14' is-anonymous='yes' id='type-id-464'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_DT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_DT_DNS_HOSTNAME' value='1'/>
      <enumerator name='GNUTLS_DT_KEY_PURPOSE_OID' value='2'/>
      <enumerator name='GNUTLS_DT_RFC822NAME' value='3'/>
      <enumerator name='GNUTLS_DT_IP_ADDRESS' value='4'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__6' is-anonymous='yes' id='type-id-460'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_PK_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_PK_RSA' value='1'/>
      <enumerator name='GNUTLS_PK_DSA' value='2'/>
      <enumerator name='GNUTLS_PK_DH' value='3'/>
      <enumerator name='GNUTLS_PK_ECDSA' value='4'/>
      <enumerator name='GNUTLS_PK_ECDH_X25519' value='5'/>
      <enumerator name='GNUTLS_PK_RSA_PSS' value='6'/>
      <enumerator name='GNUTLS_PK_EDDSA_ED25519' value='7'/>
      <enumerator name='GNUTLS_PK_GOST_01' value='8'/>
      <enumerator name='GNUTLS_PK_GOST_12_256' value='9'/>
      <enumerator name='GNUTLS_PK_GOST_12_512' value='10'/>
      <enumerator name='GNUTLS_PK_ECDH_X448' value='11'/>
      <enumerator name='GNUTLS_PK_EDDSA_ED448' value='12'/>
      <enumerator name='GNUTLS_PK_MAX' value='12'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-458'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-436'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-437'/>
    <typedef-decl name='__socklen_t' type-id='type-id-10' id='type-id-471'/>
    <typedef-decl name='bigint_t' type-id='type-id-11' id='type-id-447'/>
    <typedef-decl name='gnutls_db_add_func' type-id='type-id-501' id='type-id-430'/>
    <typedef-decl name='gnutls_ecc_curve_t' type-id='type-id-502' id='type-id-442'/>
    <typedef-decl name='gnutls_gost_paramset_t' type-id='type-id-503' id='type-id-444'/>
    <typedef-decl name='gnutls_group_t' type-id='type-id-504' id='type-id-443'/>
    <typedef-decl name='gnutls_handshake_description_t' type-id='type-id-505' id='type-id-448'/>
    <typedef-decl name='gnutls_kx_algorithm_t' type-id='type-id-506' id='type-id-432'/>
    <typedef-decl name='gnutls_pin_callback_t' type-id='type-id-507' id='type-id-438'/>
    <typedef-decl name='gnutls_pkcs11_privkey_t' type-id='type-id-508' id='type-id-475'/>
    <typedef-decl name='gnutls_protocol_t' type-id='type-id-509' id='type-id-433'/>
    <typedef-decl name='gnutls_pubkey_t' type-id='type-id-510' id='type-id-435'/>
    <typedef-decl name='gnutls_x509_privkey_t' type-id='type-id-511' id='type-id-474'/>
    <typedef-decl name='gnutls_x509_spki_st' type-id='type-id-512' id='type-id-446'/>
    <typedef-decl name='sa_family_t' type-id='type-id-38' id='type-id-439'/>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='96' id='type-id-449'>
      <subrange length='12' type-id='type-id-12' id='type-id-513'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='2048' id='type-id-445'>
      <subrange length='256' type-id='type-id-12' id='type-id-139'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='256' id='type-id-434'>
      <subrange length='32' type-id='type-id-12' id='type-id-373'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-453'/>
    <class-decl name='gnutls_x509_spki_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-512'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_dig' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='salt_size' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='legacy' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dsa_dig' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-311' size-in-bits='16384' id='type-id-479'>
      <subrange length='256' type-id='type-id-12' id='type-id-139'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' id='type-id-480'/>
    <array-type-def dimensions='1' type-id='type-id-308' size-in-bits='4096' id='type-id-482'>
      <subrange length='64' type-id='type-id-12' id='type-id-90'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-516' size-in-bits='4096' id='type-id-485'>
      <subrange length='64' type-id='type-id-12' id='type-id-90'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' id='type-id-481'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' id='type-id-506'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_KX_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_KX_RSA' value='1'/>
      <enumerator name='GNUTLS_KX_DHE_DSS' value='2'/>
      <enumerator name='GNUTLS_KX_DHE_RSA' value='3'/>
      <enumerator name='GNUTLS_KX_ANON_DH' value='4'/>
      <enumerator name='GNUTLS_KX_SRP' value='5'/>
      <enumerator name='GNUTLS_KX_RSA_EXPORT' value='6'/>
      <enumerator name='GNUTLS_KX_SRP_RSA' value='7'/>
      <enumerator name='GNUTLS_KX_SRP_DSS' value='8'/>
      <enumerator name='GNUTLS_KX_PSK' value='9'/>
      <enumerator name='GNUTLS_KX_DHE_PSK' value='10'/>
      <enumerator name='GNUTLS_KX_ANON_ECDH' value='11'/>
      <enumerator name='GNUTLS_KX_ECDHE_RSA' value='12'/>
      <enumerator name='GNUTLS_KX_ECDHE_ECDSA' value='13'/>
      <enumerator name='GNUTLS_KX_ECDHE_PSK' value='14'/>
      <enumerator name='GNUTLS_KX_RSA_PSK' value='15'/>
      <enumerator name='GNUTLS_KX_VKO_GOST_12' value='16'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__16' is-anonymous='yes' id='type-id-503'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_TC26_Z' value='1'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_A' value='2'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_B' value='3'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_C' value='4'/>
      <enumerator name='GNUTLS_GOST_PARAMSET_CP_D' value='5'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__2' is-anonymous='yes' id='type-id-509'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_SSL3' value='1'/>
      <enumerator name='GNUTLS_TLS1_0' value='2'/>
      <enumerator name='GNUTLS_TLS1' value='2'/>
      <enumerator name='GNUTLS_TLS1_1' value='3'/>
      <enumerator name='GNUTLS_TLS1_2' value='4'/>
      <enumerator name='GNUTLS_TLS1_3' value='5'/>
      <enumerator name='GNUTLS_DTLS0_9' value='200'/>
      <enumerator name='GNUTLS_DTLS1_0' value='201'/>
      <enumerator name='GNUTLS_DTLS1_2' value='202'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MIN' value='200'/>
      <enumerator name='GNUTLS_DTLS_VERSION_MAX' value='202'/>
      <enumerator name='GNUTLS_TLS_VERSION_MAX' value='5'/>
      <enumerator name='GNUTLS_VERSION_UNKNOWN' value='255'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__4' is-anonymous='yes' id='type-id-504'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_GROUP_INVALID' value='0'/>
      <enumerator name='GNUTLS_GROUP_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_GROUP_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_GROUP_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_GROUP_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_GROUP_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_GROUP_X25519' value='6'/>
      <enumerator name='GNUTLS_GROUP_X448' value='20'/>
      <enumerator name='GNUTLS_GROUP_GC256A' value='16'/>
      <enumerator name='GNUTLS_GROUP_GC256B' value='17'/>
      <enumerator name='GNUTLS_GROUP_GC256C' value='18'/>
      <enumerator name='GNUTLS_GROUP_GC256D' value='19'/>
      <enumerator name='GNUTLS_GROUP_GC512A' value='13'/>
      <enumerator name='GNUTLS_GROUP_GC512B' value='14'/>
      <enumerator name='GNUTLS_GROUP_GC512C' value='15'/>
      <enumerator name='GNUTLS_GROUP_FFDHE2048' value='256'/>
      <enumerator name='GNUTLS_GROUP_FFDHE3072' value='257'/>
      <enumerator name='GNUTLS_GROUP_FFDHE4096' value='258'/>
      <enumerator name='GNUTLS_GROUP_FFDHE8192' value='259'/>
      <enumerator name='GNUTLS_GROUP_FFDHE6144' value='260'/>
      <enumerator name='GNUTLS_GROUP_MAX' value='260'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__5' is-anonymous='yes' id='type-id-502'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_ECC_CURVE_INVALID' value='0'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP224R1' value='1'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP256R1' value='2'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP384R1' value='3'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP521R1' value='4'/>
      <enumerator name='GNUTLS_ECC_CURVE_SECP192R1' value='5'/>
      <enumerator name='GNUTLS_ECC_CURVE_X25519' value='6'/>
      <enumerator name='GNUTLS_ECC_CURVE_ED25519' value='7'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPA' value='8'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPB' value='9'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPC' value='10'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXA' value='11'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256CPXB' value='12'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512A' value='13'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512B' value='14'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST512C' value='15'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256A' value='16'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256B' value='17'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256C' value='18'/>
      <enumerator name='GNUTLS_ECC_CURVE_GOST256D' value='19'/>
      <enumerator name='GNUTLS_ECC_CURVE_X448' value='20'/>
      <enumerator name='GNUTLS_ECC_CURVE_ED448' value='21'/>
      <enumerator name='GNUTLS_ECC_CURVE_MAX' value='21'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__9' is-anonymous='yes' id='type-id-505'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_REQUEST' value='0'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO' value='1'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO' value='2'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_VERIFY_REQUEST' value='3'/>
      <enumerator name='GNUTLS_HANDSHAKE_NEW_SESSION_TICKET' value='4'/>
      <enumerator name='GNUTLS_HANDSHAKE_END_OF_EARLY_DATA' value='5'/>
      <enumerator name='GNUTLS_HANDSHAKE_ENCRYPTED_EXTENSIONS' value='8'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_PKT' value='11'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_KEY_EXCHANGE' value='12'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_REQUEST' value='13'/>
      <enumerator name='GNUTLS_HANDSHAKE_SERVER_HELLO_DONE' value='14'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_VERIFY' value='15'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_KEY_EXCHANGE' value='16'/>
      <enumerator name='GNUTLS_HANDSHAKE_FINISHED' value='20'/>
      <enumerator name='GNUTLS_HANDSHAKE_CERTIFICATE_STATUS' value='22'/>
      <enumerator name='GNUTLS_HANDSHAKE_SUPPLEMENTAL' value='23'/>
      <enumerator name='GNUTLS_HANDSHAKE_KEY_UPDATE' value='24'/>
      <enumerator name='GNUTLS_HANDSHAKE_CHANGE_CIPHER_SPEC' value='254'/>
      <enumerator name='GNUTLS_HANDSHAKE_CLIENT_HELLO_V2' value='1024'/>
      <enumerator name='GNUTLS_HANDSHAKE_HELLO_RETRY_REQUEST' value='1025'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' id='type-id-508'/>
    <pointer-type-def type-id='type-id-519' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-511'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-507'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-501'/>
    <typedef-decl name='cipher_entry_st' type-id='type-id-523' id='type-id-494'/>
    <typedef-decl name='content_type_t' type-id='type-id-524' id='type-id-483'/>
    <typedef-decl name='gnutls_privkey_decrypt_func' type-id='type-id-525' id='type-id-489'/>
    <typedef-decl name='gnutls_privkey_decrypt_func2' type-id='type-id-526' id='type-id-490'/>
    <typedef-decl name='gnutls_privkey_deinit_func' type-id='type-id-527' id='type-id-491'/>
    <typedef-decl name='gnutls_privkey_info_func' type-id='type-id-528' id='type-id-492'/>
    <typedef-decl name='gnutls_privkey_sign_data_func' type-id='type-id-529' id='type-id-487'/>
    <typedef-decl name='gnutls_privkey_sign_func' type-id='type-id-525' id='type-id-486'/>
    <typedef-decl name='gnutls_privkey_sign_hash_func' type-id='type-id-529' id='type-id-488'/>
    <union-decl name='__anonymous_union__' size-in-bits='1344' is-anonymous='yes' visibility='default' id='type-id-484'>
      <data-member access='private'>
        <var-decl name='tls12' type-id='type-id-530' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='aead' type-id='type-id-531' visibility='default'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-10' size-in-bits='2048' id='type-id-493'>
      <subrange length='64' type-id='type-id-12' id='type-id-90'/>
    </array-type-def>
    <class-decl name='cipher_entry_st' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-523'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-237' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='blocksize' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='keysize' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type' type-id='type-id-532' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='implicit_iv' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='explicit_iv' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cipher_iv' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='tagsize' type-id='type-id-269' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pkcs11_privkey_st' size-in-bits='3392' is-struct='yes' visibility='default' id='type-id-518'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pk_algorithm' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsa_pss_ok' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bits' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uinfo' type-id='type-id-533' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='url' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sinfo' type-id='type-id-534' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='ref' type-id='type-id-535' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='reauth' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='mutex' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='pin' type-id='type-id-387' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_pubkey_st' size-in-bits='4096' is-struct='yes' visibility='default' id='type-id-519'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bits' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='params' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='key_usage' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='pin' type-id='type-id-387' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_x509_privkey_int' size-in-bits='4096' is-struct='yes' visibility='default' id='type-id-520'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-322' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='expanded' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='key' type-id='type-id-536' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='pin' type-id='type-id-387' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-257' const='yes' id='type-id-515'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-517'/>
    <enum-decl name='content_type_t' id='type-id-524'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='GNUTLS_CHANGE_CIPHER_SPEC' value='20'/>
      <enumerator name='GNUTLS_ALERT' value='21'/>
      <enumerator name='GNUTLS_HANDSHAKE' value='22'/>
      <enumerator name='GNUTLS_APPLICATION_DATA' value='23'/>
      <enumerator name='GNUTLS_HEARTBEAT' value='24'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-529'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-528'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-526'/>
    <typedef-decl name='api_aead_cipher_hd_st' type-id='type-id-542' id='type-id-531'/>
    <typedef-decl name='auth_cipher_hd_st' type-id='type-id-543' id='type-id-530'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-527'/>
    <class-decl name='api_aead_cipher_hd_st' size-in-bits='704' is-struct='yes' visibility='default' id='type-id-542'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx_enc' type-id='type-id-545' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pkcs11_session_info' size-in-bits='2816' is-struct='yes' visibility='default' id='type-id-534'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module' type-id='type-id-546' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tinfo' type-id='type-id-547' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='slot_info' type-id='type-id-548' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='pks' type-id='type-id-549' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='sid' type-id='type-id-550' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='init' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='trusted' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='1344' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-530' visibility='default' id='type-id-543'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cipher' type-id='type-id-545' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mac' type-id='type-id-551' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='is_mac' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='continuous_mac' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='non_null' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='etm' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tag_size' type-id='type-id-9' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-537'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-533'/>
    <typedef-decl name='asn1_node' type-id='type-id-554' id='type-id-536'/>
    <typedef-decl name='cipher_type_t' type-id='type-id-555' id='type-id-532'/>
    <typedef-decl name='ck_object_handle_t' type-id='type-id-12' id='type-id-535'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-554'/>
    <pointer-type-def type-id='type-id-557' size-in-bits='64' id='type-id-546'/>
    <class-decl name='ck_slot_info' size-in-bits='896' is-struct='yes' visibility='default' id='type-id-548'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot_description' type-id='type-id-558' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='manufacturer_id' type-id='type-id-434' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='flags' type-id='type-id-559' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='hardware_version' type-id='type-id-560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='848'>
        <var-decl name='firmware_version' type-id='type-id-560' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ck_token_info' size-in-bits='1664' is-struct='yes' visibility='default' id='type-id-547'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='label' type-id='type-id-434' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='manufacturer_id' type-id='type-id-434' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='model' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='serial_number' type-id='type-id-149' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='flags' type-id='type-id-559' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='max_session_count' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='session_count' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='max_rw_session_count' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rw_session_count' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='max_pin_len' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='min_pin_len' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='total_public_memory' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='free_public_memory' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='total_private_memory' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='free_private_memory' type-id='type-id-12' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='hardware_version' type-id='type-id-560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1488'>
        <var-decl name='firmware_version' type-id='type-id-560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='utc_time' type-id='type-id-149' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_sign_entry_st' size-in-bits='448' is-struct='yes' visibility='default' id='type-id-552'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='oid' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-315' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pk' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-198' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='priv_pk' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cert_pk' type-id='type-id-385' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='flags' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='curve' type-id='type-id-442' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='aid' type-id='type-id-561' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='slevel' type-id='type-id-562' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='hash_output_size' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='p11_kit_uri' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-553'/>
    <enum-decl name='__anonymous_enum__8' is-anonymous='yes' id='type-id-555'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='CIPHER_STREAM' value='0'/>
      <enumerator name='CIPHER_BLOCK' value='1'/>
      <enumerator name='CIPHER_AEAD' value='2'/>
    </enum-decl>
    <typedef-decl name='cipher_hd_st' type-id='type-id-563' id='type-id-545'/>
    <typedef-decl name='ck_session_handle_t' type-id='type-id-12' id='type-id-549'/>
    <typedef-decl name='ck_slot_id_t' type-id='type-id-12' id='type-id-550'/>
    <union-decl name='__anonymous_union__1' size-in-bits='512' is-anonymous='yes' visibility='default' id='type-id-551'>
      <data-member access='private'>
        <var-decl name='dig' type-id='type-id-564' visibility='default'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='mac' type-id='type-id-565' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='ck_function_list' size-in-bits='4416' is-struct='yes' visibility='default' id='type-id-557'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='type-id-560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='C_Initialize' type-id='type-id-566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='C_Finalize' type-id='type-id-567' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='C_GetInfo' type-id='type-id-568' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='C_GetFunctionList' type-id='type-id-569' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='C_GetSlotList' type-id='type-id-570' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='C_GetSlotInfo' type-id='type-id-571' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='C_GetTokenInfo' type-id='type-id-572' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='C_GetMechanismList' type-id='type-id-573' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='C_GetMechanismInfo' type-id='type-id-574' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='C_InitToken' type-id='type-id-575' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='C_InitPIN' type-id='type-id-576' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='C_SetPIN' type-id='type-id-577' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='C_OpenSession' type-id='type-id-578' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='C_CloseSession' type-id='type-id-579' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='C_CloseAllSessions' type-id='type-id-580' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='C_GetSessionInfo' type-id='type-id-581' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='C_GetOperationState' type-id='type-id-582' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='C_SetOperationState' type-id='type-id-583' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='C_Login' type-id='type-id-584' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='C_Logout' type-id='type-id-585' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='C_CreateObject' type-id='type-id-586' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='C_CopyObject' type-id='type-id-587' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='C_DestroyObject' type-id='type-id-588' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='C_GetObjectSize' type-id='type-id-589' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='C_GetAttributeValue' type-id='type-id-590' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='C_SetAttributeValue' type-id='type-id-591' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='C_FindObjectsInit' type-id='type-id-592' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='C_FindObjects' type-id='type-id-593' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='C_FindObjectsFinal' type-id='type-id-594' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='C_EncryptInit' type-id='type-id-595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='C_Encrypt' type-id='type-id-596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='C_EncryptUpdate' type-id='type-id-597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='C_EncryptFinal' type-id='type-id-598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='C_DecryptInit' type-id='type-id-599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='C_Decrypt' type-id='type-id-600' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='C_DecryptUpdate' type-id='type-id-601' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='C_DecryptFinal' type-id='type-id-602' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='C_DigestInit' type-id='type-id-603' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='C_Digest' type-id='type-id-604' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='C_DigestUpdate' type-id='type-id-605' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='C_DigestKey' type-id='type-id-606' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='C_DigestFinal' type-id='type-id-607' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='C_SignInit' type-id='type-id-608' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='C_Sign' type-id='type-id-609' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='C_SignUpdate' type-id='type-id-610' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='C_SignFinal' type-id='type-id-611' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='C_SignRecoverInit' type-id='type-id-612' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='C_SignRecover' type-id='type-id-613' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='C_VerifyInit' type-id='type-id-614' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='C_Verify' type-id='type-id-615' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='C_VerifyUpdate' type-id='type-id-616' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='C_VerifyFinal' type-id='type-id-617' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='C_VerifyRecoverInit' type-id='type-id-618' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='C_VerifyRecover' type-id='type-id-619' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='C_DigestEncryptUpdate' type-id='type-id-620' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='C_DecryptDigestUpdate' type-id='type-id-621' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='C_SignEncryptUpdate' type-id='type-id-622' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='C_DecryptVerifyUpdate' type-id='type-id-623' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='C_GenerateKey' type-id='type-id-624' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='C_GenerateKeyPair' type-id='type-id-625' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='C_WrapKey' type-id='type-id-626' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='C_UnwrapKey' type-id='type-id-627' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='C_DeriveKey' type-id='type-id-628' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='C_SeedRandom' type-id='type-id-629' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='C_GenerateRandom' type-id='type-id-630' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='C_GetFunctionStatus' type-id='type-id-631' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='C_CancelFunction' type-id='type-id-632' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='C_WaitForSlotEvent' type-id='type-id-633' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ck_version' size-in-bits='16' is-struct='yes' visibility='default' id='type-id-560'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='major' type-id='type-id-71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='minor' type-id='type-id-71' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='704' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-545' visibility='default' id='type-id-563'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='e' type-id='type-id-398' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='encrypt' type-id='type-id-634' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='decrypt' type-id='type-id-635' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='aead_encrypt' type-id='type-id-636' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='aead_decrypt' type-id='type-id-637' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='auth' type-id='type-id-638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tag' type-id='type-id-639' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='setiv' type-id='type-id-640' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='getiv' type-id='type-id-641' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='deinit' type-id='type-id-642' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-643' const='yes' id='type-id-561'/>
    <typedef-decl name='asn1_node_st' type-id='type-id-644' id='type-id-556'/>
    <typedef-decl name='ck_flags_t' type-id='type-id-12' id='type-id-559'/>
    <typedef-decl name='digest_hd_st' type-id='type-id-645' id='type-id-564'/>
    <typedef-decl name='hash_security_level_t' type-id='type-id-646' id='type-id-562'/>
    <typedef-decl name='mac_hd_st' type-id='type-id-647' id='type-id-565'/>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='512' id='type-id-558'>
      <subrange length='64' type-id='type-id-12' id='type-id-90'/>
    </array-type-def>
    <class-decl name='asn1_node_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-644'/>
    <class-decl name='__anonymous_struct__5' size-in-bits='512' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-564' visibility='default' id='type-id-645'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-648' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='output' type-id='type-id-649' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='deinit' type-id='type-id-650' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='copy' type-id='type-id-651' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='key' type-id='type-id-11' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='keysize' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handle' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='512' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-565' visibility='default' id='type-id-647'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e' type-id='type-id-312' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mac_len' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash' type-id='type-id-648' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='setnonce' type-id='type-id-652' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-649' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='deinit' type-id='type-id-650' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='copy' type-id='type-id-651' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='handle' type-id='type-id-11' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='hash_security_level_t' id='type-id-646'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='_SECURE' value='0'/>
      <enumerator name='_INSECURE_FOR_CERTS' value='1'/>
      <enumerator name='_INSECURE' value='2'/>
    </enum-decl>
    <typedef-decl name='CK_C_CancelFunction' type-id='type-id-653' id='type-id-632'/>
    <typedef-decl name='CK_C_CloseAllSessions' type-id='type-id-654' id='type-id-580'/>
    <typedef-decl name='CK_C_CloseSession' type-id='type-id-653' id='type-id-579'/>
    <typedef-decl name='CK_C_CopyObject' type-id='type-id-655' id='type-id-587'/>
    <typedef-decl name='CK_C_CreateObject' type-id='type-id-656' id='type-id-586'/>
    <typedef-decl name='CK_C_Decrypt' type-id='type-id-657' id='type-id-600'/>
    <typedef-decl name='CK_C_DecryptDigestUpdate' type-id='type-id-657' id='type-id-621'/>
    <typedef-decl name='CK_C_DecryptFinal' type-id='type-id-658' id='type-id-602'/>
    <typedef-decl name='CK_C_DecryptInit' type-id='type-id-659' id='type-id-599'/>
    <typedef-decl name='CK_C_DecryptUpdate' type-id='type-id-657' id='type-id-601'/>
    <typedef-decl name='CK_C_DecryptVerifyUpdate' type-id='type-id-657' id='type-id-623'/>
    <typedef-decl name='CK_C_DeriveKey' type-id='type-id-660' id='type-id-628'/>
    <typedef-decl name='CK_C_DestroyObject' type-id='type-id-661' id='type-id-588'/>
    <typedef-decl name='CK_C_Digest' type-id='type-id-657' id='type-id-604'/>
    <typedef-decl name='CK_C_DigestEncryptUpdate' type-id='type-id-657' id='type-id-620'/>
    <typedef-decl name='CK_C_DigestFinal' type-id='type-id-658' id='type-id-607'/>
    <typedef-decl name='CK_C_DigestInit' type-id='type-id-662' id='type-id-603'/>
    <typedef-decl name='CK_C_DigestKey' type-id='type-id-661' id='type-id-606'/>
    <typedef-decl name='CK_C_DigestUpdate' type-id='type-id-663' id='type-id-605'/>
    <typedef-decl name='CK_C_Encrypt' type-id='type-id-657' id='type-id-596'/>
    <typedef-decl name='CK_C_EncryptFinal' type-id='type-id-658' id='type-id-598'/>
    <typedef-decl name='CK_C_EncryptInit' type-id='type-id-659' id='type-id-595'/>
    <typedef-decl name='CK_C_EncryptUpdate' type-id='type-id-657' id='type-id-597'/>
    <typedef-decl name='CK_C_Finalize' type-id='type-id-664' id='type-id-567'/>
    <typedef-decl name='CK_C_FindObjects' type-id='type-id-665' id='type-id-593'/>
    <typedef-decl name='CK_C_FindObjectsFinal' type-id='type-id-653' id='type-id-594'/>
    <typedef-decl name='CK_C_FindObjectsInit' type-id='type-id-666' id='type-id-592'/>
    <typedef-decl name='CK_C_GenerateKey' type-id='type-id-667' id='type-id-624'/>
    <typedef-decl name='CK_C_GenerateKeyPair' type-id='type-id-668' id='type-id-625'/>
    <typedef-decl name='CK_C_GenerateRandom' type-id='type-id-663' id='type-id-630'/>
    <typedef-decl name='CK_C_GetAttributeValue' type-id='type-id-669' id='type-id-590'/>
    <typedef-decl name='CK_C_GetFunctionList' type-id='type-id-670' id='type-id-569'/>
    <typedef-decl name='CK_C_GetFunctionStatus' type-id='type-id-653' id='type-id-631'/>
    <typedef-decl name='CK_C_GetInfo' type-id='type-id-671' id='type-id-568'/>
    <typedef-decl name='CK_C_GetMechanismInfo' type-id='type-id-672' id='type-id-574'/>
    <typedef-decl name='CK_C_GetMechanismList' type-id='type-id-673' id='type-id-573'/>
    <typedef-decl name='CK_C_GetObjectSize' type-id='type-id-674' id='type-id-589'/>
    <typedef-decl name='CK_C_GetOperationState' type-id='type-id-658' id='type-id-582'/>
    <typedef-decl name='CK_C_GetSessionInfo' type-id='type-id-675' id='type-id-581'/>
    <typedef-decl name='CK_C_GetSlotInfo' type-id='type-id-676' id='type-id-571'/>
    <typedef-decl name='CK_C_GetSlotList' type-id='type-id-677' id='type-id-570'/>
    <typedef-decl name='CK_C_GetTokenInfo' type-id='type-id-678' id='type-id-572'/>
    <typedef-decl name='CK_C_InitPIN' type-id='type-id-663' id='type-id-576'/>
    <typedef-decl name='CK_C_InitToken' type-id='type-id-679' id='type-id-575'/>
    <typedef-decl name='CK_C_Initialize' type-id='type-id-664' id='type-id-566'/>
    <typedef-decl name='CK_C_Login' type-id='type-id-680' id='type-id-584'/>
    <typedef-decl name='CK_C_Logout' type-id='type-id-653' id='type-id-585'/>
    <typedef-decl name='CK_C_OpenSession' type-id='type-id-681' id='type-id-578'/>
    <typedef-decl name='CK_C_SeedRandom' type-id='type-id-663' id='type-id-629'/>
    <typedef-decl name='CK_C_SetAttributeValue' type-id='type-id-669' id='type-id-591'/>
    <typedef-decl name='CK_C_SetOperationState' type-id='type-id-682' id='type-id-583'/>
    <typedef-decl name='CK_C_SetPIN' type-id='type-id-683' id='type-id-577'/>
    <typedef-decl name='CK_C_Sign' type-id='type-id-657' id='type-id-609'/>
    <typedef-decl name='CK_C_SignEncryptUpdate' type-id='type-id-657' id='type-id-622'/>
    <typedef-decl name='CK_C_SignFinal' type-id='type-id-658' id='type-id-611'/>
    <typedef-decl name='CK_C_SignInit' type-id='type-id-659' id='type-id-608'/>
    <typedef-decl name='CK_C_SignRecover' type-id='type-id-657' id='type-id-613'/>
    <typedef-decl name='CK_C_SignRecoverInit' type-id='type-id-659' id='type-id-612'/>
    <typedef-decl name='CK_C_SignUpdate' type-id='type-id-663' id='type-id-610'/>
    <typedef-decl name='CK_C_UnwrapKey' type-id='type-id-684' id='type-id-627'/>
    <typedef-decl name='CK_C_Verify' type-id='type-id-683' id='type-id-615'/>
    <typedef-decl name='CK_C_VerifyFinal' type-id='type-id-663' id='type-id-617'/>
    <typedef-decl name='CK_C_VerifyInit' type-id='type-id-659' id='type-id-614'/>
    <typedef-decl name='CK_C_VerifyRecover' type-id='type-id-657' id='type-id-619'/>
    <typedef-decl name='CK_C_VerifyRecoverInit' type-id='type-id-659' id='type-id-618'/>
    <typedef-decl name='CK_C_VerifyUpdate' type-id='type-id-663' id='type-id-616'/>
    <typedef-decl name='CK_C_WaitForSlotEvent' type-id='type-id-685' id='type-id-633'/>
    <typedef-decl name='CK_C_WrapKey' type-id='type-id-686' id='type-id-626'/>
    <typedef-decl name='aead_cipher_decrypt_func' type-id='type-id-117' id='type-id-637'/>
    <typedef-decl name='aead_cipher_encrypt_func' type-id='type-id-117' id='type-id-636'/>
    <typedef-decl name='cipher_auth_func' type-id='type-id-118' id='type-id-638'/>
    <typedef-decl name='cipher_decrypt_func' type-id='type-id-119' id='type-id-635'/>
    <typedef-decl name='cipher_deinit_func' type-id='type-id-120' id='type-id-642'/>
    <typedef-decl name='cipher_encrypt_func' type-id='type-id-119' id='type-id-634'/>
    <typedef-decl name='cipher_getiv_func' type-id='type-id-118' id='type-id-641'/>
    <typedef-decl name='cipher_setiv_func' type-id='type-id-118' id='type-id-640'/>
    <typedef-decl name='cipher_tag_func' type-id='type-id-122' id='type-id-639'/>
    <typedef-decl name='sign_algorithm_st' type-id='type-id-687' id='type-id-643'/>
    <class-decl name='__anonymous_struct__9' size-in-bits='24' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-643' visibility='default' id='type-id-687'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tls_sem' type-id='type-id-135' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-688' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-689' size-in-bits='64' id='type-id-671'/>
    <pointer-type-def type-id='type-id-690' size-in-bits='64' id='type-id-685'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-653'/>
    <pointer-type-def type-id='type-id-692' size-in-bits='64' id='type-id-666'/>
    <pointer-type-def type-id='type-id-693' size-in-bits='64' id='type-id-656'/>
    <pointer-type-def type-id='type-id-694' size-in-bits='64' id='type-id-662'/>
    <pointer-type-def type-id='type-id-695' size-in-bits='64' id='type-id-668'/>
    <pointer-type-def type-id='type-id-696' size-in-bits='64' id='type-id-667'/>
    <pointer-type-def type-id='type-id-697' size-in-bits='64' id='type-id-659'/>
    <pointer-type-def type-id='type-id-698' size-in-bits='64' id='type-id-660'/>
    <pointer-type-def type-id='type-id-699' size-in-bits='64' id='type-id-686'/>
    <pointer-type-def type-id='type-id-700' size-in-bits='64' id='type-id-684'/>
    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-665'/>
    <pointer-type-def type-id='type-id-702' size-in-bits='64' id='type-id-675'/>
    <pointer-type-def type-id='type-id-703' size-in-bits='64' id='type-id-661'/>
    <pointer-type-def type-id='type-id-704' size-in-bits='64' id='type-id-669'/>
    <pointer-type-def type-id='type-id-705' size-in-bits='64' id='type-id-655'/>
    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-674'/>
    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-680'/>
    <pointer-type-def type-id='type-id-708' size-in-bits='64' id='type-id-663'/>
    <pointer-type-def type-id='type-id-709' size-in-bits='64' id='type-id-658'/>
    <pointer-type-def type-id='type-id-710' size-in-bits='64' id='type-id-682'/>
    <pointer-type-def type-id='type-id-711' size-in-bits='64' id='type-id-683'/>
    <pointer-type-def type-id='type-id-712' size-in-bits='64' id='type-id-657'/>
    <pointer-type-def type-id='type-id-713' size-in-bits='64' id='type-id-654'/>
    <pointer-type-def type-id='type-id-714' size-in-bits='64' id='type-id-673'/>
    <pointer-type-def type-id='type-id-715' size-in-bits='64' id='type-id-676'/>
    <pointer-type-def type-id='type-id-716' size-in-bits='64' id='type-id-678'/>
    <pointer-type-def type-id='type-id-717' size-in-bits='64' id='type-id-681'/>
    <pointer-type-def type-id='type-id-718' size-in-bits='64' id='type-id-672'/>
    <pointer-type-def type-id='type-id-719' size-in-bits='64' id='type-id-679'/>
    <pointer-type-def type-id='type-id-720' size-in-bits='64' id='type-id-677'/>
    <pointer-type-def type-id='type-id-721' size-in-bits='64' id='type-id-664'/>
    <typedef-decl name='copy_func' type-id='type-id-212' id='type-id-651'/>
    <typedef-decl name='hash_deinit_func' type-id='type-id-120' id='type-id-650'/>
    <typedef-decl name='hash_func' type-id='type-id-118' id='type-id-648'/>
    <typedef-decl name='nonce_func' type-id='type-id-118' id='type-id-652'/>
    <typedef-decl name='output_func' type-id='type-id-118' id='type-id-649'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='cert_types.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-314' const='yes' id='type-id-722'/>
    <pointer-type-def type-id='type-id-722' size-in-bits='64' id='type-id-723'/>
    <function-decl name='gnutls_certificate_type_list' mangled-name='gnutls_certificate_type_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_list@@GNUTLS_3_4'>
      <return type-id='type-id-723'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='ciphers.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-724'/>
    <pointer-type-def type-id='type-id-724' size-in-bits='64' id='type-id-725'/>
    <function-decl name='gnutls_cipher_list' mangled-name='gnutls_cipher_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_list@@GNUTLS_3_4'>
      <return type-id='type-id-725'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='ciphersuites.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-726'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-727'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-728'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-729'/>
    <function-decl name='_gnutls_mac_exists' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-234'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_kx_needs_dh_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-432'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='_gnutls_select_server_cert' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-730'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_priority_get_cipher_suite_index' mangled-name='gnutls_priority_get_cipher_suite_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_get_cipher_suite_index@@GNUTLS_3_4'>
      <parameter type-id='type-id-731' name='pcache'/>
      <parameter type-id='type-id-10' name='idx'/>
      <parameter type-id='type-id-219' name='sidx'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_info' mangled-name='gnutls_cipher_suite_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_info@@GNUTLS_3_4'>
      <parameter type-id='type-id-9' name='idx'/>
      <parameter type-id='type-id-99' name='cs_id'/>
      <parameter type-id='type-id-727' name='kx'/>
      <parameter type-id='type-id-726' name='cipher'/>
      <parameter type-id='type-id-728' name='mac'/>
      <parameter type-id='type-id-729' name='min_version'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_cipher_suite_get_name' mangled-name='gnutls_cipher_suite_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_cipher_suite_get_name@@GNUTLS_3_4'>
      <parameter type-id='type-id-432' name='kx_algorithm'/>
      <parameter type-id='type-id-237' name='cipher_algorithm'/>
      <parameter type-id='type-id-234' name='mac_algorithm'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-730'/>
    <typedef-decl name='gnutls_priority_t' type-id='type-id-268' id='type-id-731'/>
    <qualified-type-def type-id='type-id-733' const='yes' id='type-id-732'/>
    <typedef-decl name='gnutls_cipher_suite_entry_st' type-id='type-id-408' id='type-id-733'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='ecc.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <pointer-type-def type-id='type-id-734' size-in-bits='64' id='type-id-735'/>
    <function-decl name='_gnutls_ecc_curve_is_supported' mangled-name='_gnutls_ecc_curve_is_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_gnutls_ecc_curve_is_supported@@GNUTLS_PRIVATE_3_4'>
      <parameter type-id='type-id-442' name='curve'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_ecc_curve_list' mangled-name='gnutls_ecc_curve_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_ecc_curve_list@@GNUTLS_3_4'>
      <return type-id='type-id-735'/>
    </function-decl>
    <qualified-type-def type-id='type-id-442' const='yes' id='type-id-734'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='groups.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-736'/>
    <pointer-type-def type-id='type-id-736' size-in-bits='64' id='type-id-737'/>
    <function-decl name='gnutls_group_get_name' mangled-name='gnutls_group_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_get_name@@GNUTLS_3_6_0'>
      <parameter type-id='type-id-443' name='group'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_group_list' mangled-name='gnutls_group_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_group_list@@GNUTLS_3_6_0'>
      <return type-id='type-id-737'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='kx.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-432' const='yes' id='type-id-738'/>
    <pointer-type-def type-id='type-id-738' size-in-bits='64' id='type-id-739'/>
    <function-decl name='gnutls_kx_list' mangled-name='gnutls_kx_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_kx_list@@GNUTLS_3_4'>
      <return type-id='type-id-739'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mac.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-740'/>
    <pointer-type-def type-id='type-id-740' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-234' const='yes' id='type-id-742'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-743'/>
    <function-decl name='gnutls_digest_list' mangled-name='gnutls_digest_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_list@@GNUTLS_3_4'>
      <return type-id='type-id-741'/>
    </function-decl>
    <function-decl name='gnutls_mac_list' mangled-name='gnutls_mac_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_list@@GNUTLS_3_4'>
      <return type-id='type-id-743'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_nonce_size' mangled-name='gnutls_mac_get_nonce_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_nonce_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-234' name='algorithm'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gnutls_mac_get_key_size' mangled-name='gnutls_mac_get_key_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_mac_get_key_size@@GNUTLS_3_4'>
      <parameter type-id='type-id-234' name='algorithm'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gnutls_digest_get_id' mangled-name='gnutls_digest_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_digest_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-198'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='protocols.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-433' const='yes' id='type-id-744'/>
    <pointer-type-def type-id='type-id-744' size-in-bits='64' id='type-id-745'/>
    <function-decl name='gnutls_protocol_list' mangled-name='gnutls_protocol_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_protocol_list@@GNUTLS_3_4'>
      <return type-id='type-id-745'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='publickey.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <function-decl name='gnutls_pk_get_id' mangled-name='gnutls_pk_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_get_id@@GNUTLS_3_4'>
      <parameter type-id='type-id-3' name='name'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='gnutls_pk_list' mangled-name='gnutls_pk_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_pk_list@@GNUTLS_3_4'>
      <return type-id='type-id-746'/>
    </function-decl>
    <pointer-type-def type-id='type-id-747' size-in-bits='64' id='type-id-746'/>
    <qualified-type-def type-id='type-id-385' const='yes' id='type-id-747'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sign.c' comp-dir-path='/home/ueno/devel/gnutls/lib/algorithms' language='LANG_C11'>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-748'/>
    <pointer-type-def type-id='type-id-748' size-in-bits='64' id='type-id-749'/>
    <function-decl name='_gnutls_digest_is_insecure' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_sign_get_oid' mangled-name='gnutls_sign_get_oid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_get_oid@@GNUTLS_3_4'>
      <parameter type-id='type-id-315' name='sign'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_sign_list' mangled-name='gnutls_sign_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_sign_list@@GNUTLS_3_4'>
      <return type-id='type-id-749'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='anon_cred.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='gnutls_anon_server_credentials_t' type-id='type-id-750' id='type-id-751'/>
    <class-decl name='gnutls_anon_server_credentials_st' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-752'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dh_params' type-id='type-id-753' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='deinit_dh_params' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dh_sec_param' type-id='type-id-383' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='params_func' type-id='type-id-754' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_anon_client_credentials_t' type-id='type-id-755' id='type-id-756'/>
    <class-decl name='gnutls_anon_client_credentials_st' size-in-bits='32' is-struct='yes' visibility='default' id='type-id-757'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy' type-id='type-id-14' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-757' size-in-bits='64' id='type-id-755'/>
    <pointer-type-def type-id='type-id-756' size-in-bits='64' id='type-id-758'/>
    <pointer-type-def type-id='type-id-752' size-in-bits='64' id='type-id-750'/>
    <pointer-type-def type-id='type-id-751' size-in-bits='64' id='type-id-759'/>
    <function-decl name='gnutls_anon_set_server_known_dh_params' mangled-name='gnutls_anon_set_server_known_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_known_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-751' name='res'/>
      <parameter type-id='type-id-383' name='sec_param'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_dh_params' mangled-name='gnutls_anon_set_server_dh_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_dh_params@@GNUTLS_3_4'>
      <parameter type-id='type-id-751' name='res'/>
      <parameter type-id='type-id-753' name='dh_params'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_client_credentials' mangled-name='gnutls_anon_allocate_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-758' name='sc'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_anon_free_client_credentials' mangled-name='gnutls_anon_free_client_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_client_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-756' name='sc'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gnutls_anon_allocate_server_credentials' mangled-name='gnutls_anon_allocate_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_allocate_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-759' name='sc'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_anon_free_server_credentials' mangled-name='gnutls_anon_free_server_credentials' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_free_server_credentials@@GNUTLS_3_4'>
      <parameter type-id='type-id-751' name='sc'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gnutls_anon_set_server_params_function' mangled-name='gnutls_anon_set_server_params_function' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_anon_set_server_params_function@@GNUTLS_3_4'>
      <parameter type-id='type-id-751' name='res'/>
      <parameter type-id='type-id-754' name='func'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <pointer-type-def type-id='type-id-760' size-in-bits='64' id='type-id-754'/>
    <typedef-decl name='gnutls_dh_params_t' type-id='type-id-761' id='type-id-753'/>
    <pointer-type-def type-id='type-id-762' size-in-bits='64' id='type-id-761'/>
    <typedef-decl name='gnutls_params_function' type-id='type-id-763' id='type-id-760'/>
    <class-decl name='gnutls_dh_params_int' size-in-bits='256' is-struct='yes' visibility='default' id='type-id-762'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='type-id-764' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='q_bits' type-id='type-id-14' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-447' size-in-bits='192' id='type-id-764'>
      <subrange length='3' type-id='type-id-12' id='type-id-35'/>
    </array-type-def>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atfork.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <pointer-type-def type-id='type-id-765' size-in-bits='64' id='type-id-766'/>
    <var-decl name='_gnutls_forkid' type-id='type-id-10' visibility='default'/>
    <function-decl name='__register_atfork' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-766'/>
      <parameter type-id='type-id-766'/>
      <parameter type-id='type-id-766'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-765'>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='auth.c' comp-dir-path='/home/ueno/devel/gnutls/lib' language='LANG_C11'>
    <typedef-decl name='dh_info_st' type-id='type-id-767' id='type-id-768'/>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-768' visibility='default' id='type-id-767'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret_bits' type-id='type-id-14' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prime' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generator' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='public_key' type-id='type-id-257' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-768' size-in-bits='64' id='type-id-769'/>
    <function-decl name='calloc' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='_gnutls_free_dh_info' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-769'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='gnutls_auth_get_type' mangled-name='gnutls_auth_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_auth_get_type@@GNUTLS_3_4'>
      <parameter type-id='type-id-241' name='session'/>
      <return type-id='type-id-258'/>
    </function-decl>
    <function-decl name='gnutls_credentials_get' mangled-name='gnutls_credentials_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_get@@GNUTLS_3_4'>
      <parameter type-id='type-id-241' name='session'/>
      <parameter type-id='type-id-258' name='type'/>
      <parameter type-id='type-id-770' name='cred'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' mangled-name='gnutls_credentials_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_set@@GNUTLS_3_4'>
      <parameter type-id='type-id-241' name='session'/>
      <parameter type-id='type-id-258' name='type'/>
      <parameter type-id='type-id-11' name='cred'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='gnutls_credentials_clear' mangled-name='gnutls_credentials_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_clear@@GNUTLS_3_4'>
      <parameter type-id='type-id-241' name='session'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-770'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='anon.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_dh_common_print_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_figure_dh_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-753'/>
      <parameter type-id='type-id-754'/>
      <parameter type-id='type-id-383'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dh_common_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-772'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_dh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-771'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-772'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='anon_ecdh.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_ecdh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='cert.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <enum-decl name='encipher_type' id='type-id-773'>
      <underlying-type type-id='type-id-70'/>
      <enumerator name='CIPHER_ENCRYPT' value='0'/>
      <enumerator name='CIPHER_SIGN' value='1'/>
      <enumerator name='CIPHER_IGN' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-774'/>
    <function-decl name='_gnutls_handshake_verify_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-480'/>
      <parameter type-id='type-id-772'/>
      <parameter type-id='type-id-315'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_sign_data' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-775'/>
      <parameter type-id='type-id-772'/>
      <parameter type-id='type-id-772'/>
      <parameter type-id='type-id-776'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_kx_encipher_type' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-432'/>
      <return type-id='type-id-773'/>
    </function-decl>
    <function-decl name='_gnutls_kx_supports_pk_usage' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-432'/>
      <parameter type-id='type-id-385'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_verify_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-772'/>
      <parameter type-id='type-id-315'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_sign_to_tls_aid' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-315'/>
      <return type-id='type-id-774'/>
    </function-decl>
    <function-decl name='_gnutls_handshake_sign_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-775'/>
      <parameter type-id='type-id-772'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_kx_supports_pk' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-432'/>
      <parameter type-id='type-id-385'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-776'/>
    <typedef-decl name='gnutls_privkey_t' type-id='type-id-289' id='type-id-775'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dh_common.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_buffer_append_mpi' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-771'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-447'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_dh_set_secret_bits' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_set_psk_session_key' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-772'/>
      <parameter type-id='type-id-772'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_dh_set_peer_public' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-447'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dhe.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_gen_dhe_signature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_dhe_signature' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-772'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_cert_cert_req' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_cert_client_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_server_cert_req' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_client_crt_vrfy' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_client_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_cert_server_crt' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dhe_psk.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <qualified-type-def type-id='type-id-459' const='yes' id='type-id-777'/>
    <pointer-type-def type-id='type-id-777' size-in-bits='64' id='type-id-778'/>
    <function-decl name='_gnutls_ecdh_common_print_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <parameter type-id='type-id-778'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_ecdh_common_client_kx_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <parameter type-id='type-id-772'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_ecdh_common_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_proc_ecdh_common_client_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-778'/>
      <parameter type-id='type-id-772'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_dh_common_client_kx_int' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <parameter type-id='type-id-772'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='rsa_psk.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <function-decl name='_gnutls_get_public_rsa_params' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-779'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_gnutls_gen_psk_server_kx' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-771'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-779'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='srp_kx.c' comp-dir-path='/home/ueno/devel/gnutls/lib/auth' language='LANG_C11'>
    <typedef-decl name='SRP_PWD_ENTRY' type-id='type-id-780' id='type-id-781'/>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-781' visibility='default' id='type-id-780'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='username' type-id='type-id-5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='salt' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='g' type-id='type-id-257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='n' type-id='type-id-257' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-781' size-in-bits='64' id='type-id-782'/>
    <pointer-type-def type-id='type-id-782' size-in-bits='64' id='type-id-783'/>
